[
    {
        "url": "https://wiki.metakgp.org/w/Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter",
        "title": "Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter",
        "content": "CRY\nNumber of members\n-\nWebsite\nwww\n.facebook\n.com\n/CRY\n.IITKGP\nContact\n<Phone_No and Name>\nUnder\nTSG\nNo\nChild Rights and You (CRY) was started in 1979 by Mr. Rippan Kapur and 6 friends to improve the condition of the underprivileged Indian child. CRY IIT Kharagpur Volunteer Chapter was started on 6th April, 2010  under the leadership of Ramanuj Lal and Monish Salhotra to bring about a change in the lives of the deprived children in and around their campus and formed CRY IIT Kharagpur Volunteer Chapter. CRY IIT Kharagpur Chapter is a group volunteers with a passion to improve the lives of children of our society, specially around Kharagpur. The Chapter functions under CRY Kolkata Regional Office.\nHistory\nChild Rights and You\nAs per\nCRY's website\n\"Way back in the 1970s, Rippan Kapur, a young airline purser, was driven by the extraordinary dream to see a day when no Indian child would be deprived of rights as basic as survival, participation, protection and development. Like many of us, Rippan too was upset when he saw disparities between privileged and underprivileged children. He hated to see children begging and working as servants. Unlike most of us though, he did something about it. He joined his school’s social service club and read to the blind, visited children in hospitals, held reading and writing classes for street children, and started a free dispensary at a slum the club adopted. To raise funds for these activities, the club sold milk. It even won a shield for the best Interact club! These qualities of resourcefulness and determination came in handy.\nCRY IIT Kharagpur Volunteer Chapter Team\nIn 1979 Rippan and 6 friends started CRY with Rs 50 around his mother’s dining table. They felt that something needed to be done to improve the situation of the underprivileged Indian child. Uncharacteristically, given their backgrounds and motivations, they chose not to start a grassroots-level implementing organisation working directly with and for underprivileged children. They opted instead to make CRY a link between the millions of Indians who could provide resources and thousands of dedicated people and organisations at the grassroots-level who are struggling to function for lack of them. This “link” or enabling position has determined CRY’s strategic choices at every juncture – from the fundraising methods it employs, to the nature of its relationship with the NGOs it partners with.\"\nIIT Kharagpur Chapter\nTo bring a change was the thought of a handful of students of IIT Kharagpur, in March 2010. They joined hands under the leadership of Ramanuj Lal and Monish Salhotra to bring about a change in the lives of the deprived children in and around their campus and formed CRY IIT Kharagpur Volunteer Chapter. With the help of Saptak Mohanta, a former intern at CRY Kolkata and few other motivated acquaintances, a strategic team was formed. It has gradually become a decent group of students from various fields of engineering, science, law and MBA. The initiative was flagged off with the launch of a photography contest in the campus which witnessed participants submitting their entries on issues of child rights in and around their campus which often remains unnoticed.\nBeliefs\nCRY does not believe in running schools or orphanages or initiating vocational training. CRY believes in permanent change, policy level and implementation level change, so that the change impacts millions of children, is permanent or long term in nature, the children do not have to depend on NGOs for their welfare and it does not substitute the role of the state in ensuring child rights.\nAwards and Achievements\nAchievements\nWe, under the IIT Kharagpur Volunteer Chapter, have taken some initiatives like Mid-day meal project, Barrier-Free IIT Kharagpur project etc. Our biggest achievements till date are:\n1. Successfully catalyzing implementation of Mid-Day Meal in Mirpur Adivasi Primary School along with recruitment of new teachers.\n2. Included as a part of the 'Committee for the welfare of Physically Challenged students of IIT Kharagpur'.\n3. Conducted an Access Audit of IIT Kharagpur, with instructions from the Dean (UGS) and submitted a report that resulted in infrastructural changes in the campus including building of ramps.\n4. Conducted numerous RTE campaigns to promote Right to Education Act and other education related policies.\n5. Organized two international photography competition entitled Focus Right to promote child rights.\n6. Team \"Project Baalrakshak\" conducts Awareness cum Workshop on Child Sexual Abuse for the children and their parents in assistance with Paschim Medinipur District Police. Under this project till date 84 sessions are being conducted in 20 schools were children from nursery to class XII participated, also 32 sessions were conducted with the parents of those children. Till date around 5352 children and parents have attended the sessions. Project Baalrakshak has been recognized by Kharagpur Municipality.\nAwards\nTeam \"Project Baalrakshak\" has secured \"3rd Prize\" for presenting \"Poster\" regarding the work on \"Child Sexual Abuse\" in \"2nd International Workshop (The Science of Happiness) - Happiness and Wellbeing: The Road Beyond\" which was conducted by Rekhi Centre of Excellence for the Science of Happiness at IIT Kharagpur from 4-6 April 2019.\nActivities\nCRY IIT Kharagpur Chapter has various activities occurring on a regular basis.\nProject Baalrakshak\nProject Baalrakshak founder, Mr. Rajarshi Debnath, taking a session with adults about child sexual abuse.\nFrom Mars Orbital Missions to Curiosity Rover, from breathtaking researches in Artificial Intelligence to audacity in medical technology, from astonishing expeditions in the deepest of the oceans to lofty skyscraping infrastructures, the humanity has arrived at its dawn where the development had never earlier reached and sustained this great pace that it has now, the global economy has never been so stable, survival has never been such a duck soup.\nBut even for all these things, where are we still? Sometimes, we fear and wonder if in times like these, will childhood be as gleeful and enjoyable. But, unfortunately, that is the least of the worries we can think of.\nAccording to the statistics, one of the surveys sampled over more than 45,000 children in the age group 12-18, across different states of the country, revealed that half of the children were victims of child sexual abuse in one way or another. Adding to it, the taboo and fear of society are still ingrown in the people as one in four cases of child sexual abuse goes unreported. Victims of child sexual abuse are about four times more likely to develop symptoms of drug abuse and experience PTSD as adults and are about three times more likely to experience a major depressive episode as adults.\nPOSCO Act which defines a child as any person below the age of 18 years and provides protection to all children under the age of 18 years from the offenses of sexual assault, sexual harassment and pornography was passed in the parliament in 2012, but still as we can see from the stats, we are far from making our country, in all its truest forms, safe for children.\nMoved by these atrocities and himself being a survivor of child sexual abuse, Rajarshi Debnath, a research scholar and a thoroughly motivated volunteer in CRY IIT Kharagpur Volunteer Chapter, now also a recipient of iVolunteer awards came up with a little thought of doing something for the children, trying to prevent child sexual abuse by making people aware of it. This small idea was named \"Project Baalrakshak.\" It all started two years back, in 2016. This idea of Child Sexual Awareness Workshops, as prolific as it did sound was challenging in all its means. It was a hard task to get suitable enough volunteers who could be dedicated and deliver the sensitive content appropriately and convincingly to the audience which was to comprise of children from classes nursery to 12th, parents and teachers. Tackling with all these issues the first workshop was eventually conducted in Balrampur high school in Kharagpur in September 2016. Though, there still were many troubles, Rajarshi stood unfaltered, finally getting a very dedicated team of his own, with the help which Project Baalrakshak has now gained widespread fame, from making his founder Rajarshi Debnath, a finalist in iVolunteer Awards 2019 to gaining assistance from Mednipur District Police, getting featured in a total of 22 print and digital media, and reaching around 5200 children, parents/guardian in a total of 19 schools, in its two years of working period. Team Project Baalrakshak also received a letter of appreciation from the Ward Counselor of Kharagpur.\nA Project Baalrakshak session teaching children about good touch and bad touch.\nAs a result of Team Project Baalrakshak's attempts, many children and parents had finally broken down their silence and talked about sexual abuse that the children were a victim of. Furthermore, it was found that in 19% cases, culprits were unknown, 57 % were family friends/friends, 21 % close relatives, and 12 % school/tuition teachers, which to a large extent matches with the national reports. Earlier Team Project Baalrakshak had to approach schools and convince them for their sessions, but now for the success, they have attained in their field, they're now actively invited by schools for conducting sessions.\nTeam has conducted workshops in Kharagpur, Medinipur and Jhargram. This team is also featured in \"LINK (LBSNAA Innovation NetworK)' which is a platform working to connect the needs of the field administrators to a wide audience of technology providers, innovators, skilled man-power ecosystems and finance sources.\nThings don't change as swiftly as we sometimes want them to be, nevertheless they do remain in that state of stagnancy as it is for the sheer and consistent efforts of those around who seek to get the change, no matter what it takes and how it takes, their results will definitely mark the screen for both the upcoming and ongoing generations; seekers, believers and finally, achievers.\nCurrently, Team Project Baalrakshak is headed by Ms. Parama Mukhopadhyay and Mr. Turin Datta who took charge on February, 2019.\nSchool Sessions\nA volunteer teaching children\nC.R.Y is an non profit and non government organisation working for the betterment and upliftment of the underprivileged children in India. We are the volunteers at the Kharagpur Chapter under C.R.Y., Kolkata where our mission is to develop the condition of the children around and inside the campus. The most active section of our chapter is the team who oversee the school sessions. Every Saturday, we go to middle schools at Arasini and Amlatoria where we teach and interact with the children from Classes I to IV. Our main aim is to cover the things which they otherwise are not able to do in their regular course curriculum. We cover things like basic maths, story telling, puzzles, games, science experiments, good food habits and importance of health. For the children at Amlatoria, with the efforts of the volunteers, we have successfully built a playscape at the school playground. We also have bought a projector for the school at Amlatoria and in pursuit of buying one more for the other one. We, as volunteers want that the children should learn good amount for moral and social etiquettes for a good and decent survival in this cut throat world. Then only will our long term goal will be achieved.\nMedical Camps\nC.R.Y IIT Kharagpur Volunteer Chapter organises medical camps every year at Amlatoria and Arashini villages. Medical camps are organised to make basic healthcare accessible for all. These villages have no healthcare facilities or even a qualified healthcare worker. Majority of the people living in remote villages are daily wage labourers, who earn very meagre income. They don’t go hospital or get a health checkup even when they are sick. Because, their little income won’t be sufficient to afford to the costs of getting a good health checkup or buying the medicines the doctor has prescribed for them. \nMedical Camp conducted last time was a huge success with more than 200 villagers attending the camp. A group 16 doctors were a part of this camp and they personal attention to everyone. Medicines were given free of cost.\nScience Exhibitions\nAn experience with virtual reality during a science exhibition.\nCRY IIT Kharagpur volunteer chapter conduct school sessions on a regular basis to motivate children for their better future. Education does not simplify mean the ability to read and write, So for the complete process of development, volunteers conduct science exhibition every academic year in which volunteers prepare various science models for children and present them to the children to explain and understand science practically. Science exhibition is mostly directed towards the basic science in daily life like respiration, fire burning, water absorption by plants. Volunteers made models to explain to the children the basic sciences to increase interest  and relate to their daily life so that they can understand easily.\nCommunity Meetings\nCommunity meeting, a gathering in which we see a participation from the parents, guardians and other members of the society, we stand up to focus on the potholes, discuss about their causes and find solutions to them. Community levels on a village level mainly aims to bring in light the various issues that the children are facing and make the people aware of certain topics which might go neglected if unattended, but tend to have a big impact on the lives of children. Certain issues like sanitation,  basic child rights, menstruation, importance of mental health, safe drinking water, first aid methods, importance of basic education especially for girl child etc. need to be projected before the community to them aware of it as it indirectly helps children as they are the members of the community as well and if the community nourishes, children are defaulty the benefiitters. The contents discussed there is pre-prepared which is delivered by our volunteers in an overall interactive session.\nIn the Accupressure awareness community meeting, held at Arasini School, awareness was spread about the various acupressure points realizing that the people at the villages lack basic medication. Another meeting focussed on the menstrual health of women. People were made aware about what is menstruation and what kinds of problem women have during menstruations and their solutions were discussed. They came to know how the age old taboos have no scientific base and that the periods are completely normal, and any problem can be solved by correct consultation from the doctor and by maintaining hygiene.\nThe latest meeting was based on the purity of water in the water sources around the village. There is a high possibility of them being contaminated by high arsenic content which is harmful for both humans as well as for the crops. Their harmful health effects, sources of contamination, methods of identification and filtration of water techniques were discussed in detail.\nSuch meetings provide an easy yet effective way for people to come together and discuss their problems and viewpoints and find solutions together for the betterment of the community as a whole. We at CRY, IIT Kharagpur are constantly putting efforts for more and more such meetings to solve as many problems as we can to bring a positive effect on their lifestyle and add meaning to their life.\nChild Labour Survey\nChild rights and you is a non-profited organisation which works in different aspects of developing and protecting a child life by different means one of the aspect is to free the country from child labour. Child labour is the service paid by the children in their childhood in any field of work. This is done by the child own due to the lack of resources for the life survival, irresponsibility of the parents or forcefully by the owner for increasing their return on investment at low investment. It does not matter the cause of child labour as all the causes force children to live their life without childhood. Childhood is the great and happiest period of the lives of everyone during which one learns about the basic strategy of the life from parents, loved ones and nature. Child labour interferes with the proper growth and development of the children in all aspects like mentally, physically, socially and intellectually. The volunteers and members of cry IIT Kharagpur has dedicated there every dime of potential to make the IIT Kharagpur campus free of child labour and for that they have conducted many surveys inside the campus in different section and has made a stats to show that the campus of IIT Kharagpur is finally free of child labour.\nA Playscape made with funds raised.\nPlayscape\nChildhood is the most beautiful part of our lives, full of fun, play and activities. But some children never get to see what a playground is. To give the chance of playing in a playground to the children of Amlatoria Primary School, CRY IIT Kharagpur Chapter organised a fundraiser to build a playground. The fundraiser started in the beginning of 2018, aimed to raise funds of Rs. 1,25,000 through the crowdsourcing platform, Ketto. The designs for the playscape were made by Anthill Creations and the playscape was made from tyres and other recyclable materials. The project had a support of 159 contributors who helped by donating to make this project a reality. The contributors included students and professors of IIT Kharagpur as well as many well wishers. Door-to-door as well as social media campaigns helped to draw contributors to this. Funds were also raised for this at the stall set up during Spring Fest, in order to reach people outside Kharagpur.\nSince the playground has been constructed, children have a chance to play among various swings and mazes constructed on the ground. This play inculcates a feeling of curiosity, inquiry and adventure. Even now, the children are building memories on that playscape that they will cherish for a lifetime.\nInstallation of Projector\nChildren watching content projected using the projector installed.\nWe know that almost every child is getting education, but are they  getting proper education, with sufficient modern facilities? The answer is ‘no’. Still There are schools where students don’t get good quality education and not exposed to the outer world or current affairs in their own country Eg: who is the prime minister of India.The children need special guidance to know about all these things i.e. good communication skills and other parts of education like sciences etc.\nVolunteers of  CRY IIT Kharagpur are trying to tackle this problem. One of the steps taken by these volunteers is using projector in the nearest government school named Amlathuri. Due to the poor facilities in the school children are not able to learn subjects well so volunteers of CRY IIT Kharagpur bought a projector and they are giving training to the teachers sing this projector the volunteers want show some videos of English stories(so that it would be helpful for their improvement in communication skills in English and some videos related to other subjects in their course). The teachers given training to use this projector so that in the absence of the volunteers they can use it and show the videos related to respective topic.\nTeam\nCRY IIT Kharagpur Chapter has members from all sections of IIT Kharagpur's Student Body including UG, PG and RS. Currently the administrative heads are Ashish Rathor (NA '20) and Vikram Chugh (CE '20)\nSocial Media\nCRY - Child Rights and You is an Indian Non Government Organisation that catalyses change in the lives of underprivileged children in India by restoring their rights.\nFor more information about Child Rights and You (CRY) IIT Kharagpur Volunteer Chapter\nFacebook:\nhttp://www.facebook.com/CRY.IITKGP\nTwitter:\nhttp://twitter.com/cryiitkgp\nYoutube:\nhttp://www.youtube.com/user/CRYIITKGP\nBlog :\nhttp://www.cryeastvols.wordpress.com/\nLinkedIn:\nhttp://www.linkedin.com/groups/Child-Rights-You-CRY-IIT-3825287\nArchives\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Child_Rights_and_You_(CRY)_IIT_Kharagpur_Volunteer_Chapter&oldid=91494\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ES69007:_Energy_Sysytems_Laboratory",
        "title": "ES69007: Energy Sysytems Laboratory",
        "content": "ES69007\nCourse name\nENERGY SYSYTEMS LABORATORY\nOffered by\nSchool of Energy Science & Engineering\nCredits\n4\nL-T-P\n0-0-6\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nEnergy System Lab (L1) (0-0-6) 4 CreditList of ExperimentsS.No. Name of\nExperiment Faculty Incharge1. Manufacture of Dye Sensitized Solar Cells and\nAssembly of DyeSensitized Solar CellsProf. J Chakraborty2. Testing of Dye\nSensitized and Other Types of Solar Cells. Prof. J Chakraborty3. Fabrication\nof Supercapacitor . Prof. A Chandra4. Cyclic Voltametric Studies of Li-Ion\nBatteries and Supercapacitor . Prof. A Chandra5. Determination of Surface Area\nof Nanostructured ElectrodeMaterialsProf. A Chandra6. Flame Propagation in a\nTube. Prof. S Dash7. Table Top Gas Turbine (Combustion of Oil to Rotate a\nTurbine) . Prof. S Dash8. Characterization of Various PV Modules Using Sun\nSimulator . Prof. P Bajpai9. (a) Performance Study of Wind Energy System with\nVariation inWind Speed and Pitch Angle(b) Indoor Measurement of V-I\nCharacteristics of a Solar Panel atVarious Levels of Insolation, and the\nIdentification of theEquivalent Circuit ParameterProf. P Bajpai10. Microbial\nFuel Cell (MFC) for the Electric Power Generation andWastewater TreatmentProf.\nD Das11. (a) Software Projects(b)\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nIn Dept\nIn Dept\nTuesday\nIn Dept\nIn Dept\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ES69007:_Energy_Sysytems_Laboratory&oldid=56567\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Department_of_Mathematics/Viva_Voce_Questions",
        "title": "Department of Mathematics/Viva Voce Questions",
        "content": "Viva Voce Questions\n#\nQuestion\nAnswer\nProfessor\nYear\n1\nTime complexity of bubble sort (worst case and best case), Archimedean principle, comparing cardinality of infinite sets, and vector space solution of a matrix equation.\nSimply keep your cool while answering. If they think you are not getting the answers, they will throw some additional hints for you to answer. Just keep calm, and be confident in your answers.\nChair: DK Gupta, S Choudhury, Ratna Datta, D Biswas, Gyaneshwar, J Kumar, K Ghoshal\n3rd(2017)\n2\nFundamental questions on Linear Algebra ( Example of a vector space of particular dimension, Whether a particular equation represents a vector space or not), Proof of a theorem in Group Theory (Don't remember the exact one), Friend functions in CPP (Was made to write code on the whiteboard)\nDo not try to answer if you are not sure about it. Simply accept that you are not sure and let them move on. Prof. Somesh Kumar is sure to bombard some statistical problems, so being prepared in Probability and Stats always helps in case you happen to fall into his panel. They will most probably ask your topic of interest. Make sure you have a good command of the fundamentals of the topic.\nChair : Prof Somesh Kumar, GP Rajashekhar, Bappaditya Bhowmick, Pawan Kumar\n3rd\n3\nPawan Kumar (Algo): Write a java program which includes public, private, protected functions, objects Asis Gangoli(Mathematical Methods: Singular point, pole definition.VK Jain: open set, closed set, contact point, interior point definitions, Allu Vasudevara(Linear Algebra, Measure theory and Integration), measurable function\ndo not try to answer if you are not sure about it. Simply accept that you are not sure and let them move on.\nChair: Asish Gangoli, Pawan Kumar, MP Biswal, VK Jain,Allu Vasudevara\n3rd\n4\nQuestion regarding PDE like general form, how to identify the type of PDE, Canonical Form and Numerical Solution of the PDE. Ratna Datta asked basics of DFA, NFA and epsilon NFA and then Regular Grammar. Prof. Bhowmick will ask basic definitions and proofs he has recently done in class.  Pro. Panda will ask basic of transportation problem and assignment problem mainly.\nJust know the basic concept of every subject. @Juniors try to prepare short notes of every subject you study in a semester. It will help you a lot during the Viva bcoz Vivas are generally held in near the exams so you won't have much time preparing for it.\n3rd\n5\nDefinitions of a poset, lattice, and boolean algebra. Diagonalization of a matrix and conditions for it. The condition where sin and cosine transforms are applicable.\nPrepare at least one subject very well.\nChair: Prof. PVSN Murthy, Ratna Datta, B Bhowmick, Geetanjali Panda\n3rd\n6\nQuestions were mostly from the subjects taught in the current sem.Some definitions from Automata theory, Boundary conditions and discretization schemes from ANT, Real Analysis definitions(open sets, closed sets etc.) In the end, there was some discussion regarding my future path.\nExcept Ratna Dutta, pretty much everyone tried to focus on the basics.\nChair:Prof Ratna Dutta, PVSN Murthy, J Kumar, MP Biswal, VK Jain\n3rd\n7\nTwo questions on fluid mech: one on checking conditions for a given flow to be valid (incompressible and irrotational) and another one on cases of continuity equation. One on whether a 3x3 matrix is diagonalizable. One on topology (base def and ex.). And last one was reg. binomial and hypergeometric distributions.\nGoing through basics of courses relevant to panel very quickly will suffice.\nPanel: Profs GPRS, R Dutta, S Mukhopadhyay, R Gayen, PD Srivastava, Bhowmick, D Biswas, S Kumar (absent)\n5th\n8\nMarkov Chain, Topology (Compactness, Interior points, Open sets)\nProf. Somnath Bhattacharya, Gnaneshwar, Nahak, T Rajshekar, V K Jain, Nitin Gupta\n5th\n9\nWhat is a Poissons process, inner product space, positive definite matrix, finite vector space\nProf. Somnath Bhattacharya, Gnaneshwar, Nahak, T Rajshekar, V K Jain, Nitin Gupta\n5th\n10\nLinear independance in a Vector space comprised of all continous function in (-1,1). Definition of Topology, Topological space, Basis, Subbase. Example of a topology. Housedorf Space.\nIf you are assigned to this panel, chill out and relax. Also, try and practice listening to Gnaneshwar speak because it gets extremely hard to understand him with his accent. By far the hardest part of the viva. Prepare Linear Algebra as it will be helpful in basically any panel.\nProf. Somnath Bhattacharya, Gnaneshwar, Nahak, T Rajshekar, V K Jain, Nitin Gupta\n5th\n11\nSecond order PDE & ODE IVP, Compactness defition, Given a proof on topology and asked to prove! Rank Nullity Theorem and its proof in infinite space, Defitions of NFA n DFA, Difference between NFA n DFA, What is regular expression. And what are the difference between regular language and context free language. Two more questions from Functional Analysis. (Didn't remember exactly) and one proof from SFA\nIf GPRS is iin your panel. Do prepare PDE. If you answer a single question then there will be no further questions from other panalists. Hardly you'll have to face two more questions from other topics. And Linear Algebra  will be our saviour for that day no matter which panel you'll get.\nPanel: Profs GPRS, R Dutta, S Mukhopadhyay, R Gayen, PD Srivastava, Bhowmick, D Biswas, S Kumar (absent)\n5th\n12\nWhat is countable set?(0,1) countable or not? what is the difference between DFA & turing machine? given stream function find velocity potential. Regular expression definition. 0^n1^n -> regular expression or not.\nsay \"Fluid Mechanics\" in ur favourites if Prof. GPRS is in ur panel, he will save you. Just go through basics of Fluid Mechanics like Navier stokes, Bernoulis etc. Dont panic. Answer only if you know perfectly. Know at least the topics(names) of SFA.\nPanel: Profs GPRS, R Dutta, S Mukhopadhyay, R Gayen, PD Srivastava, Bhowmick, D Biswas, S Kumar (absent)\n5th\n13\nBasic questions from Linear Algebra ( Span , Eigen values and Linear Transforamtion), ellipitical PDE and change into cannonical from (Proof was required), Statistics(pdf of Normal distribution and question related to confidence interval ), Topology (Hausdroff Space , subspaces)\nPanel: Profs GPRS, R Dutta, S Mukhopadhyay, R Gayen, PD Srivastava, Bhowmick, D Biswas\n5th\n14\nBasic Questions from Probability(Mutually Exclusive events.Definitions of pdf, mean , median, mode and their value for normal distribution).Basic idea of measure(properties like countable subadditivity and one or two problems using that property).Basic calculus questions(topics taught in Maths-I, Maths-II)\nWith this panel, just be optimistic that you aren't grilled on the topics of PDE.Most of the profs seemed friendly, even praising you if you answer correctly.However,M.P.Biswal's entry provided a deathly blow to the benevolence of the panel.\nPanel:Profs A.Ganguly, V.Allu, M.P.Biswal, J.Kumar, K. Ghosal,R. Nanduri,S.R.Khare\n5th\n15\nSome questions from Linear Algebra (pretty straight forward provided u remember them) - Define Inner Product Space, Is a set of real numbers a vector space, (over which field and what dimension), Cauchy Schawrz Inequality, Grahm Schmidt Diagonalization Process, Heini Borel Theorem, some tough PDE questions - Method of Separation, when is it used, Characteristic curve Properties, canonical form etc.), Statistics - distributions which possess memory less property, some questions on geometric distribution,\nWell frankly the panels wont be same as we had. So I would suggest make sure you strongly prepare 2-3 subjects because almost every panel would ask what u know, In my case, Prof. S bhattacharya just went out when my GV started, so i was at loss as I had prepared his subjects well. Linear Algebra is a must as we have a lot of profs. who have an expertise in that field . One thing I would want to say is - if its not a strictly roll no. wise call, try to go early as the Profs. would then ask you basic questions,. In  our panel, the GV got tougher as time went by. Do not forget to prepare the Depth courses of the semester you are in. Dont say subjects which no prof in the panel knows, else they would start questioning you from random subjects then.Dont Panic, it would hardly last for 15 minutes\nChair : Prof. N Gnaneshwar, V K Jain, Nitin Gupta, T Raja Sekhar, B Adhikari..\n5th\n16\nQuestions spread over analysis - what's a real number?, Lebesgue measurable functions, Riemann integrable functions, Vector spaces examples. Crypto and Information Theory - measurement of information, GF(8) finite field, primitive polynomials.\nChair : Prof. N Gnaneshwar, V K Jain, T Raja Sekhar, B Adhikari..\n5th\n17\n1. Diagonizable matrices 2.) What is the dimension of R(Q) 3.) How do you define vector spaces with infinite dimension 4.) Fourier series expansion derivation 5.) Sufficient and necessary conditions for a minima 6.) What do you mean by eigen vectors and eigen values 6.) what are the restrictions on eigen vectors 7.) explain nelder mead method 7.) Thomas Algorithm\nMention only those subjects which you have read thoroughly! Prof. Allu will ask difficult questions in Linear algebra, so when you mention the topics you have prepared for GV think at least twice before saying Linear Algebra, R Gayen and Panda are cool profs, just go through the basics of NLP and ANT.\nChair: D K G, Allu, Nahak, Somesh kumar, R Gayen, Geetanjali Panda, GPRS, Khare\n5th\n18\n1. Diagonizable matrices 2.) What is the dimension of R(Q) 3.) How do you define vector spaces with infinite dimension 4.) Fourier series expansion derivation 5.) Sufficient and necessary conditions for a minima 6.) What do you mean by eigen vectors and eigen values 6.) what are the restrictions on eigen vectors 7.) explain nelder mead method 7.) Thomas Algorithm\nChair:  K.Ghosal,R.Gayen,P.Panigrahi,R.Dutta\n5th\n19\nAlgebra: What is eigen vector, eigrn values? Eigen values of AB or BA will be same or not? prove it. Goswami sir asked about timestamp protocol and basics of dbms. Stats: Give example of one contn. and one discrete distribution function. mean, variance of such functions. What is uniform continuity whether 1/x is uni.cont. in (0.1) or not? in(1,2)? The condition other than continuity for unfiorm cont. will be ? (boundedness)\nChair: Biswal, Bhowmick, B Adhikari, Nitin Gupta, N Gnaneshwar, PVSN Murthy, Nanduri, Adrijit Goswami\n5th\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Department_of_Mathematics/Viva_Voce_Questions&oldid=22349\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MM61311:_Quantitative_Techniques_In_Medicine",
        "title": "MM61311: Quantitative Techniques In Medicine",
        "content": "MM61311\nCourse name\nQuantitative Techniques In Medicine\nOffered by\nSchool of Medical Science and Technology\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nTuesday\nIn Dept\nIn Dept\nWednesday\nThursday\nIn Dept\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MM61311:_Quantitative_Techniques_In_Medicine&oldid=56990\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/TE69101:_Seminar_-_I",
        "title": "TE69101: Seminar - I",
        "content": "TE69101\nCourse name\nSeminar - I\nOffered by\nG.S Sanyal School of Telecommunication\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nGSCLA1\nGSCLA1\nGSCLA1\nGSCLA1\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=TE69101:_Seminar_-_I&oldid=56658\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MI40039:_Elements_Of_Petroleum_Engineering",
        "title": "MI40039: Elements Of Petroleum Engineering",
        "content": "MI40039\nCourse name\nElements Of Petroleum Engineering\nOffered by\nMining Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n2\n4\n3\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to oil fields, flow of fluid through rocks, Petroleum reservoir\ntypes, characteristics, Performances and calculations. Genesis of hydrocarbon\nand migration into reservoir rock, reservoir rock properties (porosity and\npermeability), Hydrocarbon traps and seals, oil sands and estimation of oil and\ngas reserves, oil field water, formation evaluation, well logging, sedimentary\nenvironment and well log interpretation. Drilling for oil and gas exploratory\nand production drilling m mud technology, drill bits, Drill rigs and structure,\nOff shoe drilling, directional drilling , Casing and cementing, well completion\nand stimulation. Petroleum production methods, traditional and artificial lift,\nsucker rod pumping systems and gas lifting, secondary and enhanced recovery,\nCrude transportation, pumping and pipeline components-operation and\nmaintenance, International oil market and oil economics\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nIn Dept\nThursday\nIn Dept\nFriday\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MI40039:_Elements_Of_Petroleum_Engineering&oldid=56952\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE69101:_Seminar-i",
        "title": "CE69101: Seminar-i",
        "content": "CE69101\nCourse name\nSeminar-i\nOffered by\nCivil Engineering\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE69101:_Seminar-i&oldid=56299\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CH60026:_Fundamentals_Of_Particle_Technology",
        "title": "CH60026: Fundamentals Of Particle Technology",
        "content": "CH60026\nCourse name\nFundamentals Of Particle Technology\nOffered by\nChemical Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nOverview of particle technology. Nucleation of particles from homogeneous\nsolutions. Surface energy. Classical nucleation theory, heterogeneous\nnucleation, nucleation through organizers. Growth of crystals. Diffusion\ncontrolled growth, surface nucleation controlled growth, dislocation controlled\ngrowth. Growth rate of crystal faces. Development of crystal shape. Controlling\nthe crystal shape by manipulating process conditions. Breakage of particles.\nBreakage of drops in a stirred vessel. Milling. Techniques for measurement of\nsize distribution: Sieving, Light scattering and Focused Beam Reflectance\nMeasurements (FBRM). Introduction to population balance modeling.Colloidal\nparticles. Introduction to interfacial and colloidal phenomena. Energy of\ninteraction between colloidal particles. Brownian motion. Flocculation and\nsintering. Colloidal stability. Electric double layer. Debye-Huckel theory,\nDerjaguin-Landau-Verwey-Overbeek (DLVO) theory of colloidal stability.\nStabilization of particles using surfactants and polymers. Emulsions and\nmicroemulsions. Nanoparticles. Synthesis of colloidal particles by gas phase\ncondensation, liquid phase precipitation or using surfactant templates.\nApplications of colloidal particles in renewable energy, biomedical engineering\nand drug delivery.Text/Reference Books: 1. Principles of colloid and surface\nchemistry by Hiemenz and Rajagopalan 2. Intermolecular and surface forces by\nJacob N. Israelachvili 3. Physical Chemistry of Surfaces by A. W. Adamson 4.\nColloidal domain: where physics, chemistry, biology and technology meet by D.\nFennell Evans and HÃ¥kanWennerstrÃ¶m\nConcepts taught in class\nStudent Opinion\nThe concepts taught in class range from relatively common concepts in electrostatics, to more nuanced aspects of particle engineering. The first half of the course dealt largely with surface phenomena and the latter half with crystallization and models for quantifying them. The course is not very demanding in terms of time required to study, however some concepts in the latter half of the course requires a few iterations.\nPros: It is a good course if you are interested in population balance, surface phenomena etc, and most of the topics covered are readily available in the book suggested by the professor\nCons: Sometimes there is lack of structure in the course.\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CH60026:_Fundamentals_Of_Particle_Technology&oldid=88135\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Career_Development_Centre",
        "title": "Career Development Centre",
        "content": "This article or section\nis in the process of an expansion or major restructuring.\nYou are welcome to assist in its construction by editing it as well.  If this article or section\nhas not been edited in several days\n, please remove this template.\nThis article was\nlast edited\nby\nMeetjoshi\n(\ntalk\n|\ncontribs\n)\n6 years ago.\n(\nUpdate\n)\nThe Career Development Centre (previously known as the Training and Placement Cell) aims to guide students to think in terms of careers where they can excel in their inherent potential. CDC is not only responsible for the Placements of students of IIT Kharagpur but also assists them in developing the necessary skills to be proficient in their field of interest.\nHistory\nStudent Placement Committee\nOffice-bearers\nChairmen\n[\n1\n]\n2018-19\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2017-18\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2016-17\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2015-16\n[\n3\n]\nPost\nOffice-bearers\nChairman\nProf. Sudhirkumar Barai\nVice Chairman (Training and Placement)\nProf. Debasis Deb\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\nCo-ordinators\n[\n1\n]\n2016-17\n[\n2\n]\nPost\nPresent office-bearers\nInstitutional Development Executive\nMr. Shivam Gupta\nPlacements\nMr. Dinesh Karmakar\nInternship\nMr.V S Somayajulu\nPost Placement / Internship\nMr. Makhan Maiti\nStudent Co-ordinators\n2016-17\n[\n3\n]\nName\nMr. Shovan Panigrahi (PH '18) (\nVPTSG\n)\nMr. Ankit Sharma (MI '18)\nMr. Ashutosh Dwivedi (HS '18)\nMr. Ayaaz Sabir\nMr. Saksham Saxena (PH '18)\nMr. Nirav Vipulbhai Doshi (ME '18)\nMr. Vipul Bhola (CE '17)\nMr. Apoorva Sharma (EE '18)\nMr. Hardik Dnyaneshwar Katyarmal (EE '18)\nMr. Sushant Sudheendranath (CH '17)\nMr. Shubham Sharma\nMr. Sanket (GG '18)\nMs. Asweta Singh\nMr. Shubham Waghe (MF '18) [Web Coordinator]\n2015-16\n[\n3\n]\nName\nMr. Atal Ashutosh Agarwal (\nVPTSG\n)\nMr. Amrut Rajkarne (EC '17)\nMr. Ankur Agarwal\nMr. Deepak Adhikari (AG '16)\nMr. Manish Goyal (MA '17)\nMr. Naman Nishesh  (MA '17)\nMr. Nikhil Garg (HS '17)\nMr. Rachit Aggarwal (BT '17)\nMr. Sandeep Kumar Siram (ME '17)\nMr. Sankalp Gourisaria (CH '17)\nMr. Sneh Pratik (PH '17)\nMs. Vipasha Jain (HS '17)\nMr. Shubham Waghe (MF '18) [Web Coordinator]\n2014-15\nSee Also\nhttp://www.cdc.iitkgp.ernet.in/\nList of Internship Programs\nReferences\n↑\n1.0\n1.1\n\"Contact us at CDC, IIT Kharagpur\"\n.\nCDC\n. Retrieved\n2015-09-21\n.\n↑\n2.0\n2.1\n2.2\n2.3\nCite error: Invalid\n<ref>\ntag; no text was provided for refs named\n:2\n↑\n3.0\n3.1\n3.2\n\"Contact us at CDC, IIT Kharagpur\"\n.\nCDC\n. Retrieved\n2015-09-21\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Career_Development_Centre&oldid=97155\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Kakashi/Sandbox",
        "title": "Kakashi/Sandbox",
        "content": "Anil Kumar Bhowmick\nKakashi/Sandbox\nDepartment\nRubber Technology Centre\nResearch Area(s)\nPolymer Nanocomposites and Nanomaterials\nThermoplastic Elastomers and Polymer blends\nNew Polymer from Renewable Sources\nPolymer Modification\nRubber Technology\nFailure and Degradation of Rubbers\nAdhesion and Adhesives\nWaste Rubber Recycling\nYear Joined\n1984\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Kakashi/Sandbox&oldid=4687\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Nehru_Hall",
        "title": "Nehru Hall of Residence",
        "content": "Nehru Hall of Residence\nNehru Hall of Residence\nFounded\n3rd March, 1954\nMotto\nसा विद्या या विमुक्तये\nOffice\nWarden\nProf. Mrinal Kaushik\n[\n1\n]\nAsst. Warden(s)\nProf. Ronit Mandal\nProf. Brajesh Kumar Panda\nProf. Mrigank Sharad\n[\n1\n]\nSSM\nOffice No.\n(+91) 3222 281142\nInfrastructure\nCapacity\nAround 440\nAccomodation for\nMale Students\nRoom Types\nTriple (for 1st and 2nd years) , Double (for some 3rd years), Single (most 3rd, 4th and 5th years)\nDetails\nEateries\nAshim's Food Canteen\n,\nCathleen Night Canteen\nShops\nGupta Store\n,\nSharma's Stationery\n(closed)\nNehru Hall of Residence\nLocated in PAN loop, Nehru Hall is the second oldest hall of residence. The motto of Nehru Hall is सा विद्या या विमुक्तये , which means \"Knowledge Leads to Enlightenment\".\nHistory\nNehru Hall of Residence was named after Motilal Nehru, the politician, the lawyer, and the political activist. Nehru Hall is known for its stellar performance in general championship events with having all podiums every year, including a\nplatinum\n(Gold in Technology, Sports and Games, and Social and Cultural) in the year 2006 - 2007, that\nno other hall\npossess. Nehru Hall boasts the\nhighest GCs\nin all\nthree domains\namongst all other hall of residences. Nehru Hall is also known for its\nhighest points\never achieved throughout institute in general championship social and cultural. Nehru Hall achieved a whopping\n1080\npoints and still stands with its record. Even the\nsecond highest points\nis held by Nehru Hall of Residence.\nHall Council Members\nEvery year, a bunch of students willing to serve the hall contest for the positions of Hall President, General Secretary in various domains to give their all in improving the welfare, maintenance, mess and all extra curricular activities.\nDesignation\n2019 - 2020\n2020 - 2021\n2021 - 2022\n2022 - 2023\n2023 - 2024\nHall President\nMr. Raj Tulshan\nMr. Rahul Singhal\nMr. Aashwin Tripathy\nMr. Abhipray Sharma\nMr. Sahil Choudhary\nSecond Senate Member\nMr. Pinaki Mishra\nMr. Rohan Gaggad\nMr. Aaryan Sood\nMr. Kaushal Banthia\nMr. Vansh Agrawal\nGeneral Secretary Technology\nMr. Bhubanendra Mishra\nMr. Shyamvanshi Kumar Singh\nMr. Ojas Deshmukh\nMr. Harsh Verma\nMr. Jayansh Maheshwari\nTechnology Coordinator\nMr. Rithick Prabakar\nGeneral Secretary Sports and Games\nMr. Parvar Yadav\nMr. Shrihari Dhanawe\nMr. Sneh Bandhu Singh\nMr. Mihir Chaudhary\nMr. Shouham Banerjee\nSports and Games Coordinator\nMr. Harsh Sukheja\nMr. Aaditya Shah\nMr. Anshuman Rathore\nGeneral Secretary Social and Cultural\nMr. Shivang Gupta\nMr. Vishaw Kashyap\nMr. Pranjal Verma\nMr. Ishan Nargolkar\nMr. Rutil Hiwale\nSocial and Cultural Coordinator\nMr. Sumit Singh\nMr. Shivam Meena\nMr. Abhinaw Anand\nGeneral Secretary Maintenance\nMr. Govind Gupta\nMr. Shreenivas Chityala\nMr. Pranit Mendhe\nMr. Nitish Kumar\nMr. Satya Narayan Pal\nGeneral Secretary Students' Welfare\nMr. Anand Jawate\nMr. Ajay Menon\nMr. Gaurav Garg\nMr. Shubham Kulkarni\nMr. Vivek Unadkat\nGeneral Secretary Alumni Affairs\nMr. Ajay Menon\nMr. Devesh Gobind\nMr. Lavesh Kasodekar\nMr. Advait Gokhale\nGeneral Secretary Mess\nMr. Uniz Kazi\nMr. Shreenivas Chityala\nMr. Gaurav Jain\nMr. Sumit Singh\nMr. Rithick Prabakar\nMess Auditor\nMr. Pranjal Verma\nMr. G V Sai Saran\nSecretary Library\nMr. Jyotiraditya\nMr. Azad Kumar\nGeneral Championship\nEvery year, all the halls of residence come together to fight and win the cup of general championship in Sports and Games, Technology, and Social and Cultural. Nehru Hall of Residence bags a podium every year and boasts the highest number of GCs in the institute.\nAcademic Year\nTechnology\nSports and Games\nSocial and Cultural\n2023 - 2024\n1\n4\n1\n2022 - 2023\nScrap\nScrap\nScrap\n2021 - 2022\nScrap\nScrap\nScrap\n2020 - 2021\nScrap\nScrap\nScrap\n2019 - 2020\nScrap\nScrap\nScrap\n2018 - 2019\n3\n8\n6\n2017 - 2018\n5\n5\n1\n2016 - 2017\n3\n5\n1\n2015 - 2016\n3\n2\n1\n2014 - 2015\n1\n1\n3\n2013 - 2014\n2\n1\n3\n2012 - 2013\n1\n2\n3\n2011 - 2012\n3\n2\n2\n2010 - 2011\n1\n2\n1\n2009 - 2010\n1\n2\n1\n2008 - 2009\nScrap\nScrap\nScrap\n2007 - 2008\n2\n3\n1\n2006 - 2007\nPlatinum\nPlatinum\nPlatinum\n2005 - 2006\n2\n2\n2\n2004 - 2005\n1\n2\n1\n2003 - 2004\n2\n2\n2\n2002 - 2003\n2\n1\n1\nAmenities\nBasketball court (Half)\nCricket nets\nVolleyball court\nTable Tennis tables\nFootball Ground\nStudents Recreation Hall\nStudents Dining Hall\nStudents Television Watching Room\nCafeteria\nMultiple Courtyards with Lawns\nLandscaping\nCommon Room\nRenovated Rooms\nMusic Room\nHardware Modelling Room\nNotable Alumni\nArvind Kejriwal\n, Indian politician and current Chief Minister of New Delhi, India\nSundar Pichai\n, CEO of\nAlphabet\nArunabh Kumar\n, Founder of\nTVF\nHarish Hande\n, Social entrepreneur and Ramon Magsaysay awardee\nProf. Virendra Kumar Tewari\n, Director of Indian Institute of Technology, Kharagpur\nRanbir Gupta, President of IIT KGP Foundation, USA\nVaradu Seshamani, President of IIT Foundation, India\nReferences\n↑\n1.0\n1.1\nWardens of Various Halls - HMC\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Nehru_Hall_of_Residence&oldid=239687\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/The_Madness_Project",
        "title": "The Madness Project",
        "content": "The Madness Project\nis travel expedition from\nKolkata\nto\nMumbai\nundertaken by two undergraduate students of IIT Kharagpur in 2014.\nSiddharth Agarwal\nand Ujjawal Chauhan rode around over 2000 km entirely on cycle to raise funds for different causes and to witness the lives of people in India’s unseen terrain.\n[\n1\n]\nThe entire journey took them over a month and also helped raise\n₹\n80,000 for\nCRY\n.\n[\n2\n]\nThe duo had to ride for over six to twelve hours a day covering between 60-100 km.\n[\n3\n]\nReferences\n↑\n\"Madness Project Cycling\"\n. YourStory. 22 August 2014\n. Retrieved\n20 September\n2015\n.\n↑\n\"Cycling for the Cause\"\n. CRY. 2014\n. Retrieved\n20 September\n2015\n.\n↑\n\"Why you should support the madness project?\"\n. 31 May 2014\n. Retrieved\n20 September\n2015\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=The_Madness_Project&oldid=3744\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE29002:_Electrical_Machines_Lab.",
        "title": "EE29002: Electrical Machines Lab.",
        "content": "EE29002\nCourse name\nElectrical Machines Lab.\nOffered by\nElectrical Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n17\n23\n19\n10\n9\n2\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\n1. No load, Short circuit and Load test on a single phase transformer.2. Study\nof various three phase transformer connections and measurement of third\nharmonic voltage.3. Hopkinsons test on d.c. shunt machines.4. O.C.C and load\ncharacteristic of a d.c shunt generator.5. No load, blocked rotor and load test\non a three phase induction motor.6. No load, blocked rotor and load test on a\nsingle phase induction motor.7. Open circuit, short circuit and ZPF tests of\nalternator and estimation of regulation by various methods.8. Synchronisation\nand V-curves of a synchronous motor.At the end it is recommended, that each\nstudent has to appear in LAB TEST individually.Further to the above, If time\npermits, suitable number of experiments may be chosen from the following\nlist.10. Fields test on d.c series motors.11. Sumpners test on\ntransformers.12. Speed control of 3-phase induction motor using variable\nvoltage, variable frequency sinusoidal source.13. Study of starters for d.c and\na.c motors.Operation of induction machine as an isolated generator- estimation\nof suitable capacitance for self excitation.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE29002:_Electrical_Machines_Lab.&oldid=25381\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AR33203:_Architectural_Detailing",
        "title": "AR33203: Architectural Detailing",
        "content": "AR33203\nCourse name\nArchitectural Detailing\nOffered by\nArchitecture & Regional Planning\nCredits\n3\nL-T-P\n1-0-3\nPrevious Year Grade Distribution\n1\n13\n17\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nArchitectural detailing for common items like: brick and concrete parapet;\ncoping; cornices; string course; chajja; plinth course; plinth protection/\nplinth protection with surface drain; treatment of sloped roof with tiles or\nplaster; paving; steps etc. Different types of Wall Facing: stone, glazed\ntiles, earthen tiles and plastic tiles etc. Partition with timber, metal,\nstone, PVC / plastic etc. Glass curtain walling. R.C.C. and Wooden Staircase\nincluding details. Different types of railing details for staircase, balcony\nand at roof with brick, timber, metal and plastic etc.Acoustic and thermoinsulating wall paneling with different materials. Suspended ceiling with\ndifferent materials and finishing including fixing details of lighting fixtures\nand diffusers for ventilation and air conditioning.Typical detail of rain water\npipe connection.Special doors and windows: Sliding, folding, revolving,\nswinging and rolling etc. with hardware details.Different types of resilient\nand vibration resistive floors. Layout and details related to Water Supply,\nDrainage and Sanitation: a case study of a small residential building.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nIn Dept\nIn Dept\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AR33203:_Architectural_Detailing&oldid=56119\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Jitendra_Mahakud",
        "title": "Jitendra Mahakud",
        "content": "Jitendra Mahakud\nDepartment\nHumanities & Social Sciences\nResearch Area(s)\nFinancial Economics\nEquity Research\nFianncial Markets\nCorporate Finance\nFinancial Econometrics\nFinancial Modelling\nYear Joined\n2007\nemail\n[email protected]\nSee Also\nDepartment of Humanities & Social Sciences\nExternal links\nJitendra Mahakud\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Jitendra_Mahakud&oldid=6140\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Rlb",
        "title": "Rani Laxmibai Hall of Residence",
        "content": "Rani Laxmi Bai Hall\nFounded\n15th September 2007\nMotto\n-\nOffice\nWarden\nProf. Mousumi Mandal\nMathematics\nAsst. Warden(s)\nProf. Dripta Piplai (mondal)\nHumanities and Social Sciences\nProf. Sudha Agrahari\nGeology and Geophysics\nHall President\nMs. Medha Nag\nSSM\nMs. Uma Kisku\nOffice No.\n+91 3222 281 159\nWebsite\n-\nInfrastructure\nCapacity\n250 Rooms\nAccomodation for\nWomen PhD Scholars\nRoom Types\nSingle occupancy\nDetails\nEateries\nNight Canteen\nShops\nStationary Shop\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Rani_Laxmibai_Hall_of_Residence&oldid=238402\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE41019:_Road_Safety_And_Management",
        "title": "CE41019: Road Safety And Management",
        "content": "CE41019\nCourse name\nRoad Safety And Management\nOffered by\nCivil Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to the Road Safety Problem, Safety Management Systems, Human\nFactors in Road Safety, Safety data collection and management, Methodologies\nfor conducting accident studies; Statistical modeling of accident data, Road\nSafety Audits, Road design and safety, Traffic management and safety,\nCountermeasure design.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE41019:_Road_Safety_And_Management&oldid=16503\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Spectcools",
        "title": "Spectcools",
        "content": "This article or section\nis in the process of an expansion or major restructuring.\nYou are welcome to assist in its construction by editing it as well.  If this article or section\nhas not been edited in several days\n, please remove this template.\nThis article was\nlast edited\nby\nAmrav\n(\ntalk\n|\ncontribs\n)\n10 years ago.\n(\nUpdate\n)\nSpectecool creates cool videos.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Spectcools&oldid=3735\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE39011:_W",
        "title": "CE39011: W",
        "content": "CE39011\nCourse name\nW & W.W. ENGG. LAB\nOffered by\nCivil Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n8\n32\n31\n5\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPhysical characteristics of water - Turbidity, Taste, Odor, Colour, Electrical\nconductivity; Analysis of solids content of water - Dissolved, settleable,\nsuspended, total, volatile, inorganic;; Alkalinity and acidity; Hardness Total, calcium and magnesium; Analysis of ions - Fluoride, copper, arsenic;\nOptimum coagulant dose; Break point chlorination; Settling column analysis for\nsedimentation tank design; BOD and BOD rate constant determination; COD; DO and\nre-aeration constant determination; Bacteriological quality measurement: MPN,\nplate count\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nFriday\nIn Dept\nIn Dept\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE39011:_W&oldid=56241\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/FMC",
        "title": "FMC",
        "content": "The Food Monitoring Committee of\nIIT Kharagpur\nexists to\nensure that the food served is in the best interest of all, and the eateries inside IIT Kharagpur serve people's convenience.\n[\n1\n]\nReferences\n↑\n\"Objectives of the FMC\"\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=FMC&oldid=3508\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA49003:_Systems_Programming_Lab.",
        "title": "MA49003: Systems Programming Lab.",
        "content": "MA49003\nCourse name\nSYSTEMS PROGRAMMING LAB.\nOffered by\nMathematics\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n6\n30\n20\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: Systems Programming\nImplementation of: data representation,\nexercises on assembly language, addressing systems, design of assemblers,\nloaders, linkage editors.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nPC_Lab-V\nPC_Lab-V\nPC_Lab-V\nPC_Lab-V\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA49003:_Systems_Programming_Lab.&oldid=56828\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ME60011:_Fluid_Mechanics",
        "title": "ME60011: Fluid Mechanics",
        "content": "ME60011\nCourse name\nFLUID MECHANICS\nOffered by\nMechanical Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n1\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcept of continuum and definition of a fluid. Body and surface forces, stress\ntensor, principle of local stress equilibrium. Scalar and vector fields,\nEulerian and Lagrangian description of flow. Motion of fluid elementtranslation, rotation and deformation; vorticity and strain-rate tensors.\nContinuity equation, Cauchys equations of motion, Transport theorems.\nConstitutive equations-Stokes law of viscosity. Derivation of Navier-Stokes\nequations for compressible flow. Exact solutions of Navier-Stokes equations:\nplane Poiseuille flow and Couette flow, Hagen-Poiseuille flow, flow between two\nconcentric rotating cylinders, Stokes first and second problems, Hiemenz\nstagnation-point flow, flow near a rotating disk, flow in convergent-divergent\nchannels. Slow viscous flow: Stokes and Oseens approximation, theory of\nhydrodynamic lubrication. Boundary layer: derivation, exact solutions, Blasius,\nFalkner Skan, series solution and numerical solutions. Approximate methods.\nMomentum integral method. Two dimensional and axisymmetric jets. Introduction\nto hydrodynamic stability, Orr-Sommerfeld equation, neutral curve of linear\nstability for plane Poiseuille flow. Description of turbulent flow, velocity\ncorrelations, Reynolds stresses. Equations for turbulence kinetic energy and\nkinetic energy of mean flow. Eddy viscosity models of turbulence: zeroequation, one-equation and two-equation models. Prandtls Mixing Length Theory.\nEmpirical laws: law of the wall, velocity defect law, universal velocity\ndistribution.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nNC234\nTuesday\nNC234\nNC234\nWednesday\nThursday\nNC234\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ME60011:_Fluid_Mechanics&oldid=56893\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Wtms",
        "title": "Western Technology Music Society",
        "content": "Western Technology Music Society\n, popularly known as\nWTMS\n, is one of the two official music societies in IIT Kharagpur, which governs the western music scene in the campus. The society aims at spreading diverse music genres, nurturing and motivating musicians, inculcating values and expression through music, and develop good music taste among our audience.\nFunctioning\nSelection Procedure\nWTMS selection auditions are held at least once in a year, in the autumn semester (sometimes happen in the spring semester too, depending on requirement), for all students (UG/PG), around the month of August/September. Selection procedure generally consist of two rounds, where the first round is a preliminary screening round to assess basic musical ability, comfort with the instrument (or singing), basic knowledge, and screened candidates are invited to give a second round of auditions where they are given few (2-3) songs to prepare. For instrumentalists, the songs that are decided are generally same for everyone, and they are chosen such that they cover a diverse spectrum of techniques/skills in the particular instrument, and for vocalists, the songs are given on the basis of the pitch range and the singer's tonality. There is generally a gap of 3-4 days between both rounds of the auditions.\nOrganizational Structure\nWTMS has three governors selected by the society seniors every year who govern the society and represent it in Gymkhana. Overall co-ordination during practices, productions and competitions are handled by the governors.\nActivities\nThe primary activities of the society include organizing and performing two productions every academic year, one in the Autumn Semester and the other in Spring Semester. The playlist is decided few weeks prior to the production through a consensus of all the members in the society. Songs are chosen so that the playlist is as diverse as possible, consisting of (but not limited to) genres such as Rock (Progressive/Post/Classic/Psychadelic), Metal(Thrash/Prog/Core), Jazz, Blues, Funk, Neo-soul, R&B.\nAutumn Production\nWTMS performs the annual production in the autumn semester generally in the month of October/November around the Durga Puja vacations. This is also the first time the new inductees get the chance to perform for the society.\nSpring Production\nWTMS performs the spring production in the spring semester generally in the month of March, after the end-semester examinations, around the time when Hall Days are going on. This happens to be the final production of the graduating batch and they get a chance to play some of their favourite songs for one last time in KGP.\nGovernors\nList of Governors\n2019-20\nNishok Sundarresan\nRiazuddin Khan\n-\n2018-19\nBhushan Deshmukh\nUtkarsh Tyagi\nHaripriyo Mondal\n2017-18\nKushal Gaikwad\nAbhinav Jain\nSouvik Bhattacharya\n2016-17\nNishant Kumar\nJainil Yadav\nShambhobi Bhattacharya\n2015-16\nVinay Bhaskar\nDikshant Raj\nSatyaki Das\n2014-15\nArmaan Hatwal\nAkash Gupta\nSoham Goswami\n2013-14\nAritra Basu\nKoulick Ghosh\nSumit Mohanty\n2012-13\nPraful Puranik\nSaakallya Biswas\nSayan Pramanik\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Western_Technology_Music_Society&oldid=239442\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE61010:_Railway_Signalling_And_Telecommunication",
        "title": "EE61010: Railway Signalling And Telecommunication",
        "content": "EE61010\nCourse name\nRAILWAY SIGNALLING AND TELECOMMUNICATION\nOffered by\nElectrical Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nObjectives: The course offers a thorough understanding of theoretical knowledge\nand best practices in railway signaling and telecommunication including the\nconcepts of railway signaling principles, safety and risk management; automatic\ntrain protection systems; signaling and layout designs; telecommunication\nsystems and equipment including research.Credit: {(3-1-0) 4 credits}Syllabus:\nPart-1: Railway Signaling (16 Lecture Hours):•Stringline diagrams, train\nscheduling and train stopping distance calculations. •Concepts of temporal and\nspatial separation of trains to ensure safe and efficient use of equipment and\ninfrastructure. •Train movement authority, track circuits and other train\nposition monitoring systems•Train control systems include radio based, wayside\nsignals, cab signal, positive train control, interlocking design, operation and\ncontrol.Part-2: Telecommunications (30 Lecture Hours):•Overview of modern\nheterogeneous telecommunications infrastructure, layered architecture, LAN, MAN\nand WAN (03 Lecture Hours);•Telecommunications switching techniques (03 Lecture\nHours);•Switching systems: non-blocking architectures, blocking probability,\ntime-division switching, two-dimensional switching, Optical switching (03\nLecture Hours);•Signaling in telephone networks (03 Lecture Hours);•Switching\nin optical backbone networks (02 Lecture Hours);•Overview of land mobile\ncommunication systems (03 Lecture Hours); •Aspects of mobile propagation\nchannels (02 Lecture Hours);•Signaling and connection to infrastructure\nnetworks (02 Lecture Hours); •Mobile radio transmitters, receivers and link\ndesign (03 Lecture Hours); •IP-based services over land mobile communication\nsystems (03 Lecture Hours); •Examples of mobile communication systems and\ntechnology trends (03 Lecture Hours).Teachers: Indian Railway Adjunct Faculty ,\nProf. Saswat ChakrabortyReferences: 1. Telecommunication Switching Systems and\nNetworks (2nd Ed) by T. Vishwanathan\n2. Digital\nTelephony by John Bellamy\n3. Wireless Communications by\nT. S. Rappaport.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE61010:_Railway_Signalling_And_Telecommunication&oldid=15440\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/QM57001:_Project(pg_-_1)",
        "title": "QM57001: Project(pg - 1)",
        "content": "QM57001\nCourse name\nProject(pg - 1)\nOffered by\nIndustrial and Systems Engineering\nCredits\n10\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=QM57001:_Project(pg_-_1)&oldid=56762\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Department_of_Geology_and_Geophysics",
        "title": "Department of Geology and Geophysics",
        "content": "Located at right side to\nDepartment of Physics\nin Main Building\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Department_of_Geology_and_Geophysics&oldid=239127\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AG61693:_Water_Quality_Management_Practice",
        "title": "AG61693: Water Quality Management Practice",
        "content": "AG61693\nCourse name\nWater Quality Management Practice\nOffered by\nAgricultural & Food Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nWater quality: Water quality criteria for industrial, drinking, irrigation and\naquatic life.\nConcept of water reuse and recirculation.\nPond dynamics.\nWater Treatment Methods: Aeration, nitrogen removal, carbonate system and pH\ncontrol, solids removal, disinfection and ion exchange.\nDesign and Operation of Water Quality Management System and Equipment: Aerator,\nmechanical and biological filters, settling basin, water exchange and water\nreuse system.\nMixing and water circulation in ponds, tanks and raceways.\nEffects of interacting factors on water quality management.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AG61693:_Water_Quality_Management_Practice&oldid=16010\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/GG49001:_Geochemistry_Lab.",
        "title": "GG49001: Geochemistry Lab.",
        "content": "GG49001\nCourse name\nGeochemistry Lab.\nOffered by\nGeology and Geophysics\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nGeochemistry Lab.\nGeochemistry Lab.\nGeochemistry Lab.\nTuesday\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=GG49001:_Geochemistry_Lab.&oldid=56628\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Ashok_Kumar_Gupta",
        "title": "Ashok Kumar Gupta",
        "content": "Ashok Kumar Gupta\nDepartment\nCivil Engineering\nResearch Area(s)\nWater and Wastewater Treatment\nWater Supply and Sanitation\nEnvironmental Impact Assesment\nAir Quality Management\nEnvironmental Planning\nYear Joined\n2002\nemail\n[email protected]\nSee Also\nDepartment of Civil Engineering\nExternal links\nAshok Kumar Gupta\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Ashok_Kumar_Gupta&oldid=5915\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Student_Alumni_Cell",
        "title": "Student Alumni Cell",
        "content": "History\nReferences\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Student_Alumni_Cell&oldid=16934\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AG40030:_Water_Conservation_And_Recycling",
        "title": "AG40030: Water Conservation And Recycling",
        "content": "AG40030\nCourse name\nWater Conservation And Recycling\nOffered by\nAgricultural & Food Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPlanning approaches of a successful water conservation and recycling program;\nPlanning guidelines for water utilities; Integrated water resource planning;\nAdvances in water use efficiency measures in agricultural, domestic, landscape,\nindustrial, commercial, and institutional; Waste water management in all water\nsectors, Benefits and costs of water conservation and recycling processes;\nBasic steps in water audit; Water conservation network; Mandates of various\nnational and international organizations working on water sector; and Case\nstudies.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AG40030:_Water_Conservation_And_Recycling&oldid=15788\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Etms",
        "title": "Eastern Technology Music Society",
        "content": "Eastern Technology Music Society\n, popularly known as\nETMS\n, is one of the two official music societies in IIT Kharagpur, which takes care of the eastern music culture in the campus. The society aims at spreading diverse musical sections of eastern music in both hindustani and carnatic styles, nurturing and motivating musicians, inculcating values and expression through music, and develop good music taste among our audience.\nFunctioning\nSelection Procedure\nETMS selection auditions are held twice in a year, in the autumn semester for all students (UG/PG), around the month of July/August and January. Selection procedure generally consist of two rounds, where the first round is a preliminary screening round to assess basic musical ability, comfort with the instrument (or singing), basic knowledge, and screened candidates are invited to give a second round of auditions where they are given few (2-3) songs to prepare. For instrumentalists, the songs that are decided are generally same for everyone, and they are chosen such that they cover a diverse spectrum of techniques/skills in the particular instrument, and for vocalists, the songs are given on the basis of the pitch range and the singer's tonality. There is generally a gap of 3-4 days between both rounds of the auditions.\nOrganizational Structure\nETMS has three governors selected by the society seniors every year who govern the society and represent it in Gymkhana. Overall co-ordination during practices, productions and competitions are handled by the governors.\nActivities\nThe primary activities of the society include organizing and performing two productions every academic year, one in the Autumn Semester and the other in Spring Semester. The playlist is decided few weeks prior to the production through a consensus of all the members in the society. Songs are chosen so that the playlist is as diverse as possible, consisting of genres such as Classical, Classical Fusion, Fusion with western genres and songs from Bollywood.\nAutumn Production\nETMS performs the Annual Foundation Day of the Institute in the autumn semester on 18th August. This is also the first time the new inductees get the chance to perform for the society.\nSpring Production\nETMS performs the spring production in the spring semester generally in the month of January, the starting day of Spring Fest. This production also gives the platform to showcase our talent to viewers from outside as well. This happens to be the final production of the graduating batch and they get a chance to play some of their favourite songs for one last time in KGP.\nGovernors\nList of Governors\n2019-20\nParitosh Jawalikar\nRaj Narayanan\n-\n2018-19\nManan Makhija\nMohit Verma\nNishok Sundarresan\n2017-18\nAshandeep Singh Sekhon\nMohnish Singh Jaswal\nSreekar Saripalli\n2016-17\nAbhishek Bhowmick\nVinay Bhaskar\nYash Deo\n2015-16\nGaurav Kumar Jha\nNayan Mallick\nSanat Panda\n2014-15\nChandrani Haldar\nRohit Narurkar\nSatyajit Sai\n2013-14\nApoorv Raj\nSiddharth Vashishtha\nSricharan Sunder\n2012-13\nAnurag Bishnoi\nGaurav Gupta\nKaushik Sivaramakrishnan\n2011-12\nAnkit D.P.\nHari Cherupalli\nJuhi Agrawal\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Eastern_Technology_Music_Society&oldid=146301\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA61018:_File_Organization_And_Database_Systems",
        "title": "MA61018: File Organization And Database Systems",
        "content": "MA61018\nCourse name\nFile Organization and Database Systems\nOffered by\nMathematics\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: Programming Languages\nDatabase concepts, entity relationship model, relational network and\nhierarchical data models. Relational database design, functional and multivalued dependency. Normal form, data description languages, relational algebra\nand calculus, SQL, query facility and query optimization. Introduction to\ndistributed databases implementation issues. Storage media and storage\nstructure, file and index organization. Heap file, indexed file, B+ tree file,\ndenie index, file with variable length records, performance and evaluation.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA61018:_File_Organization_And_Database_Systems&oldid=16522\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE60034:_Industrial_Automation_And_Control",
        "title": "EE60034: Industrial Automation And Control",
        "content": "EE60034\nCourse name\nIndustrial Automation And Control\nOffered by\nElectrical Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n2\n4\n5\n6\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nBenefits and Impact of Automation on Manufacturing and Process Industries;\nArchitecture of Industrial Automation Systems; Process Control: P-I-D Control,\nController Tuning, Special Control Structures: Feedforward and Ratio Control,\nPredictive Control, Control of Systems with Inverse Response, Cascade Control,\nAdvanced Control Schemes. Process and Instrumentation Diagrams; Sequence\nControl: PLCs and Relay Ladder Logic, Scan Cycle, RLL Syntax, Structured Design\nApproach, Advanced RLL Programming, Hardware environment; Control of Machine\ntools: Introduction to CNC Machines, Analysis of a control loop ; Flow Control\nValves ; Hydraulic Actuator Systems : Components, Proportional and Servo\nValves; Pneumatic Control Systems : System Components, Controllers ; Electric\nDrives : Energy Saving with adjustable Speed Drives, AC and DC Adjustable Speed\nDrives, Step motor Drives, Servo Drives ; Communication and Networking of\nSensors, Actuators and Controllers; Supervisory Production Control and\nManagement Systems ; Integration with Management and Enterprise Systems\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE60034:_Industrial_Automation_And_Control&oldid=25534\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Debashis_Sen",
        "title": "Debashis Sen",
        "content": "Debashis Sen\nDepartment\nElectronics & Electrical Communication Engineering\nResearch Area(s)\nVision\nImage and Video Processing\nUncertainty Handling\nBio-inspired Computation\nEye Movement Analysis\nComputational Visual Perception\nMultimedia Signal Processing\nYear Joined\n2015\nemail\n[email protected]\nWebsite\nhttp://www.ecdept.iitkgp.ac.in/Eece/facultydetails/ece-dsen\nSee Also\nDepartment of Electronics & Electrical Communication Engineering\nExternal links\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Debashis_Sen&oldid=193735\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Caf%C3%A9_Coffee_Day",
        "title": "Café Coffee Day",
        "content": "Café Coffee Day\nCategory\nFood and Beverages\nLocation\nScholars' Avenue\nCuisines\nVeg/Non-veg, coffee, fast food\nClosed on\n-\nTimings\n9AM to 11PM\nRoom Delivery\nNo\nRestricted to\nNone\nSeating capacity\n40\n[\nunverified\n]\nOwner(s)\nAmalgamated Bean Coffee Trading Company\n[\n1\n]\nCafé Coffee Day, IIT Kharagpur\n(abbreviated as\nCCD\n) is an outlet of the Indian café chain\nCafé Coffee Day\n. It is located on the\nScholars' Avenue\nopposite to\nGokhle Hall of Residence\nin a cluster of restaurants along with\nHeritage\n,\nVegies\n, and\nBaskin Robbins\n. CCD is a popular hangout joint among the students of Kharagpur.\nHistory\nFacilities and cuisines\nCCD is one of the few establishments inside campus which is air conditioned. It is noted for its various coffee specialties, desserts, and a wide array of fast foods. They also accept card payments.\nMenu\nPage 1 (Cake, Sundaes)\nPage 1 (Cake, Sundaes)\nPage 2 (Lemonades, Tea)\nPage 2 (Lemonades, Tea)\nPage 3 (Hot/Cold coffee)\nPage 3 (Hot/Cold coffee)\nSpecial occasions\nSee also\nDreamland\nHeritage\nReferences\n↑\n\"CCD Website\"\n. Retrieved\n2014-08-16\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Café_Coffee_Day&oldid=13118\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS50024:_Economics_Of_Climate_Change",
        "title": "HS50024: Economics Of Climate Change",
        "content": "HS50024\nCourse name\nEconomics Of Climate Change\nOffered by\nHumanities & Social Sciences\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: HS30072Course ContentsScience of Global Warming - Economics,\nEthics and Climate Change; Impacts of Climate Change on Growth and Development:\nCosts of Climate Change in Developed and Developing Countries, Economic\nModelling of Climate Change; Optimal Global Warming Ã¢ÂÂ CBA; Estimation of\nTotal and Marginal Damage; Uncertainty and Irreversibility; Economic\nInstruments/Policy for Climate Change; Mitigation: Markets and Emission\nReduction, Carbon Markets, Innovation of Technology, Beyond Markets and\nTechnology; Market-Based Strategies to Reduce Greenhouse Gases, Transferable\nDischarge Permits and Global Warming; Adaptation Policies in Developed and\nDeveloping Countries, Economic Costs of Adaptation; International Collective\nAction and Climate Change: Global Price For Carbon; Global Support for Low\nCarbon Economy in Developing Countries, International Cooperation on Climate\nChange, Technology Transfer and Adaptation.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS50024:_Economics_Of_Climate_Change&oldid=16368\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Mintu_Halder",
        "title": "Mintu Halder",
        "content": "Mintu Halder\nDepartment\nChemistry\nResearch Area(s)\nExperimental Physical Chemistry\nBiophysics\nPhotophysics of Nano-materials\nSpectroscopy\nYear Joined\n2006\nemail\n[email protected]\nWebsite\nhttp://www.chem.iitkgp.ernet.in/faculty/MH/index.php\nSee Also\nDepartment of Chemistry\nExternal links\nMintu Halder\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Mintu_Halder&oldid=5822\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Debapriya_Biswas",
        "title": "Debapriya Biswas",
        "content": "Debapriya Biswas\nDepartment\nMathematics\nResearch Area(s)\nFunctional Analysis\nLie Groups Lie Algebras and their Representation theory\nComplex Analysis\nHarmonic Analysis\nHyper-Complex Analysis including Clifford Algebras\nYear Joined\n2008\nemail\n[email protected]\nWebsite\nhttp://www.facweb.iitkgp.ernet.in/~debapriya/\nSee Also\nDepartment of Mathematics\nExternal links\nDebapriya Biswas\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Debapriya_Biswas&oldid=6239\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA20104:_Probability_And_Statistics",
        "title": "MA20104: Probability And Statistics",
        "content": "MA20205\nCourse name\nProbability And Statistics\nOffered by\nMathematics\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n5\n14\n32\n53\n140\n249\n116\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: void\nProbability: Classical, relative frequency and axiomatic definitions of\nprobability, addition rule and conditional probability, multiplication rule,\ntotal probability, Bayes’ Theorem and independence.\nRandom Variables: Discrete, continuous and mixed random variables, probability\nmass, probability density and cumulative distribution functions, mathematical\nexpectation, moments, moment generating function, Chebyshev’s inequality.\nSpecial Distributions: Discrete uniform, Binomial, Geometric, Poisson,\nExponential, Gamma, Normal distributions. Functions of a Random Variable.\nJoint Distributions: Joint, marginal and conditional distributions, product\nmoments, correlation, independence of random variables, bivariate normal\ndistribution.\nSampling Distributions: The Central Limit Theorem, distributions of the sample\nmean and the sample variance for a normal population, Chi-Square, t and F\ndistributions.\nEstimation: The method of moments and the method of maximum likelihood\nestimation, confidence intervals for the mean(s) and variance(s) of normal\npopulations.\nTesting of Hypotheses: Null and alternative hypotheses, the critical and\nacceptance regions, two types of error, power of the test, the most powerful\ntest and Neyman-Pearson Fundamental Lemma, tests for one sample problems for\nnormal populations.\nConcepts taught in class\nAn overview of the distributions used most commonly. Some professors might also go into what the applications for a given distribution are. Style of teaching might vary wildly across sections.\nBasic JEE level probability, Random Variables, Distributions, Estimators, Testing of Hypothesis.\nStudent Opinion\nThis course is important from a beyond the marks point of view. These distributions are everywhere, and being able to talk about them with a fair bit of knowledge is fairly important, no matter what field you go into. They are also very helpful outside of work when reading about distributions of general phenomenon or trying to understand what's wrong with polling / election predictions etc. If you don't have to take this course as a depth or breadth course, then take it as an additional. That way, it doesn't affect your grade and you can study as much as you want, or as little as you need to get by. -\nIcyflame\n(\ntalk\n) 18:48, 5 November 2018 (IST)\nA pretty questionable opinion, not backed by data: But I've observed across batches that students of Prof Khare's classes understand the concepts and perform better compared to the students in other sections. -\nathityakumar\n(\ntalk\n) 20:58, 6 November 2018 (IST)\nOne of the most useful topics I'm mathematics which need to be given much attention and time. Professors are good. But nothing is an alternative to regular self study.\nHow to Crack the Paper\n# Know the basics of probability. There is a little bit of that in the beginning of this course, but it generally helps even with the later subject matter\nKnow the construction of random variables well: This part is assumed to be understood once you move past the 1-2 lectures devoted to explaining what random variables are and why they are important. Once understood, random variables provide an abstract framework to think about distributions. So, even if you don't know the specifics of a distribution, at least you will be able to understand what's going on.\nLearn the basic distributions thoroughly. Know how to calculate the main metrics for each distribution, and the number of variables that are required to describe a given distribution complete.\nLearn the last part about hypotheses testing properly. This part is taught at the very end of the course and is definitely at least one full question in the final paper. Once understood, this is much much easier than distributions.\nBe regular in Class, get your theory prepared and Practice assignments and previous year papers.\nClassroom resources\nAny Probability and Statistics book will do.\nAdditional Resources\nHoel, Port and Stone.....and....\nApplied Statistics And Probability for Engineers by Douglas C Montgomery\nGoogle😁\nhttps://www.probabilitycourse.com/\nhas very good theory along with problems in each section. This is comprehensive enough for the course.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA20104:_Probability_And_Statistics&oldid=229574\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IM69003:_Computational_Laboratory",
        "title": "IM69003: Computational Laboratory",
        "content": "IM69003\nCourse name\nCOMPUTATIONAL LABORATORY\nOffered by\nIndustrial & Systems Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nIndustrial Engineering Problem solving through JAVA, Optimisation and\nStatistical Packages, Database Management, Exercises of Simulation and Gaming\nwith the help of decision support systems and system dynamics models. Reallife business and production/ operation games will be demonstrated.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nFriday\nORDS Lab\nORDS Lab\nORDS Lab\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IM69003:_Computational_Laboratory&oldid=56757\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Kishor_Goswami",
        "title": "Kishor Goswami",
        "content": "Kishor Goswami\nDepartment\nHumanities & Social Sciences\nResearch Area(s)\nDevelopment Economics (Globalization - Gender and Trade - Poverty - Food Security)\nAgricultural Economics\nEconomics of Biofuels\nYear Joined\n2004\nemail\n[email protected]\nSee Also\nDepartment of Humanities & Social Sciences\nExternal links\nKishor Goswami\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Kishor_Goswami&oldid=6132\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CDC",
        "title": "Career Development Centre",
        "content": "This article or section\nis in the process of an expansion or major restructuring.\nYou are welcome to assist in its construction by editing it as well.  If this article or section\nhas not been edited in several days\n, please remove this template.\nThis article was\nlast edited\nby\nMeetjoshi\n(\ntalk\n|\ncontribs\n)\n6 years ago.\n(\nUpdate\n)\nThe Career Development Centre (previously known as the Training and Placement Cell) aims to guide students to think in terms of careers where they can excel in their inherent potential. CDC is not only responsible for the Placements of students of IIT Kharagpur but also assists them in developing the necessary skills to be proficient in their field of interest.\nHistory\nStudent Placement Committee\nOffice-bearers\nChairmen\n[\n1\n]\n2018-19\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2017-18\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2016-17\n[\n2\n]\nPost\nPresent office-bearers\nChairman\nProf. Debasis Deb\nVice Chairman (Training and Placement)\nProf. G P Raja Sekhar\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\n2015-16\n[\n3\n]\nPost\nOffice-bearers\nChairman\nProf. Sudhirkumar Barai\nVice Chairman (Training and Placement)\nProf. Debasis Deb\nVice-Chairman (Career Development Programme)\nProf. A Rajakumar\nVice-Chairman (Corporate Relations)\nProf. Sujoy Kumar Kar\nCo-ordinators\n[\n1\n]\n2016-17\n[\n2\n]\nPost\nPresent office-bearers\nInstitutional Development Executive\nMr. Shivam Gupta\nPlacements\nMr. Dinesh Karmakar\nInternship\nMr.V S Somayajulu\nPost Placement / Internship\nMr. Makhan Maiti\nStudent Co-ordinators\n2016-17\n[\n3\n]\nName\nMr. Shovan Panigrahi (PH '18) (\nVPTSG\n)\nMr. Ankit Sharma (MI '18)\nMr. Ashutosh Dwivedi (HS '18)\nMr. Ayaaz Sabir\nMr. Saksham Saxena (PH '18)\nMr. Nirav Vipulbhai Doshi (ME '18)\nMr. Vipul Bhola (CE '17)\nMr. Apoorva Sharma (EE '18)\nMr. Hardik Dnyaneshwar Katyarmal (EE '18)\nMr. Sushant Sudheendranath (CH '17)\nMr. Shubham Sharma\nMr. Sanket (GG '18)\nMs. Asweta Singh\nMr. Shubham Waghe (MF '18) [Web Coordinator]\n2015-16\n[\n3\n]\nName\nMr. Atal Ashutosh Agarwal (\nVPTSG\n)\nMr. Amrut Rajkarne (EC '17)\nMr. Ankur Agarwal\nMr. Deepak Adhikari (AG '16)\nMr. Manish Goyal (MA '17)\nMr. Naman Nishesh  (MA '17)\nMr. Nikhil Garg (HS '17)\nMr. Rachit Aggarwal (BT '17)\nMr. Sandeep Kumar Siram (ME '17)\nMr. Sankalp Gourisaria (CH '17)\nMr. Sneh Pratik (PH '17)\nMs. Vipasha Jain (HS '17)\nMr. Shubham Waghe (MF '18) [Web Coordinator]\n2014-15\nSee Also\nhttp://www.cdc.iitkgp.ernet.in/\nList of Internship Programs\nReferences\n↑\n1.0\n1.1\n\"Contact us at CDC, IIT Kharagpur\"\n.\nCDC\n. Retrieved\n2015-09-21\n.\n↑\n2.0\n2.1\n2.2\n2.3\nCite error: Invalid\n<ref>\ntag; no text was provided for refs named\n:2\n↑\n3.0\n3.1\n3.2\n\"Contact us at CDC, IIT Kharagpur\"\n.\nCDC\n. Retrieved\n2015-09-21\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Career_Development_Centre&oldid=97155\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Kshitij",
        "title": "Kshitij",
        "content": "Kshitij\nFile:Kshitij Logo.png\nType\nStudent run Non-Profit Organization\nFounded\n2004\n(\n2004\n)\nPlace\nKharagpur, India\nMajor events\nROBOWARS\nPrize money\n₹\n65 Lakhs\nSlogan\nThink. Create. Enjoy\nWebsite\nktj\n.in\nKshitij\nis the annual techno-management fest of\nIIT Kharagpur\n, one of India’s premier technical institutions.\n[\n1\n]\n[\n2\n]\nStarted in the year 2004, the idea of Kshitij was conceived with the aim to provide the technically inclined youth a national-level platform, where their talent and expertise would be recognized and duly rewarded.\n[\n3\n]\nHaving grown exponentially since its nascent years, Kshitij receives overwhelming participation from the student community all over the world.\n[\n4\n]\n[\n5\n]\nThe official website of Kshitij,\nktj\n.in\n, is in fact the largest student run website, receiving 8 million clicks in its 2012 edition.\n[\n6\n]\n[\n7\n]\nKshitij organizes a wide range of events encompassing every genre of technology and management with the aim to infuse a scientific and rational temperament in the young minds.\n[\n8\n]\nWorld-renowned organizations like\nACM\n,\nIEEE\n,\nASME\n,\nASHRAE\nand\nIMechE\ncertify numerous events of the fest. To address the issues plaguing our present society, Kshitij also undertakes social initiatives in association with the foremost NGOs of the country.\n[\n9\n]\nWorkshops are conducted at several locations all over the country, to help the participants gain hand-on experience and enhance their technical skills. Culminating in a four day extravaganza, Kshitij also organizes many inspiring\nguest lectures\n, exhibitions and megashows.\n[\n10\n]\n[\n11\n]\nKshitij 2015 was held from 30th January to 2nd February 2015,that saw a total participation of over 65,000 and an amount of Rs 65 lac was offered as prize money.\n[\n12\n]\nKshitij 2016 will be held from 21st January to  24th January 2016.\n[\n13\n]\nHistory and Growth\nInitially named Ideon, Kshitij started in its present form in 2004. 260 participants from outside the campus took part in the first edition of the fest. In 2005, this figure increased to 1400, including participants from abroad as well. Since then, Kshitij has grown to become Asia’s largest techno-management fest. Kshitij 2012 witnessed a participation of 50,000 students from all over the world and the prize money amounted to 60 lacs. This year Kshitij will celebrate 13 years of its making.\n[\n14\n]\nCertifications\nMany of the events in Kshitij 2016 have certifications from various organisations and institutions. These are:\nAssociation for Computing Machinery\n(ACM): ACM, the world’s largest and oldest scientific and educational computing society, which develops resources that advance computing as a science and profession, certifies Overnite ACM ICPC Multi Provincial Programming Contest. The society serves as a membership of computing professionals and students in many countries in all areas of industry, academia, and government thus uniting the world's computer educators, researchers and professionals to inspire dialogue and address the field's challenges.\nInstitute of Electrical and Electronics Engineers\n(IEEE) : The Institute of Electrical and Electronics Engineers (IEEE) is the world’s largest professional association dedicated to advancing technological innovation and excellence for the benefit of humanity. IEEE and its members inspire a global community through IEEE’s highly cited publications, conferences, technology standards, and professional and educational activities. IEEE certifies the event Eureka in Kshitij.\nAmerican Society of Heating, Refrigerating and Air-Conditioning Engineers\n(ASHRAE): ASHRAE certifies Kryotech, an event to design the complete HVAC (heating, ventilation and air conditioning) system for the industry.\nAmerican Society of Mechanical Engineers\n(ASME): ASME, a professional body known for setting codes and standards for mechanical devices, certifies the Kshitij event ASME Student Design Competition. Through this event, ASME provides a platform for budding technocrats to touch the horizons in the field of robotic design and intelligent automation.\nInstitution of Mechanical Engineers\n(IMechE) : The Institution of Mechanical Engineers (IMechE) certifies the events Laws of Motion and Nightshift. The association of IMechE with these events aims at improving the world through engineering and nurturing new talents, helping them build their careers and take on the challenges that, when solved, will make a difference to all.\nAmerican Institute of Chemical Engineers\n(AIChE) : The American Institute of Chemical Engineers (AIChE) is a professional organization for chemical engineers.[1] AIChE was established in 1908 with the purpose of establishing chemical engineers as a profession independent from chemists and mechanical engineers.\nFlagship Events\nLaws of Motion\n: This aircraft design event certified by the Institution of Mechanical Engineers\nIMechE\nis one of the most famous events of Kshitij, which receives participation from students all over the country.\nEureka\n: An\nIEEE\ncertified technical paper presentation event.\nOvernite\n: The ACM ICPC Multi-provincial programming contest is certified by\nACM\n, world’s largest and most prestigious scientific and educational computing society.\nASME SDE\n: Student Design Exposition is an open hardware modelling competition certified by the American Society of Mechanical Engineers.\nB-Plan\n: This event gives aspiring entrepreneurs a wonderful opportunity to present an executive summary of their business idea before angel investors and venture capitalists. Offering impressive incubation prize money, B-Plan has helped many students to kick-start their dream business.\nEmbetronix\n: It is an embedded electronics circuit design competition spread over two rounds.\nNightshift\n: An adaptation of the popular Discovery Channel show, Junkyard Wars, this event is also certified by\nIMechE\n.\nIDP\n: It is Kshitij’s very own Industrial Design Problem competition. Conducted in association with reputed industrial organizations, it gives participants a chance to give solutions to real time problems faced by industries, though in their scaled down version.\nThe Verdict\n: The national-level Moot Court competition of Kshitij, it is conducted in association with the Indian Bar Association.\nRobotix Events\nMain article:\nRobotix (competition)\nThere is a complete genre called\nRobotix\n,\n[\n15\n]\nwhich has many events based on amateur robotics.The events for Kshitij 2015 are:\nCascade\n: Build a manually controlled robot capable of traversing vertical rods while shooting terrorists\nSkyfall\n: Build a robot that is capable of picking up packages on a pier and depositing it on the given ship by traversing the arena either aquatically or by zipline.\nMinefield\n: Build a semi-autonomous robot capable of detecting hidden metal mines and rescuing stranded victims using gesture recognition in a minefield.\nStep Up\n: Build an autonomous robot that is capable of traversing a grid and arranging the blocks placed on nodes in the increasing order of height.\nAug-Hit\n: Build an Image Processing robot that can play the Break Bricks game.\nSudocode\n: Write a code to optimize your strategy to find and destroy enemy bunkers in a jungle. Write a code to find and attack enemy troops in the jungle.\nGuest lectures\nEach year, Kshitij invites illustrious dignitaries from all over the world to share their valuable insights. The guests for Kshitij in its previous editions include :\nAlan Emtage\n: Father of the Internet Search Engine\nDov Frohman\n: Former VP- Intel, Inventor of EPROM\nD. Richard Hipp\n: Architect of SQLite and Fossil SCM\nBedabrata Pain\n: Director, Inventor of CMOS Image Sensor\nSir Robin Knox-Johnston\n: First to perform a solo non-stop circumnavigation of the globe\nDr. Subir Gokarn\n: Former Deputy Governor, Reserve Bank of India\nDr. Jacob Cohen\n: Chief Scientist,NASA\nClaude Vallee\n: Chairman SPSC, CERN\nNawazuddin Siddiqui:\nCritically Acclaimed Actor\nKrishnaswamy Kasturirangan:\nFormer Director - ISRO\nSatyajit Bhatkal:\nCreator - Satyameva Jayate, Assistant Director - Lagaan\nWorkshops\nIn keeping with its vision of fostering the spirit of science and technology among the students, Kshitij organises elucidatory workshops both during the festival and in the days prior to the festival. These workshops help the participants in keeping up with the recent developments in the technical and corporate world, from the very experts in the field. Being highly informative and interesting the workshops are known to attract enthusiastic participation from students. The workshops are organised in association with reputed organisations and are conducted free of cost.\nDuring the fest, interactive workshops are conducted in Kharagpur on a wide variety of topics. These workshops are presented by the experts in the respective fields, giving the participants a unique opportunity to develop an insight and gain hands-on experience.\nThe Kshitij Team organises a series of external workshops in various cities prior to the festival. These workshops aimed at reaching out to the student fraternity all over the country, provide a platform for the participants to identify, exchange, plan and elaborate emerging ideas and high-quality research.\nExhibitions\nTo introduce the youth to the latest advances in technology and to give them a glimpse of the changing times, several intriguing exhibitions are showcased during the fest. The exhibitions of the past have been a huge success among the participants, motivating them to think beyond boundaries.\nTech4Fun\nFor the recreation of the participants after participating in the various events, Kshitij hosts light, fun-filled activities like:\nTechQuila: The energetic stage amidst the Arena\nSnappit: Photography event\nSee Also\nThe Main website of Kshitij(\nktj.in\n) remains active only during and around the time of fest. Visit\nKshitij, IIT Kharagpur\nto get the latest information about the largest techno-management fest of Asia anytime anywhere\nList of guest lectures in Kshitij\nSpring Fest\nReferences\n↑\nFritz, Ben (2010-10-14).\n\"Budding engineers, managers to attend Kshitij at IIT-Kharagpur\"\n.\nLos Angeles Times\n(\nTribune Company\n)\n. Retrieved\n2010-10-16\n.\n↑\nIIT Kharagpur\n, Indian Institute of Technology Kharagpur.\n↑\n\"IIT-Kharagpur invites students for techno-management fest\"\n. Times of India. 2013-10-14\n. Retrieved\n2013-10-14\n.\n↑\nKshitij -Techno management fest\n. Knowafest.com. November 2011.\n[\ndead link\n]\n↑\n\"Kshitij 2011 - Techno Management Fest, IIT Kharagpur, Kharagpur, West Bengal, January 28-31 2011\"\n. Knowafest.com. 2011.\n↑\nIIT-Kharagpur organises techno-management fest IIT-Kharagpur organises techno-management fest\n↑\nIIT Gandhinagar students gear up for Kshitji\n↑\nFritz, Ben (2012-10-24).\n\"Online events ahead of techno management fest at IIT Kharagpur.\"\n.\nLos Angeles Times\n(Times of India)\n. Retrieved\n2012-10-24\n.\n↑\n\"FEATURES / EDUCATION PLUS : IIT-Kharagpur gears up for Kshitij\"\n. Chennai, India: The Hindu. 2012-10-29\n. Retrieved\n2012-12-22\n.\n↑\nFritz, Ben (2012-10-31).\n\"IIT Gandhinagar students gear up for Kshitji\"\n.\nTimes of India\n(Times of India)\n. Retrieved\n2012-10-31\n.\n↑\n\"Campus chitchat: Kshitij 2013 in February\"\n. Indian Express. 2012-12-04\n. Retrieved\n2012-12-22\n.\n↑\n\"Robot festival at IIT-Kharagpur - The Times of India\"\n.\nThe Times Of India\n.\n↑\n\"Call next Android Lassi, demand IITians\"\n. DNA India. 2013-10-14\n. Retrieved\n2013-10-14\n.\n↑\n[1]\n↑\nRobotix 2015\n.\nExternal links\nDocumentary Kshitij 2020\nDocumentary Kshitij 2018\nDocumentary Kshitij 2017\nDocumentary Kshitij 2016\nDocumentary Kshitij 2015\nDocumentary Kshitij 2014\nDocumentary Kshitij 2013\nDocumentary Kshitij 2012\nDocumentary Kshitij 2011\nDocumentary Kshitij 2010\nTechnology Student's Gymkhana\nRobotix official website\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Kshitij&oldid=196044\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ME31013:_Mechanics_Of_Solids",
        "title": "ME31013: Mechanics Of Solids",
        "content": "ME31013\nCourse name\nMechanics Of Solids\nOffered by\nMechanical Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n29\n34\n35\n29\n22\n16\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite â MechanicsIntroduction of theory of elasticity- Analysis of\nStress and Strain, Stress equation of equilibrium, Compatibility equations,\nStress-Strain Relations, Solution of elasticity equations-stress function\napproach. Theories of failure- Yield criteria. Energy methods- Generalized\nforces and displacements, Reciprocal Theorem, Maxwell-Betti-Raleigh reciprocal\ntheorem, Castiglianoâs theorems, Theorem of virtual work. Bending of BeamsStraight and asymmetrical bending, Shear center, bending of curved beams,\nDeflection of thick curved beams. Axisymmetric problems- Thick walled\ncylinders subjected to internal and external pressures-Lameâs equation,\nStresses in composite tubes-Shrink fits, Rotating discs with uniform and\nvariable thickness, Rotating shafts and cylinders. Columns and struts- Eulerâs\nBuckling load, Different end conditions, Beam columns, Energy methods in\nbuckling problems.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nAll materials can be found here:\nhttp://www.facweb.iitkgp.ac.in/~jeevanjyoti/teaching/mechsolids/2020/\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nNC233,NC234\nThursday\nNC233,NC234\nFriday\nNC233,NC234\nNC233,NC234\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ME31013:_Mechanics_Of_Solids&oldid=172364\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/VS_(canteen)",
        "title": "VS canteen",
        "content": "VS canteen\nCategory\nFood and Beverages\nLocation\nVS Hall\nCuisines\nIndian, fast food\nTimings\n8PM to 2AM\nSeating capacity\n80\nEmployees\n15\nReferences:\n[\n1\n]\nVS canteen\n, often shortened to\nVS\n, is the night canteen of\nVS Hall\n, and one of the most popular night canteens on campus. It is one of the few night canteens where both men and women are allowed, the other three being\nEggies\n,\nJCB\nand HJB.\nHistory\nTimings\nVS is open from 8pm to 2am.\n[\n1\n]\nMenu\nThe menu for VS night canteen, IIT Kharagpur.\nThe menu for VS night canteen, IIT Kharagpur.\nReferences\n↑\n1.0\n1.1\nVerified\nby\nAmrav\non 2015-08-30.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=VS_canteen&oldid=22348\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Gym",
        "title": "Gym",
        "content": "Registering for the Gym\nRegistration for the gym can be done at any point during the semester, provided there are seats available in your slot of choice. The fee is Rs 500 for one semester. Forms can be collected from the gym office. The fee has to be paid in favour of an account number mentioned on the form (Technology Student's Gymkhana) , you can do it either by submitting the sum at SBI Branch IIT Kharagpur or via Internet Banking. You can also pay via UPI app and print the receipt. You will also have to get the signature of a medical officer on the form , you can get it easily at BC Roy Technology Hospital.\nGym Timings\nMorning-\nslot A  6:00 AM - 6:45 AM\nslot B  6:45 AM - 7:30 AM\nslot C  7:30 AM - 8:15 AM\nEvening\nslot D  4:15 PM - 5:00 PM\nslot E  5:00 PM - 5:45 PM\nslot F  5:45 PM - 6:30 PM\nslot G  6:30 PM - 7:15 PM\nslot H  7:15 PM - 8:00 PM\nEquipment Available\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Gym&oldid=164712\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EC31001:_Analog_Communication",
        "title": "EC31001: Analog Communication",
        "content": "EC31001\nCourse name\nAnalog Communication\nOffered by\nElectronics & Electrical Communication Engineering\nCredits\n4\nL-T-P\n3-1-0\nProfessor(s)\nArijit De\nPrevious Year Grade Distribution\n12\n17\n14\n21\n27\n37\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPre-requisites: EC21004 or EE (Signals and Networks) Representation of signals\nand systems in a communication system: Discrete and continuous spectra of\nsignals, concepts of modulation and frequency translation, lowpass and bandpass\nsignals and channels, concept of complex envelope, Hilbert transform and phase\nshifting; Continuous wave (CW) modulation: AM, DSB/SC, SSB, VSB, methods of\ngeneration; Demodulation techniques of CW modulation: coherent and noncoherent; Nonlinear modulation techniques: FM and PM, narrowband FM, wideband\nFM, methods of generation; FM spectrum; Demodulation techniques for FM;\nFrequency Division Multiplexing (FDM); Radio transmitters and receivers;\nSampling a signal by periodic pulse stream: spectra of ideally sampled signal,\nNyquist sampling theorem, flat-top sampling, sampling of bandpass signals,\nexamples of sampling circuits; PAM, PWM, PPM, PFM â spectra, generation and\ndemodulation schemes; Time-division multiplexing; Performance of analog\nmodulation schemes in AWGN : CNR, post-demodulation SNR and figure of merit for\nAM, DSB/SC, SSB, FM, threshold effect in FM, pre-emphasis and de-emphasis in\nFM, FMFB. Noise in receivers; Noise figures; Radio link design.\nConcepts taught in class.\nStudent Opinion\nA good course with a bad teacher I suppose.\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nV4\nThursday\nV4\nFriday\nV4\nV4\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EC31001:_Analog_Communication&oldid=235632\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MS67101:_Thesis_Part-i",
        "title": "MS67101: Thesis Part-i",
        "content": "MS67101\nCourse name\nThesis Part-i\nOffered by\nMaterials Science Centre\nCredits\n20\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MS67101:_Thesis_Part-i&oldid=57020\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS60074:_Strategic_Hrm",
        "title": "HS60074: Strategic Hrm",
        "content": "HS60074\nCourse name\nSTRATEGIC HRM\nOffered by\nHumanities & Social Sciences\nCredits\n2\nL-T-P\n2-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nStrategic approach to HRM, formulating a corporate and human resource strategy;\nExternal and global environment for HR: change and diversity, strategies for HR\nacquisition and placement, HR planning and information systems, equal\nemployment opportunity and managing diversity, job analysis, recruitment,\nselection, and retention; Strategies for maximizing HR productivity, job\ndesign, socialization, training and development; Strategies for effective\nperformance appraisal, strategic compensation systems, improving productivity,\nstrategies for maintaining human resources, benefit plans, managing health,\nsafety, and stress, ethics, employee rights, and employer responsibilities;\nUnions and strategic collective bargaining, strategic separation, separation\nrestructuring and virtual organization.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS60074:_Strategic_Hrm&oldid=15324\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/NA40010:_Offshore_Technology",
        "title": "NA40010: Offshore Technology",
        "content": "NA40010\nCourse name\nOffshore Technology\nOffered by\nOcean Engineering & Naval Architecture\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\n4\n2\n2\n1\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nTypes of offshore structures-fixed and floating platforms; General design\nconsiderations-selection of physical parameters; Offshore site selection-survey\nmethods; Environmental loads-wind, wave, current and earthquake loads; Buoyancy\nand stability of offshore platforms; Load out â launching and upending of steel\njacket structures; Transportation and installation of platforms; Mooring\nsystems and Buoys-hydrodynamics load calculation and structural response,\nOffshore pile foundations and soil mechanics; Gravity structure foundation and\ndesign aspects; Dynamic analysis of offshore structures; structural reliability\nand safety of platforms; Regulatory requirements; Materials used in offshore\nstructures.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=NA40010:_Offshore_Technology&oldid=25579\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MI60038:_Principles_Of_Mineral_Processing",
        "title": "MI60038: Principles Of Mineral Processing",
        "content": "MI60038\nCourse name\nPrinciples Of Mineral Processing\nOffered by\nMining Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n4\n8\n6\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nLiberation and Communition, Liberation- concept and importance; CommunitionTheories, circuits, crushing and grinding equipment; Laws of crushing of\nindustrial mills; Sizing- Laboratory sizing techniques and interpretation of\nsizing data, Industrial screen; Classifier and thickeners â Theories,\nprinciples, types, characteristics and performance; tabling, zigging,\nfloatation, magnetic and heavy media separation; ore sorting; electronic\nseparation; floatation- Theories, techniques, performance, selective\nflocculation and agglomeration; Performance and evaluation of concentration\nprocess; solid-liquid separation- filtration, dewatering and drying; coal\nwashing- Plant practices, flow sheet for fuel and non-fuel minerals.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nIn Dept\nTuesday\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MI60038:_Principles_Of_Mineral_Processing&oldid=56967\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Sourav_Mukhopadhyay",
        "title": "Sourav Mukhopadhyay",
        "content": "Sourav Mukhopadhyay\nDepartment\nMathematics\nResearch Area(s)\nCryptanalysis on symmetric cipher\nDigital rights management\nKey management in wireless adhoc network\nKey Pre-Distribution (KPS) in sensor network\nAlgebric attack on stream ciphers\nTime/Memory Trade-off Cryptanalysis\nCloud Computing\nYear Joined\n2009\nemail\n[email protected]\nWebsite\nhttp://www.facweb.iitkgp.ernet.in/~sourav/\nSee Also\nDepartment of Mathematics\nExternal links\nSourav Mukhopadhyay\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Sourav_Mukhopadhyay&oldid=6262\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Manas_Chandra_Ray",
        "title": "Manas Chandra Ray",
        "content": "Manas Chandra Ray\nDepartment\nMechanical Engineering\nResearch Area(s)\nSmart Materials and Structures\nFlexoelectric Solids\nDynamics and Control of Composite Structures\nNanocomposites\nFluid-structure interaction\nActive constrained layer damping\nFuzzy Fiber Reinforced Composites\nYear Joined\n2000\nemail\n[email protected]\nSee Also\nDepartment of Mechanical Engineering\nExternal links\nManas Chandra Ray\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Manas_Chandra_Ray&oldid=6335\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE69021:_Control_Systems_Laboratory-_I",
        "title": "EE69021: Control Systems Laboratory- I",
        "content": "EE69021\nCourse name\nControl Systems Laboratory- I\nOffered by\nElectrical Engineering\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nControl Lab\nControl Lab\nControl Lab\nControl Lab\nControl Lab\nControl Lab\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE69021:_Control_Systems_Laboratory-_I&oldid=56549\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/RE61003:_Reliability_Engineering",
        "title": "RE61003: Reliability Engineering",
        "content": "RE61003\nCourse name\nReliability Engineering\nOffered by\nSubir Chowdhury School of Quality and Reliability\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nClassroom 1\nClassroom 1\nTuesday\nClassroom 1\nClassroom 1\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=RE61003:_Reliability_Engineering&oldid=57155\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE60111:_Viscous_Fluid_Flow",
        "title": "CE60111: Viscous Fluid Flow",
        "content": "CE60111\nCourse name\nViscous Fluid Flow\nOffered by\nCivil Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to inviscid and viscous fluid flow; fundamental equations of\nviscous flow; continuity equation; Navier-Stokes equations; Couette flows; twoand three-dimensional boundary layers; similarity solution for two-dimensional\nflow; free shear flow; approximate integral method; stability of flow; concept\nof small disturbance stability; linearized stability of parallel viscous flow;\nparametric effects in the linear stability theory; transition to turbulence.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nIn Dept\nTuesday\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE60111:_Viscous_Fluid_Flow&oldid=56270\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MI45012:_Resource_Evaluation_And_Geostatistics",
        "title": "MI45012: Resource Evaluation And Geostatistics",
        "content": "MI45012\nCourse name\nResource Evaluation And Geostatistics\nOffered by\nMining Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n7\n14\n15\n5\n5\n6\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nDefinition of resource and reserve, Conventional Reserve estimation techniques,\nIntroduction to geostatistical concept, Review of classical statistics,\nRegionalised variables, Random Process and Stationarity; Variogram modelling,\nRegularization, linear Kriging methodology and application, Multivariate\nGeostatistics and Cokriging, Variance volume relationships, Basics of nonparametric geostatistics and indicator Kriging, Estimation vs. Simulation,\nConditional Simulation, Introduction to GEOEAS/ GEOPACK software.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nIn Dept\nThursday\nIn Dept\nFriday\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MI45012:_Resource_Evaluation_And_Geostatistics&oldid=56953\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MI60034:_Clean_Coal_Technology",
        "title": "MI60034: Clean Coal Technology",
        "content": "MI60034\nCourse name\nCLEAN COAL TECHNOLOGY\nOffered by\nMining Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\n1\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nLife cycle of coal, coal characterization, classification system of coal, rank\nand grade of coal, Coal washing: Objectives and Techniques; Clean coal\ntechnology: Definition and Objectives, Technology Options; Pre-combustion,\nCombustion, Post Combustion and Conversion CCTs. Coal combustion options: FBC,\nIGCC, co-generation options, Sequestration options: Capture and storage of CO2,\nCoalbed Methane Recovery and utilization, Coal Gasification (In-situ and\nsurface Gasification), Coal to Liquid Technology.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MI60034:_Clean_Coal_Technology&oldid=25513\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE39004:_Embedded_Systems_Lab.",
        "title": "EE39004: Embedded Systems Lab.",
        "content": "EE39004\nCourse name\nEMBEDDED SYSTEMS LAB.\nOffered by\nElectrical Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n19\n58\n43\n9\n4\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nProgramming Exercises with Microprocessors (Intel 8086 family) and\nMicrocontroller Controller kits (Intel 8051, 8096, Motorola 68705); Familiarity\nwith the DSP(TI 6000 and 2000 series, ADSP 2000 series); FPGAs and their\napplications. Interfacing experiments with i/o ports, timers, ADC-DAC, stepper\nmotor interface; Simple applications of embedded processors in signal\nprocessing, real time control and consumer electronics.\nExposure to software\ndevelopment platforms and environments and simple operating systems.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE39004:_Embedded_Systems_Lab.&oldid=26065\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE60040:_Experimental_Stress_Analysis",
        "title": "AE60040: Experimental Stress Analysis",
        "content": "AE60040\nCourse name\nExperimental Stress Analysis\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: AE60005Basic equations, Airy s stress function, two-dimensional\nproblems, Strain measurement methods, strain gages, gage sensitivity and gage\nfactor, demonstration of measurement techniques. Two dimensional photoelasticity; wave theory, polariscopes, isochromatic and isoclinic fringe\npatterns,Compensation techniques, calibration, separation methods, properties\nof photo-elastic materials, introduction to three-dimensional photo-elasticity,\ndemonstrations using reflection and transmission polariscopes, Brittle coating\nmethods, moirÃ© method, birefringent coating and holographic interferometry\ntechnique.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\n3rd Year Class Room\n3rd Year Class Room\nTuesday\n3rd Year Class Room\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE60040:_Experimental_Stress_Analysis&oldid=56038\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/TE60114:_Broadband_Access_Networks",
        "title": "TE60114: Broadband Access Networks",
        "content": "TE60114\nCourse name\nBroadband Access Networks\nOffered by\nG.S Sanyal School of Telecommunication\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nGSCLA1\nThursday\nGSCLA1\nFriday\nGSCLA1\nGSCLA1\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=TE60114:_Broadband_Access_Networks&oldid=56652\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AG67201:_Thesis_Part-i",
        "title": "AG67201: Thesis Part-i",
        "content": "AG67201\nCourse name\nThesis Part-i\nOffered by\nAgricultural and Food Engineering\nCredits\n20\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AG67201:_Thesis_Part-i&oldid=56085\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EP60028:_Global_Entrepreneurship_Labs_-_Emerging_Markets",
        "title": "EP60028: Global Entrepreneurship Labs - Emerging Markets",
        "content": "EP60028\nCourse name\nGlobal Entrepreneurship Labs - Emerging Markets\nOffered by\nRajendra Mishra School of Engineering Entrepreneurship\nCredits\n3\nL-T-P\n2-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nGlobal Entrepreneurship labs â Emerging Markets (EP 60028) Market review of\nemerging markets, Economics of growth, the major entrepreneurship labs/centers\nof the world, International marketing and business development, Networking of\nentrepreneurs based on culture and type of businesses, simultaneous access of\nventure resources, innovations and technical talent for accelerated ripening of\ngrowth ventures\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EP60028:_Global_Entrepreneurship_Labs_-_Emerging_Markets&oldid=14975\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Life_Fellows",
        "title": "Life Fellows",
        "content": "Life Fellows at IIT Kharagpur are successful people who have been a support and guidance towards the development of IIT Kharagpur.\nEligibility\nThis section is empty.\nYou can help by\nadding to it\n.\nLife Fellows List\nThe current list of life fellows are\n[\n1\n]\n:\nPurnendu Chatterjee (Since 2003)\nDr. Purnendu Chatterjee is the Chairman of Chatterjee Group, which makes long-term strategic investments in public and private companies, with primary focus in telecommunications and information technology industries. Chatterjee Group is the lead promoter of Haldia Petrochemicals, Ltd., a world-scale petrochemical complex in India. Other areas of investments include : Outsourced technology-based services, real estate, aviation, and financial services. United States and India are the major areas of focus. Dr. Chatterjee's unique background combines expertise in technology, management consulting and international investing. He serves on the Board of Haldia Petrochemicals Ltd., Financial Technologies International Inc., Call Sciences Inc., TCG Software, Chembiotek Research International, and other companies.\n[\n2\n]\nPrior business associations have been with the internationally renowned investor, George Soros, in addition to being an advisor to the Quantum Group of Funds managed by Soros Fund Management. At McKinsey & Company where Dr. Chatterjee was a Principal, he led major strategy and organizational assignments for chief executive officers of large industrial companies in the U.S., Europe, and Japan.\n[\n2\n]\nDr. Chatterjee received a B.Tech. from the Indian Institute of Technology Kharagpur and both Masters and Doctorate degrees in Operations Research from the University of California, Berkeley. He was a research associate at the Stanford Research Institute.\n[\n2\n]\nDr. Chatterjee is a founding member of the Indian School of Business and Advanced VLSI Design Laboratory at IIT Kharagpur. He is also a Trustee of Asia Society; TiE (The Indus Entrepreneurs); Center for the Advanced Study of India, University of Pennsylvania; President of the TiE Tri-State; and a Board member of I-Create; US - India Business Council; and member of the Council on Foreign Relations.\n[\n2\n]\nBrijendra Kumar Syngal (Since 2003)\nSri Brijendra Kumar Syngal, Vice Chariman, BPL Communications Limited is an alumnus of IIT Kharagpur with an illustrious career spanning over four decades as a leading telecommunication expert and administrator in the country. Sri Syngal obtained B.Tech (Hons) and M.Tech degrees from IIT Kharagpur in 1961 and 1962, respectively. He was the Chairman and Managing Director of Videsh Sanchar Nigam Limited, the leading provider of international telecommunication services in India, from 1991-98. Under his stewardship, VSNL grew into one of the top ten listed companies within the private and public sectors in India.\n[\n3\n]\nBefore joining BPL Communication, he also served as Chairman of Reliance Telecom Limited from 1998-2001. His initiatives over the two years at Reliance resulted in defining the vision and the strategy in the area of Telecomm for the group. In recognition of his outstanding contributions to the field of telecommunications, he has received a large number of awards which include \"Partners in Progress\" award by the Govt. of Maharashtra, \"International Excellence Award\", \"Telecomm Man of the Decade\" award. He has played a major role in the International Telecommunication arena shouldering responsibilities like Chairman, Commonwealth Telecommunications Organization, London; Councillor for India, INMARSAT Council, London; Governor, INTELSAT Board, Washington D.C., to name a few.\n[\n3\n]\nSri Syngal is actively associated with IIT Kharagpur as a member of the Advisory Committee of G. S. Sanyal School of Telecommunications. He was instrumental in setting up VSNL sponsored Chair on Information Technology and a number of scholarships for undergraduate students at IIT Kharagpur.\n[\n3\n]\nSatyendranath Das (Since 2003)\nBorn in 1926, Dr. Satyendranath Das, obtained M. Sc. degree in Applied Physics from Calcutta University and Ph.D. in Microwave Physics from London University. Dr. Das taught Electronics at several Universities in India, U.K. and U.S.A. and has served Government, Industries like Loral, TRW, Lockheed and research institutions in U.S.A. He was a member of the U.S. delegation to International Telecommunication Union Committee Consultative, International Radio meetings and 1979 World Administrative Radio Conference. Dr. Das holds 26 patents and has published several research papers in international journals. He is currently retired and settled in U.S.A.\n[\n4\n]\nDr. Das has taken number of steps to support research and development at IIT Kharagpur and at a few other institutions in West Bengal. He was instrumental in sending eminent experts to deliver Labanyamayee Das Seminar lectures in the Institute. Dr. Das donated fund to set up Rajendranath Das Chair in Integrated Circuits in the Computer Science & Engineering Department of the Institute. He also provided fund for creating Labanyamayee Das Molecular Genetics R&D Laboratory in the Biotechnology Department of the Institute.\n[\n4\n]\nDr. Das is actively involved in sponsoring awards and scholarships to meritorious students in West Bengal. He has been providing financial support to academic and research programmes in a number of schools in the state and also to Narendrapur College, Ramakrishna Mission Institutions, Jadavpur University and Calcutta University.\n[\n4\n]\nAnadi Sankar Gupta (Since 2003)\nBorn on 1st November, 1932, Dr. Anadi Sankar Gupta obtained M.Sc. in Applied Mathematics with First Class from Calcutta University in 1954, Ph.D. degree in Mathematics in 1958 from IIT Kharagpur and D.Sc. degree in Mathematics in 1966 also from this Institute.\n[\n5\n]\nProfessor Gupta was one of the most renowned Professors of Mathematics of this Institute. He was elected a Fellow of Indian National Science Academy in 1980 and in 1990 a Fellow of National Academy of Sciences. He was the President of Annual Congress of the Indian Society of Theoretical and Applied Mechanics in 1985, Annual Congress of the National Society of Fluid Mechanics and Fluid Power in 1990 and Annual Congress of Indian Mathematical Society in 1999. Dr. Gupta wrote a book named \"Calculus of Variations with Applications\" published by Prentice Hall of India, New Delhi.\n[\n5\n]\nProfessor Gupta was honoured with the prestigious S. S. Bhatnagar award in 1972. He is the recipient of F.I.C.C.I. award in 1978, P. L. Bhatnagar Memorial Lecture award of Indian Mathematical Society in 1995 and Professor Vishnu Vasudeva Narlikar Memorial Lecture award of INSA in 2003. Even after his retirement in 1993, Dr. Gupta is actively involved in research and is rendering his valuable services to the Institute as Emeritus Professor and is currently INSA Honorary Scientist in the Department of Mathematics.\n[\n5\n]\nVinod Gupta (Since 2002)\nMain article:\nVinod Gupta\nMr. Vinod Gupta, Chairman and CEO, infoUSA Inc. (formerly American Business Information, Inc.) graduated from liT Kharagpur in 1967. Thereafter he went to the USA to do an MS in Agricultural Engineering and obtained a Master's degree in Business Administration from the University of Nebraska in 1972. After a stint as Marketing Research Manager in Commodore Corporation, Mr. Gupta founded his own business company, American Business Information Inc. with a capital of 100 dollars. Within a short time the company began to flourish because of the unique information services it offered to American businessmen.\n[\n6\n]\nMr. Gupta's power of organization and breadth of vision is nothing short of extraordinary. This has been recognized through the many awards and honours he has received in the USA. Only a few can be mentioned here (1) Doctor of Humane Letters by University of Nebraska, 1999 (2) Member of Board of Trustees of the John F. Kennedy Center for the Performing Arts (Appointed by the President of the United States, William Jefferson Clinton) (3) He was nominated and confirmed to be the u.s. Counsel General to Bermuda. He was nominated to be the U.S. Ambassador to Fiji, due to business pressures, he withdrew his nomination. (4) Business Leadership award 1991 (by the Alumni Association of the College of Business Administration of the University of Nebraska) (5) Entrepreneur of the Year 1989 (by the Nebraska for Productivity and Entrepreneurship, University of Nebraska).\n[\n6\n]\nFor the past many years Mr. Gupta has been offering a scholarship for the best performance in Humanities and Social Sciences among B. Tech student. In 1992 Mr. Gupta gave two million dollars to the Institute for setting up the Vinod Gupta School of Management, which has already emerged as a front-ranking business school. He continues to support the school by encouraging sponsorship to Indian students for doing project work in American industries. By forming the Technology Foundation, Mr. Gupta set in motion a vital and vibrant interaction between IIT faculty, administration and the alumni abroad. He has provided various kinds of assistance to IIT students and pays regular visits to the school to discuss and chalk out constructive plans.\n[\n6\n]\nArjun Malhotra (Since 2002)\nMain article:\nArjun Malhotra\nMr. Arjun Malhotra, Chairman and CEO, TechSpan, Inc., USA, is one of the most distinguished alumni of IIT Kharagpur. A graduate in Electronics and Electrical Communication Engineering of the batch of 1970, he excelled in academics as well as extra-curricular activities and was awarded the highly coveted B.C Roy Gold Medal for all-round performance. He was the General Secretary, R.P. Hall in 1968-69 and was elected the General Secretary, Sports, of the Students' Gymkhana in 1969-70. Mr. Malhotra made his mark through his strong leadership qualities, which were perhaps seeded during his school days at Doon School.\n[\n7\n]\nAs a pioneer in Information Technology, Mr. Malhotra's name has almost become a byword for innovation and enterprise. Starting with a modest venture, Microcomp Ltd., with five friends in 1975 and an equity of Rs 1.75 lacs, Mr. Malhotra went on to create the HCL Limited, fired by a steady vision and strong resolve. This was followed by the creation of other organizations like Hindustan Instruments Ltd, Hindustan Reprographics Ltd, Hindustan Telecommunication Ltd, NIIT Ltd, and Far East Computer Private Ltd, Singapore.\n[\n7\n]\nIn 1989, Mr. Malhotra set up HCL America Inc in Sunnyvale, USA which evolved to become HCL Technologies. Today the group has an employee strength of 8500, with its revenues soaring to several thousand crores of rupees. Mr. Malhotra's ceaseless entrepreneurial spirit today finds expression in TechSpan, the 12-year old Distributed ConsultingTM IT services company.\n[\n7\n]\nMr Malhotra has made outstanding contributions to his alma mater by founding the G.S. Sanyal School of Telecommunication, named after his Professor and former Director, liT Kharagpur for advanced research in electronics. He has also helped actively in setting up the campus communication network and VLSI Laboratory. He acts as a great source of inspiration to the faculty and researchers during his annual visits to the school.\n[\n7\n]\nBijoy G. Chatterjee (Since 2002)\nMr. Bijoy G. Chatterjee, Director, Systems Research, National Semiconductor Corporation, USA is not an IIT Kharagpur alumnus, but it would be difficult to find a truer and more selfless friend of the Institute. He has made significant contributions to the infrastructure development and promotion of industrially relevant research at th is Institute and fostered its collaboration with internationally reputed institutions. Mr. Chatterjee obtained his BSEE degree from BIT, Sindri, and his MSEE from Berkeley, California.\n[\n8\n]\nMr. Chatterjee was a member of the team from US universities who pioneered Computer Science education at IIT Kanpur. He also worked at Union Carbide and Tata Consultancy Services. He was the founding secretary of the Indian Computer Group in 1964, which later became the Computer Society of India. He developed software for Operating Systems, Language Processors and Data Base Management System during the late sixties and the early seventies. He was responsible for the integration, operation and enhancement of Illiac IV, the legendary parallel computer at Ames Research Center. He spent fifteen years developing and running the Advanced Technology Laboratory of TRW at Sunnyvale, CA.\n[\n8\n]\nIt was Mr. Chatterjee who first conceived the possibility of setting up a world class VLSI Design Laboratory at IIT Kharagpur. He persuaded the IIT foundation to provide funds for the project and urged successfully five major internationally acclaimed industries (National Semiconductor Corporation, Sun Microsystems, Agilent Technologies, Cadence and Synopsys) to support it technically. He continues to help the project by providing strategic advice and facilitates collaboration with top US universities. Mr. Chatterjee has helped the departments of CSE, ECE and EE to initiate research programmes in cutting edge areas of technology and has been instrumental in obtaining funding close to one million dollars for such programmes in the last three years. He initiated collaboration between Kharagpur and US universities with the visit of liT faculty and students to GaTech, UMich and UW. He arranged courses at Kharagpur by international experts and introduced faculty and students to eminent scientists in the USA. He is now working on development of a joint program between Kharagpur and leading US universities where US students will come to IIT Kharagpur for training.\n[\n8\n]\nSuhas S. Patil (Since 2002)\nDr. Suhas S. Patil is founder and Chairman Emeritus of Cirrus Logic Inc. a leading semiconductor company in USA. Founded by him in 1984, Cirrus Logic is recognized for creating the fabless business model of semiconductor companies. Cirrus Logic brought to fruition VLSI design methodology work Dr. Patil did at the Massachusetts Institute of Technology and at the University of Utah.\n[\n9\n]\nSuhas S. Patil received his B.Tech. degree in Electronics and Electrical Communication Engineering from IIT Kharagpur in 1965. He completed a Doctor of Science degree in Electrical Engineering form MIT in 1970. He joined MIT as Assistant Professor in 1970. While at MIT, Dr. Patil also served as Assistant Director of Projects MAC (Multi-Access Computer), the largest computer science laboratory in USA at that time, where modern time-sharing was developed. He is author of 40 publications and recipient of several patents.\n[\n9\n]\nDr. Patil is a founder and the first president of The Indus Entrepreneurs (TiE) a global non-profit organization teaching and fostering entrepreneurship. He serves on the Board of Trustees of The Computer History Museum, The Tech Museum and the World Affairs Counsel of Northern California. He is an investor in and Chairman of Cradle Technologies a semiconductor startup company in Silicon Valley.\n[\n9\n]\nAn honorary doctoral degree was conferred upon him in 1995 at the 41st annual convocation. He is the main architect in the conceptualization of the campus wide network and has been one of the major contributor and fund-raisers for the same. The funds generated by his team were also used for procurement and distribution of subsidized computers to the students of this Institute.\n[\n9\n]\nG. S. Sanyal (Since 2006)\nMain article:\nG.S. Sanyal\nOver the years, Professor Sanyal has contributed immensely to the development of higher technological education of the country, in general, and IIT Kharagpur in particular, through his continuous association with the Institute since 1954 till date.\n[\n10\n]\nProfessor Sanyal has committed himself passionately to the social welfare including the use of technology for rural upliftment. For this scholarship, patriotism and innate love of students, Professor Sanyal's name has become a byword among generations of learners at IIT Kharagpur. This love has been repaid in ample measure, as evidenced in the setting up of the G. S. Sanyal School of Telecommunication by one of his former students, Sri Arjun Malhotra, now a Life fellow of the Institute. His meritorious contribution to the field of Communication Engineering has been recognised by the Institute through the award of D. Sc. (Doctor of Science) Honorius Causa in the 49th Convocation.\n[\n10\n]\nReferences\n↑\nLife Fellows list at IIT Kharagpur\n↑\n2.0\n2.1\n2.2\n2.3\nLife Fellow Page of Dr. Chatterjee\n↑\n3.0\n3.1\n3.2\nLife Fellow Page of Shri Syngal\n↑\n4.0\n4.1\n4.2\nLife Fellow Page of Sandyenranath Das\n↑\n5.0\n5.1\n5.2\nLife Fellow Page of Anadi Sankar Gupta\n↑\n6.0\n6.1\n6.2\nLife Fellow Page of Vinod Gupta\n↑\n7.0\n7.1\n7.2\n7.3\nLife Fellow Page of Arjun Malhotra\n↑\n8.0\n8.1\n8.2\nLife Fellow Page of Bijoy Chatterjee\n↑\n9.0\n9.1\n9.2\n9.3\nLife Fellow Page of Suhas Patil\n↑\n10.0\n10.1\nLife Fellow Page of G.S.Sanyal\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Life_Fellows&oldid=22046\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BT41022:_Neurophysiology",
        "title": "BT41022: Neurophysiology",
        "content": "BT41022\nCourse name\nNeurophysiology\nOffered by\nBiotechnology\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n3\n10\n5\n5\n13\n3\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nNerve-Muscle Physiology: Neuron structure and function; Regeneration of\nnerve;;Axoplasmic flow and transport mechanism in the axons; Nature of nerve\nfibre excitation and interpretation of action potential; Significance of\ndifferent nerve fibre types. Structural architecture of Neuro-Muscular Junction\n(NMJ); Neuro-muscular transmission - Electrical and Biochemical events; Drugs\nacting at NMJ. Protein components and contraction mechanism of muscles. B.\nNervous System : Interpretative function of cerebral cortex. Aging and its\neffect on brain, Regulatory function of cerebellum and structure activity\nrelationship (neural circuitory) of cerebellum, Vestibular apparatus,\nhypothalamus and its functions, basal ganglia, thalamo cortical projections.\nNon-specific sensory mechanism- Sleep and wakefulness. Behavioral functions of\nthe brain - emotion, memory, learning and consciousness, Pharmacology and\nchemical transmission autonomic nervous system. C. Special Sense: Sensory\nmodalities, Sensory receptors, Sensory circuits, and Sensory perception. Taste\nsystem , Olfactory system, Visual Sense and Auditory Senses\nConcepts taught in class\nStudent Opinion\nIf taught by ASG and SD, this is going to be not interesting. You will be expected to remember only names. Not much learning happens. If interested in neuro, prefer taking these courses\nEC dept - Computational Neuroscience - Autumn\nBS dept - Neurochemistry - Autumn\nEC dept - Neural Coding of Sensory Information - Spring\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BT41022:_Neurophysiology&oldid=193717\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AR51002:_Appropriate_Building_Technologies",
        "title": "AR51002: Appropriate Building Technologies",
        "content": "AR51002\nCourse name\nAppropriate Building Technologies\nOffered by\nArchitecture & Regional Planning\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nBasic shelter issues in India. National Building Organisation- Recommendation\nof Housing\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AR51002:_Appropriate_Building_Technologies&oldid=16330\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CY41009:_Introduction_To_Quantum_Chemistry_And_Spectroscopy",
        "title": "CY41009: Introduction To Quantum Chemistry And Spectroscopy",
        "content": "CY41009\nCourse name\nIntroduction To Quantum Chemistry And Spectroscopy\nOffered by\nChemistry\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n4\n12\n18\n10\n12\n8\n4\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite : Nil\nReview of quantum mechanics: SchrÃ¶dinger wave equation, Eigenfunction,\neigenvalues and operators, Interpretation of wavefunctions, Free particle,\nParticle-in-a-box, Rigid rotor, Harmonic oscillator, Hydrogen atom;\nIntroduction to Self Consistent Field Theories; Valence Bond and Molecular\nOrbital theories; Introduction to Molecular spectroscopy: absorption, emission\nand resonance.\nBooks: Methods of Molecular Quantum Mechanics by P.W. Atkins\nPhysical Chemistry: A Molecular Approach by D.A.McQuarrie and J.D. Simon\nMolecular Spectroscopy by I. N. Levine\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nNC432\nTuesday\nWednesday\nNC432\nNC432\nThursday\nNC432\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CY41009:_Introduction_To_Quantum_Chemistry_And_Spectroscopy&oldid=56425\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Brundavanam_Maruthi_Manoj",
        "title": "Brundavanam Maruthi Manoj",
        "content": "Brundavanam Maruthi Manoj\nDepartment\nPhysics\nResearch Area(s)\nSingular Optics\nApplied Optics\nUltrafast Laser Filamentation\nYear Joined\n2013\nemail\n[email protected]\nSee Also\nDepartment of Physics\nExternal links\nBrundavanam Maruthi Manoj\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Brundavanam_Maruthi_Manoj&oldid=6424\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Dharmendra_Kumar_Gupta",
        "title": "Dharmendra Kumar Gupta",
        "content": "Dharmendra Kumar Gupta\nDepartment\nMathematics\nResearch Area(s)\nNumerical Analysis and Computer Science\nConstraint Satisfaction Problems\nYear Joined\n1985\nemail\n[email protected]\nSee Also\nDepartment of Mathematics\nExternal links\nDharmendra Kumar Gupta\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Dharmendra_Kumar_Gupta&oldid=6270\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ME60353:_Knowledge_Based_Systems_In_Engineering",
        "title": "ME60353: Knowledge Based Systems In Engineering",
        "content": "ME60353\nCourse name\nKnowledge Based Systems In Engineering\nOffered by\nMechanical Engineering\nCredits\n4\nL-T-P\n4-0-0\nPrevious Year Grade Distribution\n1\n4\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to expert systems – Definition, Need for expert systems, Methods\nof developing expert system – offline training/learning & on-line\ntraining/learning\nTools for developing expert systems – Hard Computing vs. Soft Computing, Fuzzy\nSet Theory, Fuzzy Logic Controllers (FLC), Neural Network (NN) Controllers –\nback propagation network, SOM, radial basis function networks, recurrent neural\nnetworks etc., Learning/optimisation tools – traditional (direct search and\ngradient based) and non-traditional (genetic algorithms (GAs), simulated\nannealing etc.) techniques. Combined techniques of soft computing – GA-FLC, GANN, NN-FLC, GA-FLC-NN\nSome Applications\nConcepts taught in class\nStudent Opinion\nContents of these playlists -\n1\nand\n2\nis taught in the classes. Watching those videos at 2X will be enough preparation for exam. Just make sure not to make calculation mistakes in exam. This is a good course to take. Less Load. Easy grade scoring. Grading is absolute, just take care of that.\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nNR422\nThursday\nNR422\nFriday\nNR422\nNR422\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ME60353:_Knowledge_Based_Systems_In_Engineering&oldid=193721\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE48001:_Industrial_Training",
        "title": "EE48001: Industrial Training",
        "content": "EE48001\nCourse name\nIndustrial Training\nOffered by\nElectrical Engineering\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE48001:_Industrial_Training&oldid=56513\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/How_to_get_a_certificate_from_Coursera_free_of_cost",
        "title": "How to get a certificate from Coursera free of cost",
        "content": "Coursera is an online learning platform founded by Stanford professors Andrew Ng and Daphne Koller that offers courses, specializations, and degrees. Many of the students are enrolled in various courses there. You will be getting a certificate on completion of the course. But, almost all of the courses ask for money from the users for the certificate and access to assignments and quizzes.\nYou can apply for financial aid if you want the certificate and course materials for free. There is also a 7-day trial and audit option. But, when you can do the whole course and get a certificate for free, who cares about all these? For financial aid, you need to upload an ID proof(ex: College ID, Voter ID, Driving license, etc.) Don't upload Aadhar card as it requires photo verification. Then, you need to describe why you want a financial aid and your future plans after doing the corresponding course in 150 words each. Chill! You can do it :D. Don't copy-paste stuff in the text boxes. Almost all financial aids from students will get approved if it sounds genuine. You may have to wait 15 days for the approval. In this time period, you are not allowed to use the 7-day free trial option. If you do that, your application for financial aid will get cancelled. Keep calm. You can still audit the course. You can have 11 pending financial aid applications at a time.\nNEW SCHEME BY COURSERA from 2020\nAfter Covid-19 pandemic and closure of offline classes in Institutes, many Institutes collaborated with Coursera and Its starts giving one of the any course for free of cost, moreover you will get a certificate also. In starting months of 2020 till September 2020, It was giving all the courses for free of cost, in-fact Specializations course also but this scheme came to end. Now its giving only one course for free and if you want more, then you can apply for finical aid as stated above. You only have to verify yourself as student of collaborated institutes by verifying your account by institute email id in \"For Student\" section(Top most right part of navigation bar of Coursera site) .\nMost Popular Courses in 2017:\nMachine Learning\nNeural Networks and Deep Learning\nLearning How to Learn: Powerful Mental Tools to Help You Master Tough Subjects\nIntroduction to Mathematical Thinking\nBitcoin and Cryptocurrency Technologies\nProgramming for Everybody (Getting Started with Python)\nAlgorithms, Part I\nEnglish for Career Development\nNeural Networks for Machine Learning\nFinancial Markets\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=How_to_get_a_certificate_from_Coursera_free_of_cost&oldid=238128\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Subhasish_Basu_Majumder",
        "title": "Subhasish Basu Majumder",
        "content": "Subhasish Basu Majumder\nDepartment\nMaterials Science\nResearch Area(s)\nOxide gas sensors\nLithium rechargeable batteries\nFly ash based ceramic products\nNatural fiber reinforced cement composites\nMultiferroic thin films and composites\nYear Joined\n2006\nemail\n[email protected]\nSee Also\nDepartment of Materials Science\nExternal links\nSubhasish Basu Majumder\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Subhasish_Basu_Majumder&oldid=6196\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE60050:_Plates_And_Shells",
        "title": "AE60050: Plates And Shells",
        "content": "AE60050\nCourse name\nPLATES AND SHELLS\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: AE60005 Bending theory of thin plates: governing equations,\nrectangular and circular plates, plates of other shapes; Large deflection\nbending analysis; Elastic buckling analysis of plates; Post buckling behavior;\nBending theory of thin shells: shell geometry, governing equations. Membrane\nand bending analysis: shells of revolution and shells of translation; Energy\nand approximate methods for analysis of plates and shells.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE60050:_Plates_And_Shells&oldid=16338\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS69015:_Psychological_Testing_And_Measurement_Lab",
        "title": "HS69015: Psychological Testing And Measurement Lab",
        "content": "HS69015\nCourse name\nPSYCHOLOGICAL TESTING AND MEASUREMENT LAB\nOffered by\nHumanities & Social Sciences\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nCourse Content\nFundamentals of testing, Test Construction: item analysis, reliability,\nvalidity, norms; Intelligence test: Weschler adult intelligence scale,\ncognitive assessment system, Ravens’ progressive matrices; Torrance test of\ncreativity; Aptitude test battery; Personality test: big-five personality\nfactors, MBTI, EPI, happiness, arrogance and humility; Projective test:\nthematic apperception test, word-association test, situation reaction test;\nAttitude and value scales: Rokeach and Super scale; Organizational commitment,\njob satisfaction, organizational role stress, and emotional quotient mapping;\nAssessment of organizational climate and culture; Leadership profiling.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nPSYCHOLOGY LAB\nPSYCHOLOGY LAB\nPSYCHOLOGY LAB\nTuesday\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS69015:_Psychological_Testing_And_Measurement_Lab&oldid=56714\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IP63163:_Traditional_Knowledge_Protection",
        "title": "IP63163: Traditional Knowledge Protection",
        "content": "IP63163\nCourse name\nTraditional Knowledge Protection\nOffered by\nRajiv Gandhi School of Intellectual Property Law\nCredits\n3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IP63163:_Traditional_Knowledge_Protection&oldid=56791\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE69019:_Instrumentation_Laboratory_I",
        "title": "EE69019: Instrumentation Laboratory I",
        "content": "EE69019\nCourse name\nINSTRUMENTATION LABORATORY I\nOffered by\nElectrical Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n2\n14\n13\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\n1.\nLevel Measurement using capacitive Transducer.2.\nBridge Amplifier\nfor Temperature measurement.3.\nIC temperature sensor ( AD 590) for\ntemperature measurement and cold junction compensation.4.\nStudy and\ntesting of LVDT.5.\nPressure Transducers and its signal conditioning.\nPiezo Electric Transducers and its signal conditioning.6.\nStudy of various\nflow measurement devices (V notch, Hotwire , Optical and Rotameter).7.\nStrain gauge and its signal conditioning\nStudy of hall effect transducer.8.\nSpeed measurement using various sensor like magnetic, photo electric pick\nup.9.\nGroup-wise Miniprojects\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nInstrumentaion lab\nInstrumentaion lab\nInstrumentaion lab\nFriday\nInstrumentaion lab\nInstrumentaion lab\nInstrumentaion lab\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE69019:_Instrumentation_Laboratory_I&oldid=56548\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IP63901:_Clinical_Legal_Program_(advanced_Legal_Writing)",
        "title": "IP63901: Clinical Legal Program (advanced Legal Writing)",
        "content": "IP63901\nCourse name\nClinical Legal Program (advanced Legal Writing)\nOffered by\nRajiv Gandhi School of Intellectual Property Law\nCredits\n3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IP63901:_Clinical_Legal_Program_(advanced_Legal_Writing)&oldid=56796\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/RT60011:_Basic_Rubber_Science",
        "title": "RT60011: Basic Rubber Science",
        "content": "RT60011\nCourse name\nBASIC RUBBER SCIENCE\nOffered by\nRubber Technology Centre\nCredits\n4\nL-T-P\n4-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to rubber, macromolecular concept, definition-glassy state,\nrubbery state, viscoelasticity, glass transition temperature, crystallinity\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nTuesday\nIn Dept\nIn Dept\nWednesday\nThursday\nIn Dept\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=RT60011:_Basic_Rubber_Science&oldid=57175\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/PH60308:_General_Theory_Of_Relativity",
        "title": "PH60308: General Theory Of Relativity",
        "content": "PH60308\nCourse name\nGeneral Theory Of Relativity\nOffered by\nPhysics\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\n5\n4\n1\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nMathematical background\\manifolds , tensor fields , connection and curvature ;\npriniciple of equivalence and general covariance, geodesics and geodesic\ndeviation, action principle , Einstein s equation , solutions- black holes\n(Schwarzschild, Reissner Nordstrom , Kerr) , Penrose diagrams , gravitational\nwaves and cosmology (FRW models and some observational cosmology) , initial\nvalue problem , causal structure and singularities , black hole thermodynamics\n, brief introduction to problems of quantising gravity.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=PH60308:_General_Theory_Of_Relativity&oldid=25967\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/TGH",
        "title": "Technology Guest House",
        "content": "Technology Guest House\nabbreviated as\nTGH\nis one of the\nguest houses\nin the campus along with\nVisveswaraya Guest House\nand\nKolkata Guest House\n, the latter being situated in Kolkata. It is located on the Scholar's Avenue, next to Director's Bungalow.\nInfrastructure\nThe guest house has two reception counters, one located in the main building entrance and the other in the annex building located right beside it. Forms for pre-booking are typically available in the reception counter of annex building.\nBooking\nGuests are categorized into 4 categories and are charged accordingly. Category A and Category B guests are usually concerned with institute activities and are invited directly by the institute or any department. Students' parents accommodation is facilitated by Category C and which can be permitted by the hall warden or any other faculty. Finally, Category D is the self reservation option for those who do not fall into above categories.\nA status of room availability can be checked\nonline\n. The booking form can be availed from the counter or download online from the given links below.\nLinks\nWebsite :\nhttp://www.iitkgp.ac.in/gh/\nComplete Information :\nhttp://www.iitkgp.ac.in/downloads/New_form_back_page.pdf\nForm :\nhttp://www.iitkgp.ac.in/downloads/new_TGH_Form_front_page.pdf\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Technology_Guest_House&oldid=7171\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE41029:_Urban_Transportation_Systems_Planning",
        "title": "CE41029: Urban Transportation Systems Planning",
        "content": "CE41029\nCourse name\nUrban Transportation Systems Planning\nOffered by\nCivil Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to Urban Transportation Planning and Four Step Travel Demand\nForecasting Process, Information Needs for Travel Demand Forecasting, Travel\nDemand Forecasting: Trip Generation, Trip Distribution, Mode Choice and\nTraffic Assignment, Land use/ Transportation system and Models\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE41029:_Urban_Transportation_Systems_Planning&oldid=14839\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CS60090:_Software_Engineering",
        "title": "CS60090: Software Engineering",
        "content": "CS60090\nCourse name\nSOFTWARE ENGINEERING\nOffered by\nComputer Science & Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nIntroduction. Life cycle models, Requirements analysis and specification,\nFormal requirements specification. Fundamental issues in software design:\ngoodness of design, cohesion, coupling. Function-oriented design: structured\nanalysis and design. Overview of object-oriented concepts. Unified Modelling\nLanguage (UML). Unified design process. User interface design. Coding standards\nand guidelines. Code walkthrough and reviews. Unit testing. Black box and white\nbox testing. Integration and system testing. Software quality and reliability.\nSEI CMM and ISO 9001. PSP and Six Sigma. Cleanroom technique. Software project\nmanagement. Configuration management. Software maintenance issues and\ntechniques. Software reuse. Client-server software development.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CS60090:_Software_Engineering&oldid=15113\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CS40017:_Object_Oriented_System_Design",
        "title": "CS40017: Object Oriented System Design",
        "content": "CS40017\nCourse name\nObject Oriented System Design\nOffered by\nComputer Science & Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nThis course will cover object-oriented approach to modeling, problem solving,\nrequirement analysis, system design, system implementation, database design,\nsystem engineering and software engineering.Fundamental concepts of object\noriented programming: Introduction to the principles of object-oriented\nprogramming (classes, objects, messages, encapsulation, inheritance,\npolymorphism, exception handling, and object-oriented containers).Object design\nimplementation in a programming language, e.g., C\nor Java.Object oriented\nanalysis, modeling and design. UML may be introduced. Use cases, use case\ndriven analysis.Structural modeling: classes, relationships, interfaces, class\ndiagrams, and object diagrams, in UML.Behavioral/Functional modeling: use case\ndiagrams, sequence diagrams, in UML.Dynamic modeling: State chartsArchitectural\nmodelingAnalysis patterns, Design patterns.Distributed object model: CORBA and\nCOM / DCOMObject oriented database systems: Object oriented data model, query\nlanguages, storage organization and indexing techniques; object relational\ndatabases.References1.Bertrand Meyer, Object Oriented Software Construction,\nPrentice-Hall.2.Grady Booch, Object Oriented Analysis and Design, AddisonWesley.3.Grady Booch, James Rumbaugh and Ivar Jacobson, Unified Modeling\nLanguage Guide, Addison-Wesley.4.Erich Gamma et al., Design Patterns: Elements\nof Reusable OO Software, Addison-Wesley.5.Michael L. Scott, Programming\nLanguage Pragmatics, Morgan-Kaufmann.6.Kim Bruce, Foundations of Object\nOriented Languages, Prentice-Hall.7.Benjamin C. Pierce, Types and Programming\nLanguages, Prentice-Hall.8.Bjarne Stroustrup, The Design and Evolution of C ,\nAddison-Wesley.9.Bill Venners, Inside the JAVA 2 Virtual Machine, McGraw\nHill.10.James E. Smith and Ravi Nair, Virtual Machines, Elsevier/MorganKaufmann.11.Saba Zamir, Handbook of Object Technology, CRC Press.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CS40017:_Object_Oriented_System_Design&oldid=15048\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CY61022:_Synthesis_And_Processing_Of_Ceramics",
        "title": "CY61022: Synthesis And Processing Of Ceramics",
        "content": "CY61022\nCourse name\nSynthesis And Processing Of Ceramics\nOffered by\nChemistry\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite : NilClassification of ceramics and materials: crystal structures\nand properties. Elementary ceramic phase diagrams. Ceramic powder preparation\nfrom naturally occurring raw materials. Synthesis of ceramic powders,\nfabrication of ceramic bodies from powders: pressing, casting, vapour phase\ntechniques, sintering, finishing, machining. Ceramic coatings\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CY61022:_Synthesis_And_Processing_Of_Ceramics&oldid=15847\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/General_Championship_(Technology)",
        "title": "General Championship (Technology)",
        "content": "Cups\nKnowledge Cup\nBiz Quiz\nTech Quiz\nMaths Olympiad\nEach hall sends a team of 4 people to participate in this event. Questions cover a range of topics like algebra, geometry, number theory and combinatorics. Each team solves the exam together and the judges rank the halls according to their scores at the end of the exam.\nApplication Cup\nChem Quest\nCase Study\nOpen Soft\nA problem statement containing specifications of the software to be developed and related constraints is released to public at the start of the competitions. Each hall then works through their solution over the stipulated even period (x days) to make a submission. Later, each hall presents their solution to a panel of internal and external judges who then award marks and accordingly rank the teams.\nInnovation Cup\nProduct Design\nAd Design\nHardware Modelling\nStrategy Cup\nData Analytics\nPoints Table\nCup\nEvents\nPoints\nKnowledge\nBiz Quiz\n75\nTech Quiz\n75\nMaths Olympiads\n75\nApplication\nChem Quest\n75\nCase Study\n75\nOpen Soft\n100\nInnovation\nProduct Design\n100\nAd Design\n75\nHardware Modelling\n100\nStrategy\nData Analysis\n75\nHistory\nReferences\n[\n1\n]\n↑\nhttp://issuu.com/anupampedarla/docs/gc_newsletter\n| News letter | Anupam Pedarla (G.Sec Tech, TSG)\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=General_Championship_(Technology)&oldid=209523\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Koushik_Biswas",
        "title": "Koushik Biswas",
        "content": "Koushik Biswas\nDepartment\nMetallurgical & Materials Engineering\nResearch Area(s)\nEnergy materials (Hydrogen storage - Solid Oxide Fuel Cell - Lithium Ion Battery)\nElectroceramics (Ferroelectric - Pyroelectric - Relaxor - Multiferroics)\nStructural Ceramics (ZrO2 -  Al2O3 - TBC - SiC)\nCeramic Reinforced Metal Matrix Composites (steel and Al-based MMC with SiC - TiC-other Carbide)\nSintering (Conventional  -  Microwave  -  SPS)\nAbinitio (DFT) and MD Modeling\nYear Joined\n2007\nemail\n[email protected]\nSee Also\nDepartment of Metallurgical & Materials Engineering\nExternal links\nKoushik Biswas\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Koushik_Biswas&oldid=6348\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ME47002:_Project",
        "title": "ME47002: Project",
        "content": "ME47002\nCourse name\nProject\nOffered by\nMechanical Engineering\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ME47002:_Project&oldid=56876\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Asish_Ganguly",
        "title": "Asish Ganguly",
        "content": "Asish Ganguly\nDepartment\nMathematics\nResearch Area(s)\nMathematical & Theoretical Physics\nQuantum Mechanics\nNon-linear Evolution Equation in Real & Complex Domain\nSoliton Theory and Inverse Scattering Transformation\nYear Joined\n2010\nemail\n[email protected]\nSee Also\nDepartment of Mathematics\nExternal links\nAsish Ganguly\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Asish_Ganguly&oldid=6241\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS30099:_Resource_Economics_And_Sustainability",
        "title": "HS30099: Resource Economics And Sustainability",
        "content": "HS30099\nCourse name\nResource Economics And Sustainability\nOffered by\nHumanities & Social Sciences\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: NonePrerequisites: HS20001/HS20005Course ContentsIntroduction:\nConcepts, Classification and Problems of Natural Resource Economics; Resource\nAvailability: Allocation of Depletable and Renewable Resources; Resource\ndepletion, scarcity and irreversibility; Hotellings rule; Solow-Harwicks Rule;\nMarket structure and optimal extraction policy; Uncertainty and the rate of\nresource extraction; Resource scarcity and Technological Change; Economic\nmodels of forestry and fisheries; Extinction of species; Economics of\nBiodiversity. Economics of Mining; Economics of natural resource conservation:\nÃ¢ÂÂ Fisheries, Land, Forests, Water; Economics of Recycling and Solid Waste\nManagement; Introduction to sustainability; the relationship between income,\npoverty, economic growth, and sustainability; international trade, natural\nresources and sustainability; Sustainability indicators; Ecological footprints,\nenvironmental carrying capacity.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS30099:_Resource_Economics_And_Sustainability&oldid=16543\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE31002:_Foundation_Engineering",
        "title": "CE31002: Foundation Engineering",
        "content": "CE31002\nCourse name\nFoundation Engineering\nOffered by\nCivil Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n5\n10\n13\n21\n11\n10\n4\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nIntroduction, examples of foundation problems, site characterization, site\ninvestigation methods, in situ tests, bearing capacity - general, local and\npunching shear failure, effect of size, shape, depth and water table,\nsettlement of foundations - elastic, consolidation and total settlement; stress\ndistribution in soil, types of foundation â shallow/deep, isolated, combined,\nmat etc., contact pressure distribution, basics of design of shallow\nfoundation, deep foundation â type, load transfer mechanism in piles, pile\ncapacity, laterally loaded pile, test pile and pile load test, efficiency of\npile group, settlement of pile, stability analysis of different earth retaining\nstructures â gravity, cantilever, counterfort, reinforced earth etc, ground\nimprovement methods.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE31002:_Foundation_Engineering&oldid=25978\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA41031:_Stochastic_Processes_In_Finance",
        "title": "MA41031: Stochastic Processes In Finance",
        "content": "MA41031\nCourse name\nStochastic Processes In Finance\nOffered by\nMathematics\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n8\n19\n14\n13\n8\n3\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nDefinition and classification of stochastic processes, Poisson process, Birth\nand death process, Markov process in discrete time, random walks, gambler s\n(ruin), first return probabilities. Diffusion Processes - Brownian motion\n(introduction), Wiener process, Simulation of Brownian motion, Brownian Bridge,\nscaling symmetry, Brownian motion with drift, waiting times, geometric Brownian\nmotion, applications in financial modeling. Introduction to Martingales.\nStochastic Calculus - stochastic differential equations, stochastic integral\n(Ito s formula), applications in financial modeling.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\n[http]\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nNC334\nThursday\nNC334\nFriday\nNC334\nNC334\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA41031:_Stochastic_Processes_In_Finance&oldid=127687\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BS41005:_Computational_Biology_And_Bioinformatics",
        "title": "BS41005: Computational Biology And Bioinformatics",
        "content": "BS41005\nCourse name\nComputational Biology And Bioinformatics\nOffered by\nBio Science\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BS41005:_Computational_Biology_And_Bioinformatics&oldid=56189\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CY49008:_Advanced_Physical_Chemistry_Lab.",
        "title": "CY49008: Advanced Physical Chemistry Lab.",
        "content": "CY49008\nCourse name\nAdvanced Physical Chemistry Lab.\nOffered by\nChemistry\nCredits\n4\nL-T-P\n0-0-6\nPrevious Year Grade Distribution\n17\n18\n3\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite:Nil\nCharge transfer complex formation between anthracene and picric acid, To study\nthe formation of charge transfer complex between 1,2,4,5 Tetramethylbenzene and\nTetracyano ethylene in various solvents, Study of a oscillatory reaction by EMF\nand absorbance measurement, To study the mutarotation of D-Glucose at different\npH, Determination of partition coefficient of iodine between water and CCl4 /\nEquilibrium constant for tri-iodide formation;To study the fluorescence\nquenching of Anthracene by CCl4 in n-hexane and ethanol, Determination of\nCritical micellar concentration of Sodium Docecyl Sulphate (SDS) in water and\nin presence of salt by surface tension, conductance and stokes shift method,\nComparative study of Twisted Intramolecular Charge Transfer (TICT) of 4-N, NDimethylamineobenzoinitrile (DMABN) in different solvent by Fluorescence\nSpectroscopy, Determination of activation energy and entropy of activation for\nacid catalyzed ester hydrolysis, Swelling studies of polyelectrolyte gels in\nmedium of different pH, Synthesis and characterization of copolymer(s) of\nstyrene and methylmethacrylate by radical polymerization, Determination of\nactivation energy in the bromide-bromate clock reaction, Kinetics of salt\neffect and ionic strength (persulfate-iodine reaction), Spectroscopic\ndetermination of the size of CdS-nanoparticles; Determination of unit cell\ndimensions and density of some binary compounds of cubic systems by X Ray\ndiffraction; Determination of percent crystallinity, crystalline melting point,\nand enthalpy of melting of a crystalline polymer by combined X- Ray diffraction\n- differential scanning calorimetry; determination of order of reaction and\nactivation energy of the solid-state decomposition of CaCO3 by\nthermogravimetry, determination of pKa of phenol in the excited state using\nspectroscopic method.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CY49008:_Advanced_Physical_Chemistry_Lab.&oldid=25720\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS60021:_Organizational_Behaviour",
        "title": "HS60021: Organizational Behaviour",
        "content": "HS60021\nCourse name\nOrganizational Behaviour\nOffered by\nHumanities & Social Sciences\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: None\nCourse Objective: The course aims to provide an insight into production,\ndistribution and consumption of wealth and their interdependency. The real-life\naspects of application of economics in business and economic policy are highly\nemphasized. It provides the platform to understand the meaning, interdependence\nand determination of the equilibrium at micro and macro level. The methods and\napproach to microeconomic and macroeconomic modeling are to be stressed.\nCourse Contents:\nFundamentals of Microeconomics and Macroeconomics, Demand and Supply Analysis,\nUtility Analysis, Production Analysis and Cost Analysis\nMarket Analysis\nPublic Goods and Externalities\nAsymmetric Information\nMeasurement of Macroeconomic Variables\nIncome and Employment Determination\nNational Income Accounting\nAggregate Demand and Aggregate Supply\nDemand for Money and Supply of Money\nInflation and Deflation, Monetary and Fiscal Policies\nInvestment Analysis\nForeign Trade and Balance of Payments, Foreign Exchange and Foreign Direct\nInvestment\nSuggested Text & Reference Books:\n1.Microeconomic Theory, Henderson & Quandt, McGraw-Hill Publication.\n2.Microeconomics, Salvatore, Oxford University Press Publication.\n3.Macroeconomics, Mankiw, Thomson Learning Publication.\n4.Macroeconomics, Blanchard, PHI Publication.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS60021:_Organizational_Behaviour&oldid=15899\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA40004:_File_Organisation_And_Data_Base_Systems",
        "title": "MA40004: File Organisation And Data Base Systems",
        "content": "MA40004\nCourse name\nFile Organisation And Data Base Systems\nOffered by\nMathematics\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n1\n8\n22\n24\n26\n18\n4\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: Programming LanguagesDatabase concepts, entity relationship\nmodel, relational network and hierarchical data models. Relational database\ndesign, functional and multi-valued dependency. Normal form, data description\nlanguages, relational algebra and calculus, SQL, query facility and query\noptimization. Introduction to distributed databases implementation issues.\nStorage media and storage structure, file and index organization. Heap file,\nindexed file, B tree file, denie index, file with variable length records,\nperformance and evaluation.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA40004:_File_Organisation_And_Data_Base_Systems&oldid=25850\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ES60007:_Energy:_Policy_And_Governance",
        "title": "ES60007: Energy: Policy And Governance",
        "content": "ES60007\nCourse name\nENERGY: POLICY AND GOVERNANCE\nOffered by\nSchool of Energy Science & Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nA total number of 30 lecture hours will be covered for the entire syllabus and\n15 hour of tutorials Course Description: Energy is directly related to some of\nthe critical economic and social consideration and impacts life on earth. With\nthe rising demand to secure energy sources particularly at low prices there is\na competition for resources. Global, social, economic and environment goals of\nsustainability cannot be achieved if energy security is not achieved. The\nInternational Energy Agency forecasts that the world primary energy demand will\ngrow by 1.6 percent per year on average in 2006-2030. Rising energy needs has\nalways been a major concern in India’s growth endeavor and energy security is\ngoing to be one of the most crucial economic and strategic policy challenges\nfor India in the next few decades, especially with an additional goal of\nfollowing a low carbon growth path. With increased economic growth, changing\nlifestyle and increase in energy intensity in the economy, ensuring reliable\nand cheap supply of clean energy to the Indian economy will be a difficult\ntask. A recent report by World Economic Forum, tried to estimate the challenges\nfaced by countries to achieve energy security in a sustainable way. According\nto this study, India is ranked 98th among 124 countries in terms of providing\nenergy security and access to its citizens. To ensure an acceptable level of\nenergy consumption for everyone, the overall availability ofenergy would need\nto be increasedsubstantially.Renewable energy resources are an important\nconsideration which offer a chance for reduced carbon 4emissions, cleaner air\nand a more sustainable use of earth resources. Technology options like\ncogeneration have become more important. Energy governance plays an important\nrole in standardization. Decision trees, regulatory considerations and\nsustainability criteria help in achieving good governance in transportation\nsector and other end use sectors. There is active engagement of governments in\nadapting international policy in domestic front and developing better\nregulatory and pricing structures in the energy markets. Objective of the\nCourse: a. The course will equip students to understand the ongoing\ntechnological, policy and implementation aspects related to different forms of\nenergy used worldwide. b. A critical understanding on the development of\nnational policies and technology deployment vis a vis economics of energy. c.\nUnderstanding interdisciplinary aspects of policy and socio-economic contexts\nin energy commercialization worldwide d. Understanding factors related to\ngeopolitical stability, geographical accessibility and underdeveloped\ninternational as well as domestic energy markets Teaching- Learning\nMethodology: The method of teaching-learning such a course on Energy: Policy\nand Governance has to maximize the (1) information package (2) provide an\ninterdisciplinary focus into the multiple considerations of implementing energy\ntechnologies from a technical, policy and governance perspective. A combination\nof lectures, interactive exercises, assignments, case studies will form the\nmethod of teaching-learning. Student will learn about the different energy\n�types, their production and policy influences on energy use and development,\ngovernance and regulation. 5The course may facilitate one visit to the nearest\nenergy unit/WBREDA implementing units to enable students to practically\nunderstand related to policy support, compliance requirements and certain\naspects of energy commercialization.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nNC431\nTuesday\nWednesday\nThursday\nNC431\nFriday\nNC431\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ES60007:_Energy:_Policy_And_Governance&oldid=56564\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/List_of_Institute_Directors",
        "title": "List of Institute Directors",
        "content": "Director\nStart of Term\nEnd of Term\nProf. Damodar Acharya\nJune 2007\nJuly 2012\nProf. Partha Pratim Chakraborty\nJuly 2013\nJuly 2019\nProf. Sriman Kumar Bhattacharyya (officiating)\nJuly 2019\nPresent\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=List_of_Institute_Directors&oldid=97156\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AR52002:_Professional_Practice_And_Building_Byelaws",
        "title": "AR52002: Professional Practice And Building Byelaws",
        "content": "AR52002\nCourse name\nProfessional Practice And Building Byelaws\nOffered by\nArchitecture & Regional Planning\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n4\n8\n9\n12\n6\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nThe main purpose of providing this course is to familiarize the students about\ncurrent professional practice guidelines, codes, ethics as well as norms of\nprofessional fees and charges. It will expose them to skills and techniques for\norganizing a particular project, its preparation and execution etc. The same\ncourse will also contribute in getting acquainted with project management,\ncontractual implication as well as legal formalities.Study of development\ncontrol regulations, municipal acts, building bye-laws. Indian Standard Codes\nof Practice related to Design, drawing and procedure for submission to\nconcerned bodies. Fire prevention, safety measures and regulations.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AR52002:_Professional_Practice_And_Building_Byelaws&oldid=25919\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE60044:_Wind_Tunnel_Design_And_Testing",
        "title": "AE60044: Wind Tunnel Design And Testing",
        "content": "AE60044\nCourse name\nWIND TUNNEL DESIGN AND TESTING\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: AE60001, AE60003 Types of wind tunnels; design and operation,\nsubsonic, transonic, supersonic and hypersonic tunnels; Visualization of flow\ntufts, smoke, oil flow, shadowgraph, Schlieren system, interferometer;\nCalibration of wind tunnel; Instrumentation for testing; mechanical and\nelectronic equipments for measurement of pressure and forces; Wind tunnel\nboundary corrections for 2D and 3D testing and reduction of test data.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE60044:_Wind_Tunnel_Design_And_Testing&oldid=16248\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE69003:_Power_Electronics_And_Machine_Laboratory",
        "title": "EE69003: Power Electronics And Machine Laboratory",
        "content": "EE69003\nCourse name\nPower Electronics And Machine Laboratory\nOffered by\nElectrical Engineering\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nMachines Lab.#Power Electronics Lab.\nMachines Lab.#Power Electronics Lab.\nMachines Lab.#Power Electronics Lab.\nFriday\nMachines Lab.#Power Electronics Lab.\nMachines Lab.#Power Electronics Lab.\nMachines Lab.#Power Electronics Lab.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE69003:_Power_Electronics_And_Machine_Laboratory&oldid=56545\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS60002:_Manpower_Economics",
        "title": "HS60002: Manpower Economics",
        "content": "HS60002\nCourse name\nManpower Economics\nOffered by\nHumanities & Social Sciences\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nCourse Content\nNature and scope; Human capital formation; Employment and manpower utilization:\nsupply of and demand for labour, pricing of labour under various market forms,\nlabour unions and collective bargaining, compensating wage differentials,\nlabour market discrimination; Concepts and patterns of unemployment and\nunderemployment; Emergence of education as a work prerequisite; Returns to\ninvestment in education; Economics of training and motivation; Manpower\nplanning: quantitative and âqualitative techniquesâ Forecasting and auditing of\nmanpower; Manpower planning and total quality management; Comparative manpower\nplanning and development policies of selected countries.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS60002:_Manpower_Economics&oldid=15689\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MI40036:_Advanced_Quantitative_Decision_Making",
        "title": "MI40036: Advanced Quantitative Decision Making",
        "content": "MI40036\nCourse name\nAdvanced Quantitative Decision Making\nOffered by\nMining Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n4\n4\n12\n5\n3\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nSyllabus for QDM:\nLinear programming: concepts, graphical solutions, simplex method, primal-dual\nmodels, sensitivity analysis, transportation and assignment problems. Network\nanalysis - problems of shortest path, minimal spanning tree, maximal flow, CPM\nand PERT.\nSyllabus for AQDM:\nDynamic programming and stagecoach problem; Discrete and continuous\nprobability distributions, stochastic process and Markov chains; Basic queuing\nmodels with constant arrival and service rates; Inventory models.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MI40036:_Advanced_Quantitative_Decision_Making&oldid=102709\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/EE69004:_Machine_Drives_Laboratory",
        "title": "EE69004: Machine Drives Laboratory",
        "content": "EE69004\nCourse name\nMACHINE DRIVES LABORATORY\nOffered by\nElectrical Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n1\n2\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nDrive Concept: different machine and load characteristics, equilibrium and\nsteady state stability, four quadrant operation, referred inertia and load\ntorque for different coupling mechanism, thermal selection of machines;\nSeparately excited dc motor drive: operating limits using armature voltage\ncontrol and field control techniques, dynamic model(armature voltage control\nonly) of machine and converters (continuous conduction only), open-loop dynamic\nperformance, starting and reversal time, energy consumption, closed loop\ncontrol using single (speed) and two loops (speed, current), implementation\nusing circulating current type three phase dual converter and four quadrant\ntransistorized chopper. State feedback control and sliding mode control of\nseparately excited dc machine, modeling and control of separately excited\ndc machine in field weakening region and discontinuous converter conduction\nmode, control of dc series machine; Review of variable frequency operation of\nthree phase symmetrical induction machine: scalar control methods (constant\nvolts/Hz and airgapflux control), vector control of induction machine, methods\nof flux sensing/estimation, implementation of IRFO scheme using current\ncontrolled PWM VSI, implementation of DSFO scheme using GTO CSI, effect of\nmachine parameter variation on the performance of vector controlled induction\nmotor drive, speed sensorless control, flux observation, Direct Torque Control;\nSpeed control of wound rotor induction motors: static rotor resistance control,\nstatic scherbius drive using line commutated converter cascade, harmonics and\npower factor, vector control of wound rotor induction machine using self\ncommutated converter cascade and improvement in power factor, introduction to\nvariable speed constant frequency (VSCF) generation; Control of wound field\nsynchronous machine: constant volts/Hz control, scalar self control (commutator\nless motor), vector control; Control of permanent magnet synchronous machine:\nBrushless dc machine, surface permanent magnet machine and interior permanent\nmagnet machine control; Introduction to speed control of Switched Reluctance\nmachine.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=EE69004:_Machine_Drives_Laboratory&oldid=25560\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AG60140:_Crop_Process_Equipment_Design",
        "title": "AG60140: Crop Process Equipment Design",
        "content": "AG60140\nCourse name\nCrop Process Equipment Design\nOffered by\nAgricultural & Food Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nDesign of machine elements and their selection. Design of grains and other\ncrops processing machine components. Grain/crop processing systems design\ninvolving, conveying, elevating, cleaning, separation, conditioning/parboiling,\nmilling and mixing. Design, laying and drawing of crop processing machines and\nplants.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AG60140:_Crop_Process_Equipment_Design&oldid=16072\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE61026:_Hypersonic_Aerodynamics",
        "title": "AE61026: Hypersonic Aerodynamics",
        "content": "AE61026\nCourse name\nHYPERSONIC AERODYNAMICS\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: AE60003 Hypersonic flow: thin shock layers, entropy layers,\nviscous interaction, high-temperature and low-density flow; hypersonic shock\nand expansion wave relations and similarity parameter, Newtonian and modified\nNewtonian flow, local surface inclination methods, hypersonic inviscid flow:\napproximate and exact methods of solution; viscous hypersonic flow and\nhypersonic boundary layers, aerodynamic heating, hypersonic shock/boundary\nlayer interaction; high-temperature flow and chemical effects in air,\nthermodynamics of chemically reacting gases, concepts of equilibrium and\nnonequilibrium flows and governing equations.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE61026:_Hypersonic_Aerodynamics&oldid=18178\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS60031:_Social_Aspects_Of_Human_Settlements",
        "title": "HS60031: Social Aspects Of Human Settlements",
        "content": "HS60031\nCourse name\nSOCIAL ASPECTS OF HUMAN SETTLEMENTS\nOffered by\nHumanities & Social Sciences\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nRural-urban continuum, dichotomy: Physical and social settings, concept of\nlittle community, peasant society and industrial society, resources â\nproduction system and productions relation; relationship of town and village\ntoday.\nDynamics of rural society: Institutions, leadership, changing power structure\nwith special reference to Panchayati Raj system.\nUrbanization and urban living: trends in urbanization and urban development;\nmigration, population growth and its impact (social and physical); policies of\nurban development.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS60031:_Social_Aspects_Of_Human_Settlements&oldid=15802\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BM60057:_Marketing_Strategy",
        "title": "BM60057: Marketing Strategy",
        "content": "BM60057\nCourse name\nMarketing Strategy\nOffered by\nVinod Gupta School of Management\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BM60057:_Marketing_Strategy&oldid=56159\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Kharagpur_Linux_Users_Group",
        "title": "Kharagpur Linux Users Group",
        "content": "Kharagpur Linux Users Group\nis a informal discussion group for people who are enthusiastic about software development, technology and open source in general. KLUG meetings are traditionally held on Fridays at\nInsti Foyer\nor\nBC Roy Hall\n's canteen.\nHistory\nThe earliest known Linux Users Group at KGP was started back in 2004,\n[\n1\n]\nthough a thread on their Yahoo group suggests that there used be a LUG even before 2004.\n[\n2\n]\nThey held few informal meetings and a install fest.\n[\n3\n]\nThe group, however, died out by the end of academic year in 2007.\n[\n4\n]\nRamkumar Ramachandra mentioned about another Linux Users group which used to exist between 2006 and 2008.\n[\n5\n]\nKGP: KGP Group of Programmers (a recursive acronym) which came up in 2009\n[\n6\n]\n[\n7\n]\nwas also an attempt to build a programmer's community in KGP that group too died out. The current form of KLUG was formed by Ramkumar Ramachandra (PH '12), Sanjoy Das (MA '13) and Anurag Priyam (ME '13) in 2011.\nStructure and Functioning\nThe discussion at KLUG typically do not have a fixed agenda. People start off by discussing different projects they have been working on but often conversations diverge to very diverse topics including anything from history, privacy and copyright laws, economics to philosophy. KLUG follows a flat hierarchy and an system of open membership. Open membership implies that anyone is free and welcomed to attend the discussion. New members are usually asked to introduce themselves to the group.\nImportant minutes of the meetings or meetup notices are posted to the\nKLUG's google group\n, which is open for anyone are join. KLUG has recently moved to slack channel for real time communication and hangout in place of IRC channel #klug-devel on freenode. A public log of all the communication on previous channel can be found\nhere\n.\nPeople interested in joining KLUG's slack channel use the self invite link\nhttp://klug-slack.herokuapp.com/.\nReferences\n↑\n\"Announcement of LUG@IITKGP\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"Why don't we have a LUG at KGP?\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"Summary of the workshop\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"Messing History\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"Ram's answer on \"Why isn't there any Programming Club in KGP?\n\"\n\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"Sanket Agarwa's Blog about KGP\"\n. Retrieved\n17 September\n2015\n.\n↑\n\"KGP-Django-website\"\n. Retrieved\n17 September\n2015\n.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Kharagpur_Linux_Users_Group&oldid=16876\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/RR69091:_Railway_Engineering_Laboratory_-_I",
        "title": "RR69091: Railway Engineering Laboratory - I",
        "content": "RR69091\nCourse name\nRailway Engineering Laboratory - I\nOffered by\nCivil Engineering\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=RR69091:_Railway_Engineering_Laboratory_-_I&oldid=56306\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Debasis_Roy",
        "title": "Debasis Roy",
        "content": "Debasis Roy\nDepartment\nCivil Engineering\nResearch Area(s)\nGeotechnical Earthquake Engineering\nGround Improvement\nInsitu testing of Geomaterials\nYear Joined\n2002\nemail\n[email protected]\nSee Also\nDepartment of Civil Engineering\nExternal links\nDebasis Roy\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Debasis_Roy&oldid=6190\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AR60003:_Transportation_Planning_And_Traffic_Engineering",
        "title": "AR60003: Transportation Planning And Traffic Engineering",
        "content": "AR60003\nCourse name\nTransportation Planning And Traffic Engineering\nOffered by\nArchitecture & Regional Planning\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nTransportation systems; technological characteristics of transport modes and\nsystems; the nature of demand and supply of transport services; the spatial\nstructure vis-ÃÂ -vis the level and quality of transport supply systems. Land\nuse-transportation inter-relationships; transportation planning process; Travel\ndemand forecasting. Planning of public transport systems; intermediate public\ntransport modes; Planning considerations for goods transportation; Traffic flow\ncharacteristics; Traffic analyses and design considerations; design of\nintersections; traffic signals and street lighting; local area traffic\nmanagement. Recent innovations in technologies and its probable impacts on\nfuture urban forms. Environmental impacts of traffic; energy issues in\ntransportation; transportation safety. Government transport policies and\nevaluation of transportation proposals.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nIn Dept\nIn Dept\nTuesday\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AR60003:_Transportation_Planning_And_Traffic_Engineering&oldid=56134\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/PH49006:_Electromagnetism",
        "title": "PH49006: Electromagnetism",
        "content": "PH49006\nCourse name\nELECTROMAGNETISM\nOffered by\nPhysics\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n15\n23\n2\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\n1. (a) Fabry-Perot interferometer with sodium light source.\n(b) Fabry-Perot\ninterferometer with laser light.2. (a) Michelson s interferometer with sodium\nlight source.\n(b) Michelson s interferometer with laser light.3. Laser\ndiffraction.4. Polarization of laser light (elliptically, circularly and plane\npolarised).5. Magnetostriction in a metallic rod using Michelson\ninterferometry.6. Study of Biot-Savart s law.7. Study of a Helmholtz coil.8.\nCollision simulator.9. Space-time simulation.10. B-H loop tracer to study\nferromagnetism in different materials.11. (a) Hall effect study of a p-type\nsemiconductor.\n(b) Hall effect study of a n-type semiconductor with a\nPCinterfacing.12. DIelectric constant, feroelectric Curie temperature (T_c)\nstudy of BaTiO3 perovskite oxide.13. Photoconductivity study of a\nsemiconducting film.14. Study of solar cell characteristics.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=PH49006:_Electromagnetism&oldid=25904\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MS61005:_Science_And_Technology_Of_Polymers",
        "title": "MS61005: Science And Technology Of Polymers",
        "content": "MS61005\nCourse name\nScience And Technology Of Polymers\nOffered by\nMaterials Science Centre\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nIn Dept\nThursday\nIn Dept\nFriday\nIn Dept\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MS61005:_Science_And_Technology_Of_Polymers&oldid=57019\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Civil_Services_Club",
        "title": "Civil Services Club",
        "content": "Civil Services Club, IIT Kharagpur is now\nPublic Policy and Governance Society, IIT Kharagpur.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Civil_Services_Club&oldid=238184\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS31082:_Monetary_Economics",
        "title": "HS31082: Monetary Economics",
        "content": "HS31082\nCourse name\nMonetary Economics\nOffered by\nHumanities & Social Sciences\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n2\n14\n14\n10\n3\n4\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: HS20007Course ContentsEvolution of Money; Money and its\nFunctions; Money in the Economy (General Equilibrium Analysis): Money and other\nGoods in the Economy, User cost of Money, Neutrality and Super Neutrality of\nMoney; Money and Prices: Quantity Theory of Money, Wicksell s Pure Credit\nEconomy, Keynesian Demand for Money, Friedman s Restatement of Quantity Theory\nof Money; Demand For Money: Inventory Demand for Money, Portfolio Selection and\nSpeculative Demand for Money, Precautionary and Buffer Stock Demand for Money,\nEstimation of Money Demand Function; supply of Money and Central Banking:\nMonetary Transmission Mechanism; Overlapping Generation Models of Money.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS31082:_Monetary_Economics&oldid=25638\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AG69041:_Food_Chemistry_%26_Microbiology_Lab.",
        "title": "AG69041: Food Chemistry & Microbiology Lab.",
        "content": "AG69041\nCourse name\nFood Chemistry & Microbiology Lab.\nOffered by\nAgricultural and Food Engineering\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nIn Dept\nIn Dept\nIn Dept\nFriday\nIn Dept\nIn Dept\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AG69041:_Food_Chemistry_%26_Microbiology_Lab.&oldid=56098\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BT39001:_Analytical_Biochemistry_Laboratory",
        "title": "BT39001: Analytical Biochemistry Laboratory",
        "content": "BT39001\nCourse name\nANALYTICAL BIOCHEMISTRY LABORATORY\nOffered by\nBiotechnology\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n7\n27\n5\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nVisible, UV and Fluorescence spectroscopy; High performance thin layer\nchromatography, High performance liquid chromatography, Fast protein liquid\nchromatography, Gas chromatography, Poly acrylamide gel electrophoresis\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nIn Dept\nIn Dept\nIn Dept\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BT39001:_Analytical_Biochemistry_Laboratory&oldid=56202\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CY31003:_Organic_Chemistry_Iii",
        "title": "CY31003: Organic Chemistry Iii",
        "content": "CY31003\nCourse name\nOrganic Chemistry Iii\nOffered by\nChemistry\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\n8\n7\n7\n4\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite : CY21006Addition/elimination reactions of carboxylic acid\nderivatives: Grignard reagents and related nucleophiles, base- and acidcatalyzed reactions (different types of saponification mechanism), Lossen-,\nCurtius- and Wolff rearrangement.Other reactive intermediates, their\nreactivity and reactions: Generation, addition- and insertion reactions of\ncarbenes and nitrenes, generation and Wittig reactions of phosphorous ylides,\ngeneration and reactions with carbonyl and Ã¯ÂÂ¡,Ã¯ÂÂ¢-unsaturated carbonyl\ncompounds of sulfur ylides, generation of radicals and different types of\nreactions.Synthesis and reactions of quinolines and indoles.Important oxidative\nand reductive reactions: Alkenes to epoxides and dihydroxy compounds; Alcohols\nto carbonyl compounds ( e.g. K2Cr2O7, PCC, PDC, Jones-, Swern-, Dess-Martin\noxidation); Carbonyls to alcohols,; Issue of chemoselectivityPericyclic\nreactions (10 lectures): Theory and applications of electrocyclic reactions (4n\nand 4n 2 electrons systems), Woodward-Hoffman rules, FMO mechanism, Diels-Alder\nreactions- FMO mechanism for endo- and exo-selectivity, stereochemistry, interand intramolecular reactions. Sigmatropic rearrangement- types of reactions,\nClaisen- and Cope rearrangements, FMO mechanism, stereochemical implications,\n[2 2]-cycloadditions and 1,3-dipolar cycloadditions.BooksOrganic Chemistry by\nClayden, Greeves, Warren and WothersName Reactions by Jie Jack Li\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nC306\nTuesday\nC306\nC306\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CY31003:_Organic_Chemistry_Iii&oldid=56418\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MT61136:_Advanced_Materials_And_Processes",
        "title": "MT61136: Advanced Materials And Processes",
        "content": "MT61136\nCourse name\nAdvanced Materials And Processes\nOffered by\nMetallurgical & Materials Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n3\n6\n4\n6\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nAdvanced Al Alloys: High temperature and high strength Al alloys such as Al-FeV-Si, nanocrystalline Al alloys, etc.; Ti based Alloys: Advances in Ti based\nAlloys; Superalloys: Ni base and Co base superalloys; Shape Memory Alloys:\nphysical metallurgy, properties, etc.; Advanced Composites: in situ\ncomposistes, nanocomposites, etc.; Intermetallics; Aluminides, Silicides,\nborides, Nitrides and Carbides.; Nanocrystalline Materials: Synthesis,\nStructure and Properties.: Amorphous Materials; Metallic glasses, Glass forming\nability, Thermodynamics and kinetics of glass formation, Bulk Metallic Glasses,\nProperties; Quasicrystalline Materials; Structure, Synthesis, Properties;\nAdvanced Processes: Rapid solidification processing, Laser surface\nModification, Mechanical Alloying, Rapid prototgypeing, Self propagating High\ntemperature synthesis, inert gas condensation etc.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MT61136:_Advanced_Materials_And_Processes&oldid=25883\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IM39006:_Simulation_Lab.",
        "title": "IM39006: Simulation Lab.",
        "content": "IM39006\nCourse name\nSIMULATION LAB.\nOffered by\nIndustrial & Systems Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n9\n27\n9\n3\n3\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: IM21003 Operations Research-ILaboratory: Development and testing\nof simulation models for IE functional systems. Use of discrete and continuous\nsimulation packages. Design, fabrication and experiment with simulators for\nskill, design, development and experiment with Simulation Games.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IM39006:_Simulation_Lab.&oldid=25489\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Achintya_Dhar",
        "title": "Achintya Dhar",
        "content": "Achintya Dhar\nDepartment\nPhysics\nResearch Area(s)\nOrganic Semiconductors\nSemiconductor Nanostructures\nHeterostructure Devices\nOrganic Solar Cells\nYear Joined\n1994\nemail\n[email protected]\nSee Also\nDepartment of Physics\nExternal links\nAchintya Dhar\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Achintya_Dhar&oldid=6421\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/PH60112:_Ferroelectrics_And_Dielectrics",
        "title": "PH60112: Ferroelectrics And Dielectrics",
        "content": "PH60112\nCourse name\nFerroelectrics And Dielectrics\nOffered by\nPhysics\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nLinear and non-linear dielectric, piezo-, pyro- and ferroelectric crystals;\nstructural phase transition. Dipole and thermodynamical theory of orderdisorder and displacive type of phase transition. Structural, dielectric,\nelectrical, spectroscopic and optical properties of ferroelectrics.\nFerroelectric devices. Electro-optic modulator, light valves, pyroelectric\ndetectors, transducers, computer memory and display devices, non-volatile\ndevices.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=PH60112:_Ferroelectrics_And_Dielectrics&oldid=16065\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BT31011:_Environmental_Biotechnology",
        "title": "BT31011: Environmental Biotechnology",
        "content": "BT31011\nCourse name\nEnvironmental Biotechnology\nOffered by\nBiotechnology\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n2\n5\n11\n11\n9\n6\n5\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to environmental biotechnology, definitions and facts. Overview of\nmicrobial transformations. Environmental monitoring: bioreporter, biomarker and\nbiosensor technology. Metagenomics/environmental genomics. Bioprospecting.\nBiomicroelectronics and Nanobiotechnology. Bioremediation of inorganic (metal,\nradionuclide, nitrate, phosphate) and organic pollutants. In situ and ex situ\nremediation strategies. Biotechnology of sewage treatment. Clean technologies:\nbiofertilizers, biopesticides, microbial polymer production and bio plastic\ntechnology. Biotechnology of fossil fuels: desulfurization of coal, oil shales,\nmicrobial enhanced oil recovery (MEOR). Biofuels: biogas, biohydrogen,\nbioethahnol production. Biotechnology of mineral processing. Ethical issues in\nenvironmental biotechnology.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nIn Dept\nThursday\nIn Dept\nFriday\nIn Dept\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BT31011:_Environmental_Biotechnology&oldid=56201\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ES61002:_Solar_Photovoltaic_Technologies_And_Systems",
        "title": "ES61002: Solar Photovoltaic Technologies And Systems",
        "content": "ES61002\nCourse name\nSOLAR PHOTOVOLTAIC TECHNOLOGIES AND SYSTEMS\nOffered by\nSchool of Energy Science & Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n4\n2\n1\n3\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nI.Objectives and contentsa) Objectives : To provide the background for\nconducting research in the field of solarphotovoltic.b) Contents (in 100 to 150\nwords) : SyllabusRenewable energy technologies, solar radiation and its\ncharacteristics,radiation estimation and energy output prediction.Manufacturing\nof solar cells: Basics of functioning of solar cells, firstgeneration solar\ncells, p-n junction solar cells. Polycrystalline andamorphous silicon solar\ncells. Second generation solar cells.Manufacturing of thin film, CdTe and CIGS\nsolar cells. Thirdgeneration solar cells. Overview of a variety of third\ngeneration solarcells, manufacturing of dye sensitized and quantum dot\nsensitizedsolar cells. Nano-structured solar cells. Concentrating PV\nsystems.Measurement and analysis of solar cells. Efficiency, IV\nmeasurements,Cell temperature effect, IPCE measurement. Reliability standards\nandreliability testing methods. Reliability Modeling.PV Systems. PV modules and\narray, Shading impact, bypass diode,blocking diode. Required equipments for PV\nsystems: battery,inverter, MPPT, sun tracker, charge controllers. Applications\nof PVsystems: Direct coupled, grid connected, stand-alone or hybridsystems.\nDesign of PV System: Load characteristics, effect oftracking. Sizing of systems\nfor grid connected, water pumping andstand-alone systems. System\neconomics.(Please attach the detailed lecture-wise breakupand/or list of\nexperiments)II.Recommended Text Books : 1. Renewable energy resources. J.\nTwidell and T. Weir, Taylor andFrancis (1986).2. Renewable and efficient\nelectric power systems. G.M. Masters, JohnWiley and Sons (2004).3. Renewable\nenergy sources and Emerging technology. D.P. Kothari,K.C.Singal and R. Ranjan,\nPrantice Hall (2011).4. Renewable energy engineering and Technology. Ed. VV N\nKishore,TERI (2008).5. Handbook of Photovoltaic Science and Engineering, Ed.\nAntonioLuque and Steven Hegedus, John Wiley and Sons (2011).6. Nanostructured\nmaterials for solar energy conversion. Ed. TetsuaSoga, Elsevier, (2006).10.\nReference Books : Latest materials from journals\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ES61002:_Solar_Photovoltaic_Technologies_And_Systems&oldid=26061\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS50012:_Energy_Economics",
        "title": "HS50012: Energy Economics",
        "content": "HS50012\nCourse name\nEnergy Economics\nOffered by\nHumanities & Social Sciences\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: HS20005/HS20001Course ContentsIntroduction: Energy and\nEconomics; Externalities, Economic Growth and Environment; Energy Efficiency;\nEconomic Theory of Natural Resource Extraction; Economic tradeoffs on energy,\nenvironment, other economic issues; Public goods and common resources;\nSustainable energy; Market equilibrium for energy resources; Energy Utility and\nRegulations; Energy Issues in India.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS50012:_Energy_Economics&oldid=16270\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IP63101:_Constitutional_Law_Of_India",
        "title": "IP63101: Constitutional Law Of India",
        "content": "IP63101\nCourse name\nCONSTITUTIONAL LAW OF INDIA\nOffered by\nRajiv Gandhi School of Intellectual Property Law\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConstitution- what it means; what is Preamble, Constitutional keys, Fundamental\nRights, relation with Directive Principles and Fundamental Duties, Right to\nequality: privatisation and its impact on affirmative action; Empowerment of\nwomen.; Freedom of press and challenges of new scientific development; Emerging\nregime of new rights and remedies; Right of minorities to establish and\nadminister educational institutions and state; Secularism and religious\nfanaticism; Separation of powers: stresses and strain; Democratic process;\nSocial and Economic RightsFederalism-Essentials, Creation of new statesAllocation and share of resources - distribution of grants in aid-The interstate disputes on resources; Rehabilitation of internally displaced persons.Centres responsibility and internal disturbance within States.-- Directions of\nthe Centre to the State under Article 356 and 365-Federal Comity : Relationship\nof trust and faith between Centre and State- relationship in sphere of planning\nand development; Special status of certain States- Tribal Areas, Scheduled\nAreas; State : Need for widening the definition in the wake of liberalization;\nRight to Constitutional remedies, Amendments of the\nConstitution.Reference:1.Duncan Derret, The State, Religion and Law in India\n(1999), Oxford University Press.2.H.M. Seervai, Constitutional Law of India\n(1996), Tripathi.3.D.D. Basu, Shorter Constitution of India (1996), Prentice Hall of India (P) Ltd.4.M.P. Jain, Indian Constitutional Law (1994), Wadhwa.5.K\nC Wheare, Federal Government, (1963) Oxford University Press.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IP63101:_Constitutional_Law_Of_India&oldid=56786\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IP60101:_Jurisprudence_(legal_Methods,_Indian_Legal_System_And_Basic_Theory_Of_Law)",
        "title": "IP60101: Jurisprudence (legal Methods, Indian Legal System And Basic Theory Of Law)",
        "content": "IP60101\nCourse name\nJurisprudence (legal Methods, Indian Legal System And Basic Theory Of Law)\nOffered by\nRajiv Gandhi School of Intellectual Property Law\nCredits\n4\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IP60101:_Jurisprudence_(legal_Methods,_Indian_Legal_System_And_Basic_Theory_Of_Law)&oldid=56764\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/BM61011:_Statistical_Methods_For_Management",
        "title": "BM61011: Statistical Methods For Management",
        "content": "BM61011\nCourse name\nStatistical Methods For Management\nOffered by\nVinod Gupta School of Management\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=BM61011:_Statistical_Methods_For_Management&oldid=56168\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MM61317:_Biological_Physics",
        "title": "MM61317: Biological Physics",
        "content": "MM61317\nCourse name\nBiological Physics\nOffered by\nSchool of Medical Science and Technology\nCredits\n3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nIn Dept\nThursday\nIn Dept\nFriday\nIn Dept\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MM61317:_Biological_Physics&oldid=56992\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CY61050:_Metal_Complexes_In_Catalysis_And_Material_Science",
        "title": "CY61050: Metal Complexes In Catalysis And Material Science",
        "content": "CY61050\nCourse name\nMetal Complexes In Catalysis And Material Science\nOffered by\nChemistry\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n8\n8\n12\n2\n4\n9\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nCatalytic Reactions and the 16/18 VE Rule; Transition metal assisted valence\nisomerizations; Isomerization of unsaturated molecules; Arylation/vinylation of\nolefins; Alkene and Alkyne metathesis; Oligomerization and Polymerization;\nOlefin oxidation; Hydrogenation of alkenes; Fischer-Tropsch reactions; The\nwater- gas shift reactions; Carbonylation Reactions; Hydroformylation;\nHydrocyanation; Activation of C-H bonds in alkanes; Hydrosilylation and\nHydroboration Reactions; Oxygen transfer reactions. Review of Basic concepts of\nligand dissociation, substitution, and elimination reactions. Organometallics\nin electronic and optoelectronic applications. Chemical Vapor Deposition\n(MOCVD) leading to metal carbides, metal nitrides, metal borides, metal oxides,\nmetal chalcogenides, semi-conductors, metal films. Organometallic chemistry\nrelated molecular material.Books: Homogeneous Catalysis by Sumit Bhaduri\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CY61050:_Metal_Complexes_In_Catalysis_And_Material_Science&oldid=25825\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Soumen_Das",
        "title": "Soumen Das",
        "content": "Soumen Das\nDepartment\nMedical Science & Technology\nResearch Area(s)\nMicrosystem Technology\nMEMS BIOMEMS and Microfluidic devices\nElectro-physiological characterisation of biospecies\nMedical electronics\nYear Joined\n1996\nemail\n[email protected]\nSee Also\nDepartment of Medical Science & Technology\nExternal links\nSoumen Das\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Soumen_Das&oldid=6371\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/IM69004:_Information_Systems_Project",
        "title": "IM69004: Information Systems Project",
        "content": "IM69004\nCourse name\nINFORMATION SYSTEMS PROJECT\nOffered by\nIndustrial & Systems Engineering\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nLearning through projects on some aspects of Management Information System,\nDecision Support System, or Executive Information System with the help of a\nreal-life case study.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=IM69004:_Information_Systems_Project&oldid=15474\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA39011:_Object_Oriented_Systems_Design_Laboratory",
        "title": "MA39011: Object Oriented Systems Design Laboratory",
        "content": "MA39011\nCourse name\nOBJECT ORIENTED SYSTEMS DESIGN LABORATORY\nOffered by\nMathematics\nCredits\n2\nL-T-P\n0-0-3\nPrevious Year Grade Distribution\n19\n28\n6\nEX\nA\nB\nC\nD\nP\nF\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite: Object Oriented Systems Design Implementation of : exercises on\nObjects, Classes, Static and dynamic modeling, JAVA, UML; client server and\ndistributed objects, client server implementation; CORBA, COM/DCOM.\nConcepts taught in class\nStudent Opinion\nAutumn 2016\nTaught by\nDharmendra Kumar Gupta\nFirst thing, he would ask you to implement NQueens problem in object-oriented programing paradigm, then Intelligent Interactive Kitchen Helper after which a tourist portal for your city. In total, teaches you next to nothing but expects you to code everything (The theory classes are in C++ but you are expected to code in JAVA).\nEnd evaluation would be based on printed codes of the programs and would deduce marks on a malformed index. Would ask you to create diagrams of class structure (though this is actually a good thing to learn, maybe this is the only takeaway from the course). In the viva, would ask you random questions. No one got EX, two-three students got A. But the lab is peaceful, there is not much load.\nNishnik\n(\ntalk\n)\nHow to Crack the Paper\nClassroom resources\nSample repositories:\nabhinavjain241/IIKH\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nThursday\nFriday\nPC_lab-II\nPC_lab-II\nPC_lab-II\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA39011:_Object_Oriented_Systems_Design_Laboratory&oldid=56816\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Scrummys",
        "title": "Scrummys",
        "content": "Scrummy's\nLoading map...\nCategory\nFood and Beverages\nLocation\nNear Dominos\nCuisines\nVeg/Non-veg, Indian, Chinese\nClosed on\n-\n[\nunverified\n]\nTimings\n11AM to 11PM\n[\nunverified\n]\nRoom Delivery\nYes\n[\n1\n]\nRestricted to\nNone\n[\n1\n]\nSeating capacity\n15\n[\n1\n]\nContact\n09800446503\nHistory\nFacilities and cuisines\nMenu\nItalian, Cocktails\nSpecial occasions\nSee also\nReferences\n↑\n1.0\n1.1\n1.2\nVerified\nby\nAngry Bitch\non 2015-04-05.\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Scrummys&oldid=17518\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE40004:_Advanced_Structural_Dynamics",
        "title": "AE40004: Advanced Structural Dynamics",
        "content": "AE40004\nCourse name\nAdvanced Structural Dynamics\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: AE31002\n3 - 0 - 0: 3 CreditsIntroduction, variational\ncalculus, Hamilton s principle, Lagrange equation, Holzer, Myklestad method,\nvibrating string, standing wave and traveling wave solution, normal coordinates, orthogonality conditions, vibration beams (special problem),\nTimoshenko beams, longitudinal vibrations, parametric instability of\nstructures.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE40004:_Advanced_Structural_Dynamics&oldid=26157\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/ME60300:_Introduction_To_Human_Body_Mechanics",
        "title": "ME60300: Introduction To Human Body Mechanics",
        "content": "ME60300\nCourse name\nIntroduction To Human Body Mechanics\nOffered by\nMechanical Engineering\nCredits\n3\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nIntroduction to Human Body MechanicsPrerequisite ; Mechanics\n(Fluid Mechanics\nor Thermo-fluid Sc.)Basic terminology and concept of human musculoskeletal\nsystem, anatomy and overall function. Biomechanics of Tissues and Structures â\ncomposition, structure and biomechanical behaviour: Bone and Muscle.\nBiomechanics of Joints â Hip, Knee, Shoulder. Fundamental aspects of Joint\nReplacement; Bone Remodelling. Introduction to Bio-Thermal-Fluid Sciences,\nFundamental equations of conservation, Constitutive relationships,\nViscoelasticity, Blood rheology, Mechanics of blood cells, Blood flow analysis,\nBioviscoelastic fluids, Fluid mechanics of circulatory systems.Books:(1)Basic\nBiomechanics of the Musculoskeletal System (3rd edition), by M. Nordin and\nV.H. Frankel, Publisher: LWW, ISBN: 0-683-30247-7.(2)Biomechanics by Y. C.\nFung, Springer (2nd Edition), ISBN 978-81-8128-811-0.(3)An Introduction to\nBiomechanics, by J.D. Humphery and S.L. Delange, Publisher: Springer, ISBN 97881-8128-719-9.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=ME60300:_Introduction_To_Human_Body_Mechanics&oldid=16404\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/HS30090:_Agricultural_Economics",
        "title": "HS30090: Agricultural Economics",
        "content": "HS30090\nCourse name\nAgricultural Economics\nOffered by\nHumanities & Social Sciences\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nPrerequisites: None Course ContentsEconomics of Agricultural Production:\nTheoretical Foundation-Physical Relationships-The factor-Product Relationship,\nThe Factor-Factor Relationship, The Product-Product Relationship; Economic\nRelationships-The Economic Optimum; Economics of Input Substitution; Economics\nof Product Substitution; Agricultural Cost Relationships; Supply Behaviour;\nRisk attitudes in agriculture, Optimization under Risk and Uncertainty.\nMeasurement of Technological Change, Decomposition Analysis, Farm Size and\nProductivity; Total Factor Productivity. Agricultural Marketing: Marketable and\nMarketed surplus; Market Equilibrium, Product and Input Price, Perfect and\nImperfect Competitions; Market Efficiency, Cost and Price Spread, Agricultural\nTrade and WTO; Agriculture in India: Contribution to GDP, Plan Outlay for\nAgriculture, Rural Credit Structure, Multi-agency Approach to Rural Credit,\nCredit Supply and Gap; Subsidy, Technology, and Market.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=HS30090:_Agricultural_Economics&oldid=16546\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/RT69001:_Seminar-i",
        "title": "RT69001: Seminar-i",
        "content": "RT69001\nCourse name\nSeminar-i\nOffered by\nRubber Technology\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nIn Dept\nIn Dept\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=RT69001:_Seminar-i&oldid=57179\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AR22006:_History_Of_Architecture-Ii",
        "title": "AR22006: History Of Architecture-Ii",
        "content": "AR22006\nCourse name\nHistory Of Architecture-Ii\nOffered by\nArchitecture & Regional Planning\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n10\n13\n12\n1\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nAn overview of Egyptian and West Asiatic architecture, their social and\ncultural belief and reflection of it in their building and built environment.\nContinuation of building processes from west Asiatic to Greek and Roman\ncivilization. Methods of construction of arches, vaults and domes in bricks and\nconcrete in these periods. Further development in construction technologies and\nspace planning in Byzantine and Romanesque period. Evolution of Gothic forms how it influenced later development of modern architecture, european\nrenaissance and revival of classicism in architecture. Birth of neo-classical\nand eclectic architecture prior to industrial revolution.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AR22006:_History_Of_Architecture-Ii&oldid=25626\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/AE31006:_Computer_Application_In_Aero._Engineering",
        "title": "AE31006: Computer Application In Aero. Engineering",
        "content": "AE31006\nCourse name\nComputer Application In Aero. Engineering\nOffered by\nAerospace Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n7\n15\n15\n6\n10\n2\nEX\nA\nB\nC\nD\nP\nF\nSemester\nSpring\nSyllabus\nSyllabus mentioned in ERP\nNumerical solutions of linear and non-linear algebraic equations, ordinary\ndifferential equations and partial differential equations; conceptual data\nmodels, methods of organizing, storing and retrieving data, data structures;\nElements of modern artificial intelligence (AI) related techniques;\nintroduction to Genetic Algorithms and Artificial Neural Nets; Examples related\nto Aerospace Engineering.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=AE31006:_Computer_Application_In_Aero._Engineering&oldid=25816\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MA61014:_Advanced_Programming_Techniques",
        "title": "MA61014: Advanced Programming Techniques",
        "content": "MA61014\nCourse name\nAdvanced Programming Techniques\nOffered by\nMathematics\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite : Programming LanguagesStack and queues, Linked list, Direct\naddress tables, Indexing, hash tables, open addressing, trees, Binary search\ntree, height balanced tree, Red-black tree, B-tree. Basic concepts of\nalgorithms, Models of computation, top-down structured programming, algorithm\ndesign methods, analysis of algorithms, graph theoretic and combinatorial\nalgorithms, matrix multiplication, integer arithmetic and polynomial evaluation\nalgorithms.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MA61014:_Advanced_Programming_Techniques&oldid=14683\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/MT31009:_Mechanical_Working_Of_Materials",
        "title": "MT31009: Mechanical Working Of Materials",
        "content": "MT31009\nCourse name\nMechanical Working Of Materials\nOffered by\nMetallurgical & Materials Engineering\nCredits\n3\nL-T-P\n3-0-0\nPrevious Year Grade Distribution\n7\n15\n13\n4\n6\n3\n1\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\nPrerequisite Ã¢ÂÂ NilFundamentals of metal working: Classification of forming\nprocesses, mechanics of metal working, temperature and strain rate effects,\ninstability and flow localization, shear banding, workability, microstructure\nand texture evolution, friction and lubrication, residual stress. Forging:\nClosed-die and open-die forging, forging equipment, mechanics. Rolling:\nTerminology of rolled products, different kinds of rolling mills, forces and\ngeometric relationships, variables affecting roll pressure, power and friction\nhill, theories of cold and hot rolling, roll pass design.Extrusion: Direct and\nindirect extrusion, impact extrusion, hydrostatic extrusion, equipment,\nextrusion variables, extrusion pressure. Wire and Tube drawing: Processes and\nequipments, hydrodynamic lubrication, draw stress, factors affecting draw\nstress and reduction.Sheet metal forming: Different forming methods, forming\nlimit criteriaNon-conventional methods: Powder performs forging, superplastic\nforming, high energy rate forming, mushy state forming, forming of plastics.\nAnalysis of defects in products of all metal forming processes.Text Books:\n1.G.E. Dieter: Mechanical metallurgy, McGraw Hill Book Company, New Delhi,\n1986.2.J.N. Harris: Mechanical Working of Metals- Theory and Practice, Pergamon\nPress, Oxford, 1\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nMT ANNEX-3\nMT ANNEX-3\nTuesday\nMT ANNEX-3\nWednesday\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=MT31009:_Mechanical_Working_Of_Materials&oldid=57030\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/TSA",
        "title": "The Scholars' Avenue",
        "content": "The Scholars’ Avenue\nis the independent student-run campus newspaper of the Indian Institute of Technology, Kharagpur.\nThis article is about the society named \"The Scholars' Avenue\".  For information about the road named Scholars' Avenue, see\nScholars' Avenue\n.\nThe Scholars' Avenue\nForthrightly yours, fortnightly yours\nActivities\nCampus Media Body\nFounded\n2005\nFounder(s)\nAmit Gupta\nPuneet Agarwal\nSandeep Rath\nNumber of members\n52\nWebsite\nwww\n.scholarsavenue\n.org\nUnder\nTSG\nNo\nReferences:\n[\n1\n]\nAbout\nThe Scholars’ Avenue (TSA or ScholsAve) is the independent student-run campus newspaper of the Indian Institute of Technology, Kharagpur. Founded in 2005, copies of\nThe Scholars’ Avenue\nwere initially delivered to all the students on campus, with soft copies being mailed to the faculty and several thousand alumni all over the world.\nEach of the issues is a juxtaposition of the informational, the technical and the creative. ScholsAve reports campus events and happenings, functions as a public interface between students and the administration, summarizes technical advancements taking shape on campus and not the least, prints the funnies. Its pieces include:\nEditorials\n: The editors’ take on the successive issues that have affected IIT Kharagpur’s campus.\nInterviews\n: Interviews with luminaries such as Nawazuddin Siddiqui, Kris Gopalakrishnan, Prahlad Kakkar, KK, Pandit Hariprasad Chaurasia et al.\nGuest Articles\n: Featured articles from guests.\nCareers Avenue\n: A stab at increasing the horizons of the readers.\nTech Avenue\n: On-campus technical advancements in the spotlight.\nBhaat Avenue\n: Browse through our biweekly dose of humour.\nThe team is drawn entirely from the students of the institute and acts as the voice of the student community by reporting on events relevant to campus. TSA is also a non-profit organization independent of the administration of IIT Kharagpur and is supported by sponsorships and donations.\nEarly Days\n\"There have always been dreamers; because in our dreams we see not what is, but what can be. There have always been doers; because through our efforts, we make what-can-be what-is. This is how things become possible. This is how the quality of our life improves. Because we dream. Because we do. - Daewoo Motors\"\nThe Scholars' Avenue (TSA or ScholsAve) was borne out of one such dream. A dream to give IIT Kharagpur its own newspaper that would act as litmus for the mood on campus and provide a medium that students could capitalise to voice their views. It started off in 2005 with an aim to reach every single room on campus via print issues and soon forayed into online media with the establishment of it's website.\nQuite a number of issues in, The Scholars' Avenue raised the issue of the condition of the B. C. Roy hospital and reported about a strike within campus. Amidst misunderstandings, major decisions were made which included a ban on the Scholars' Avenue and curtailment of its website. The ban lasted less than a month and TSA decided to no longer stay under the Gymkhana – a move that made it free to decide its content but also left it financially crippled.\nThe Website\nThe Scholars' Avenue also has a large readership on their website where news is not the only thing that gets published. They also do a number of articles on different genres as listed below.\nInterviews\nA number of interviews are conducted whenever any major personality is in Campus, during elections, and various other situations that would be of potential interest to the KGP populace.\n||\nLink to the Interview Section\n||\nGuestAve\nGuestAve is an open section where anyone, from a fresher to The Student Senate can publish their articles from, after approaching the team. This section is mostly used by the Alums, The Gymkana, The Student Senate, among others, to convey information to the KGP readers.\n||\nLink to the Guestave section\n||\nInternPedia\nIt is a compilation of answers to the most frequently asked-for metrics and a detailed walkthrough of the nitty-gritty of the process. It contains an abounding number of companies, with a wide spectrum of profiles, making it the one-stop solution to all of your dilemmas and queries regarding the process of CDC Internships every year.\nTnPedia\nElection Issue\nFreshers Issue\nCampus initiatives\nAMA on Reddit\nAtal Ashutosh Agarwal, the then\nVP\nof\nTSG\n, participated in an AMA (\"Ask Me Anything\") organised by ScholsAve on the \"thescholarsavenue\" subreddit in 2015.\n[\n2\n]\nReferences\n↑\n\"TSA Website - About Us\"\n. The Scholars' Avenue\n. Retrieved\nAugust 16,\n2014\n.\n↑\n\"I am Atal Ashutosh Agarwal, Vice President of the Technology Students' Gymkhana. Ask Me Anything!\"\n. September 8, 2015\n. Retrieved\nSeptember 8,\n2015\n.\nContact Managing Editors\nPratim Majumdar: +91 7622074074\nGouri Rajaram: +91 9900638792\nVaishnav Lembhe: +91 7775810993\nVatsal Krishna: +91 9765837717\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=The_Scholars%27_Avenue&oldid=233207\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Rajnikant_Pandey",
        "title": "Rajnikant Pandey",
        "content": "Rajnikant Pandey\nDepartment\nMathematics\nResearch Area(s)\nDifferential Equations (Ordinary)\nTheoretical Numerical Analysis\nSingular Boundary Value Problems\nYear Joined\n2004\nemail\n[email protected]\nSee Also\nDepartment of Mathematics\nExternal links\nRajnikant Pandey\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Rajnikant_Pandey&oldid=6285\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Sushanta_Kumar_Panda",
        "title": "Sushanta Kumar Panda",
        "content": "Sushanta Kumar Panda\nDepartment\nMechanical Engineering\nResearch Area(s)\nSheet metal forming processes\nSheet and tube hydroforming\nFormability testing design and development\nPlasticity for metal deformation modelling and simulation\nFriction stir processing of sheet metal\nYear Joined\n2009\nemail\n[email protected]\nSee Also\nDepartment of Mechanical Engineering\nExternal links\nSushanta Kumar Panda\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Sushanta_Kumar_Panda&oldid=6338\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/Soumitra_Paul",
        "title": "Soumitra Paul",
        "content": "Soumitra Paul\nDepartment\nMechanical Engineering\nResearch Area(s)\nMachining and Grinding\nCutting Tool Coating\nYear Joined\n1995\nemail\n[email protected]\nSee Also\nDepartment of Mechanical Engineering\nExternal links\nSoumitra Paul\non iitkgp.ac.in\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=Soumitra_Paul&oldid=6330\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/GG49009:_Igneous_Petrogenesis_Lab",
        "title": "GG49009: Igneous Petrogenesis Lab",
        "content": "GG49009\nCourse name\nIgneous Petrogenesis Lab\nOffered by\nGeology and Geophysics\nCredits\n2\nPrevious Year Grade Distribution\n{{{grades}}}\nSemester\n{{{semester}}}\nSyllabus\nSyllabus mentioned in ERP\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nTuesday\nWednesday\nMicroscopy Lab.\nMicroscopy Lab.\nMicroscopy Lab.\nMicroscopy Lab.\nThursday\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=GG49009:_Igneous_Petrogenesis_Lab&oldid=56631\n\""
    },
    {
        "url": "https://wiki.metakgp.org/w/CE31001:_Design_Of_Rc_Structure",
        "title": "CE31001: Design Of Rc Structure",
        "content": "CE31001\nCourse name\nDesign Of Rc Structure\nOffered by\nCivil Engineering\nCredits\n4\nL-T-P\n3-1-0\nPrevious Year Grade Distribution\n1\n2\n16\n13\n28\n16\n17\nEX\nA\nB\nC\nD\nP\nF\nSemester\nAutumn\nSyllabus\nSyllabus mentioned in ERP\n(May be modified by the concerned Department) Introduction to the design of\nConcrete structures; Limit state Analysis; Design of beams for flexure, bond,\nshear and torsion; Axially and eccentrically loaded Columns; One and two-way\nSlabs, Flat Slabs, Ribbed slabs; ; Footings, isolated and combined;\nFoundations, Raft and pile; Stair cases; Water Tanks and Retaining Walls.\nConcepts taught in class\nStudent Opinion\nHow to Crack the Paper\nClassroom resources\nAdditional Resources\nTime Table\nDay\n8:00-8:55 am\n9:00-9:55 am\n10:00-10:55 am\n11:00-11:55 am\n12:00-12:55 pm\n2:00-2:55 pm\n3:00-3:55 pm\n4:00-4:55 pm\n5:00-5:55 pm\nMonday\nNR411\nTuesday\nWednesday\nNR411\nNR411\nThursday\nNR411\nFriday\nRetrieved from \"\nhttps://wiki.metakgp.org/index.php?title=CE31001:_Design_Of_Rc_Structure&oldid=173621\n\""
    }
]